{
	"addonId": "virtualNotesForNVDA",
	"displayName": "Virtual Notes For NVDA (creates virtual notes to be read by NVDA)",
	"URL": "https://github.com/juliano-lopes/virtual-notes-for-NVDA/releases/download/v1.1.0/virtualNotesForNVDA-1.1.0.nvda-addon",
	"description": "\nThis add-on (Virtual Notes for NVDA) creates virtual notes that can be read by NVDA screen reader. Here are the available steps:  \n* Select text;  \n* Use shortcuts (all starting with the keys \"NVDA + Alt\").  \nBy pressing these keys combined with specific letters, you can perform the following actions:\n* A: Add a new temporary note to memory;  \n* J: Go to the previous note;  \n* L: Go to the next note;  \n* U: Read out the current note;  \n* S: Replace the note in the current position (you need to select some text first);  \n* D: Delete the note in the current position.  \nIf the current note contains multiple lines (like text copied from a text editor), use these additional letters:  \n* I: Move to the previous line of the current note;  \n* K: Move to the next line of the current note;  \n* O: read out the current line of the current note.  \nNote: The key positions mimic the arrow keys (I = up, L = right, K = down, and J = left).  \nAfter using a shortcut, a specific sound will play to indicate the action performed.\n\n",
	"sha256": "7b64a3c5af03c10c3d74918f870836d13e178def725d0a852ab00f161406296b",
	"addonVersionName": "1.1.0",
	"addonVersionNumber": {
		"major": 1,
		"minor": 1,
		"patch": 0
	},
	"minNVDAVersion": {
		"major": 2019,
		"minor": 3,
		"patch": 0
	},
	"lastTestedVersion": {
		"major": 2024,
		"minor": 1,
		"patch": 0
	},
	"channel": "stable",
	"publisher": "Juliano Lopes",
	"sourceURL": "https://github.com/juliano-lopes/virtual-notes-for-NVDA/",
	"license": "GPL v2",
	"homepage": "https://github.com/juliano-lopes/virtual-notes-for-NVDA",
	"licenseURL": "https://www.gnu.org/licenses/gpl-2.0.html",
	"translations": [
		{
			"language": "pt_BR",
			"displayName": "Notas Virtuais para o NVDA (crie notas virtuais para serem lidas pelo NVDA)",
			"description": "\nEste complemento (Virtual Notes for NVDA) cria notas virtuais que podem ser lidas pelo leitor de telas NVDA. Aqui estão as etapas disponíveis:  \n* Selecione algum  texto;  \n* Use atalhos (todos começando com as teclas “NVDA + Alt”).  \nAo pressionar essas teclas combinadas com letras específicas, você pode realizar as seguintes ações:\n* A: Adicione uma nova nota temporária à memória;  \n* J: Vai para a nota anterior;  \n* L: Vai para a próxima nota;  \n* U: Anuncia a nota atual;  \n* S: Substitui a nota na posição atual (você precisa selecionar algum texto primeiro);  \n* D: Exclui a nota na posição atual.  \nSe a nota atual contiver várias linhas (como texto copiado de um editor de texto), use estas letras adicionais:  \n* I: Move para a linha anterior da nota atual;  \n* K: Move para a próxima linha da nota atual;  \n* O: Anuncia a linha atual da nota atual.  \nObservação: As posições das teclas são similares às setas do teclado (I = para cima, L = direita, K = para baixo e J = esquerda).  \nApós usar um atalho, um som específico será reproduzido para indicar a ação realizada.\n\n"
		}
	]
}