{
	"addonId": "VisionAssistant",
	"displayName": "Vision Assistant Pro",
	"URL": "https://github.com/mahmoodhozhabri/VisionAssistantPro/releases/download/4.0.2/VisionAssistant-4.0.2.nvda-addon",
	"description": "An advanced AI assistant for NVDA using Gemini models.\nCommand Layer: Press NVDA+Shift+V, then:\n- Smart Translator (T) / Clipboard (Shift+T)\n- Text Refiner (R)\n- Describe Object (V) / Full Screen (O)\n- Online Video Analysis (Shift+V)\n- Document Reader (D)\n- File OCR (F)\n- CAPTCHA Solver (C)\n- Audio Transcription (A)\n- Smart Dictation (S)\n- Announce Status (L)\n- Check Update (U)",
	"sha256": "1be26ac4f464a1fcdcde717d78379a7b044e840708f70d5c04c1bce8e05f1b20",
	"addonVersionName": "4.0.2",
	"addonVersionNumber": {
		"major": 4,
		"minor": 0,
		"patch": 2
	},
	"minNVDAVersion": {
		"major": 2019,
		"minor": 3,
		"patch": 0
	},
	"lastTestedVersion": {
		"major": 2025,
		"minor": 3,
		"patch": 1
	},
	"channel": "stable",
	"publisher": "Mahmood Hozhabri",
	"sourceURL": "https://github.com/mahmoodhozhabri/VisionAssistantPro",
	"license": "GPL v2",
	"homepage": "https://github.com/mahmoodhozhabri/VisionAssistantPro",
	"changelog": "## Changes for 4.0.1\n*   **Advanced Document Reader:** A powerful new viewer for PDF and images with page range selection, background processing, and seamless `Ctrl+PageUp/Down` navigation.\n*   **New Tools Submenu:** Added a dedicated \"Vision Assistant\" submenu under NVDA's Tools menu for quicker access to core features, settings, and documentation.\n*   **Flexible Customization:** You can now choose your preferred OCR engine and TTS voice directly from the settings panel.\n*   **Multiple API Key Support:** Added support for multiple Gemini API keys. You can enter one key per line or separate them with commas in the settings.\n*   **Alternative OCR Engine:** Introduced a new OCR engine to ensure reliable text recognition even when hitting Gemini API quota limits.\n*   **Smart API Key Rotation:** Automatically switches to and remembers the fastest working API key to bypass quota limits.\n*   **Document to MP3/WAV:** Integrated capability to generate and save high-quality audio files in both MP3 (128kbps) and WAV formats directly within the reader.\n*   **Instagram Stories Support:** Added the ability to describe and analyze Instagram Stories using their URLs.\n*   **TikTok Support:** Introduced support for TikTok videos, allowing for full visual description and audio transcription of clips.\n*   **Redesigned Update Dialog:** Features a new accessible interface with a scrollable text box to clearly read version changes before installing.\n*   **Unified Status & UX:** Standardized file dialogs across the add-on and enhanced the 'L' command to report real-time progress.",
	"licenseURL": "https://www.gnu.org/licenses/gpl-2.0.html",
	"submissionTime": 1769679929000,
	"translations": [
		{
			"language": "fa",
			"displayName": "دستیارِ حرفه‌ایِ بینایی",
			"description": "An advanced AI assistant for NVDA using Gemini models.\nCommand Layer: Press NVDA+Shift+V, then:\n- Smart Translator (T) / Clipboard (Shift+T)\n- Text Refiner (R)\n- Describe Object (V) / Full Screen (O)\n- Online Video Analysis (Shift+V)\n- Document Reader (D)\n- File OCR (F)\n- CAPTCHA Solver (C)\n- Audio Transcription (A)\n- Smart Dictation (S)\n- Announce Status (L)\n- Check Update (U)",
			"changelog": "## Changes for 4.0.1\n*   **Advanced Document Reader:** A powerful new viewer for PDF and images with page range selection, background processing, and seamless `Ctrl+PageUp/Down` navigation.\n*   **New Tools Submenu:** Added a dedicated \"Vision Assistant\" submenu under NVDA's Tools menu for quicker access to core features, settings, and documentation.\n*   **Flexible Customization:** You can now choose your preferred OCR engine and TTS voice directly from the settings panel.\n*   **Multiple API Key Support:** Added support for multiple Gemini API keys. You can enter one key per line or separate them with commas in the settings.\n*   **Alternative OCR Engine:** Introduced a new OCR engine to ensure reliable text recognition even when hitting Gemini API quota limits.\n*   **Smart API Key Rotation:** Automatically switches to and remembers the fastest working API key to bypass quota limits.\n*   **Document to MP3/WAV:** Integrated capability to generate and save high-quality audio files in both MP3 (128kbps) and WAV formats directly within the reader.\n*   **Instagram Stories Support:** Added the ability to describe and analyze Instagram Stories using their URLs.\n*   **TikTok Support:** Introduced support for TikTok videos, allowing for full visual description and audio transcription of clips.\n*   **Redesigned Update Dialog:** Features a new accessible interface with a scrollable text box to clearly read version changes before installing.\n*   **Unified Status & UX:** Standardized file dialogs across the add-on and enhanced the 'L' command to report real-time progress."
		},
		{
			"language": "fr",
			"displayName": "Vision Assistant Pro",
			"description": "Un assistant IA avancé pour NVDA utilisant les modèles Gemini.\nCommandes séquentielles : appuyez sur NVDA+Shift+V, puis :Fonctionnalités :\n- Traducteur intelligent (T) / Presse-papiers (Maj+T)\n- Analyseur de texte (R)\n- Décrire l'objet (V) / Tout l'écran (O)\n- Analyse de vidéos en ligne (Maj+V)\n- Lecteur de document (D)\n- Reconnaissance de texte d'un fichier (F)\n- Résolution de CAPTCHA (C)\n- Transcription audio (A)\n- Dictée intelligente (S)\n- Annonce du statut (L)\n- Vérification des mises à jour (U)",
			"changelog": "## Changements de la version 4.0.1\n*   **Lecteur de documents avancé :** Un nouveau visualiseur puissant pour les PDF et les images avec sélection d'intervalle de pages, traitement en arrière-plan, et navigation fluide avec `Ctrl+PagePréc/Suiv`.\n*   **Nouveau sous-menu sous Outils :** Ajout d'un sous-menu dédié \"Vision Assistant\" sous le menu Outils de NVDA pour un accès plus rapide aux fonctionnalités principales, aux paramètres et à la documentation.\n*   **Personnalisation flexible :** Vous pouvez désormais choisir votre moteur OCR et votre voix TTS préférés directement à partir du panneau des paramètres.\n*   **Prise en charge de clés API multiples :** Ajout de la prise en charge de clés API Gemini multiples. Vous pouvez saisir une clé par ligne ou les séparer par des virgules dans les paramètres.\n*   **Moteur d'OCR alternatif :** Introduction d'un nouveau moteur OCR pour garantir une reconnaissance de texte fiable même lorsque les limites de quota de l'API Gemini sont atteintes.\n*   **Rotation intelligente des clés API :** Bascule automatiquement vers et mémorise la clé API qui fonctionne le plus rapidement pour contourner les limites de quota.\n*   **Conversion de document en MP3/WAV :** Intégration de la possibilité de générer et enregistrer des fichiers audio de haute qualité aux formats MP3 (128 kbps) et WAV directement dans le lecteur.\n* **Prise en charge des Stories Instagram :** Ajout de la possibilité de décrire et d'analyser les Stories Instagram à l'aide de leurs URL.\n* **Prise en charge de TikTok :** Introduction de la prise en charge des vidéos TikTok, permettant une description visuelle complète et une transcription audio des clips.\n*   **Redesign de la boîte de dialogue de mise à jour :** Comprend une nouvelle interface accessible avec une zone de texte déroulante pour lire clairement les modifications de version avant l'installation.\n*   **Statut et expérience utilisateur unifiés :** Boîtes de dialogue de fichiers standardisées dans l'extension et amélioration de la commande 'L' pour annoncer la progression en temps réel."
		},
		{
			"language": "id",
			"displayName": "Vision Assistant Pro",
			"description": "Asisten AI canggih untuk NVDA yang menggunakan model Gemini.\nLapisan Perintah: Tekan NVDA+Shift+V, lalu:\n- Penerjemah Cerdas (T) / Terjemahkan yang ada di Papan Klip (Shift+T)\n- Penyempurna Teks (R)\n- Deskripsikan Objek (V) / Layar Penuh (O)\n- Analisis Video Secara Online (Shift+V)\n- Pembaca Dokumen (D)\n- Berkas OCR (P)\n- Pemecah CAPTCHA (C)\n- Transkripsi Audio (A)\n- Dikte Cerdas (S)\n- Umumkan Kerja add-on saat ini (L)\n- Periksa Pembaruan (U)",
			"changelog": "## Perubahan untuk 4.0.1\n* **Pembaca Dokumen Tingkat Lanjut:** Penampil baru yang canggih untuk PDF dan gambar dengan pemilihan rentang halaman, pemrosesan latar belakang, dan navigasi `Ctrl+PageUp/Down` yang lancar.\n* **Submenu Alat Baru:** Menambahkan submenu khusus \"Vision Assistant\" di dalam menu Tools NVDA untuk akses lebih cepat ke fitur inti, pengaturan, dan dokumentasi.\n* **Kustomisasi Fleksibel:** Kini Anda dapat memilih mesin OCR dan suara TTS pilihan Anda langsung dari panel pengaturan.\n* **Dukungan Beberapa Kunci API:** Menambahkan dukungan untuk beberapa kunci API Gemini untuk memastikan layanan berkelanjutan. Anda dapat memasukkan satu kunci per baris atau memisahkannya dengan koma di pengaturan.\n* **Mesin OCR Alternatif:** Memperkenalkan mesin OCR baru untuk memastikan pengenalan teks yang andal bahkan ketika mencapai batas kuota API Gemini.\n* **Rotasi Kunci API Cerdas:** Secara otomatis beralih ke dan mengingat kunci API yang bekerja paling cepat untuk melewati batas kuota tanpa intervensi manual.\n* **Ubah Dokumen ke Audio:** Kemampuan terintegrasi untuk menghasilkan dan menyimpan file audio berkualitas tinggi (WAV) dari halaman dokumen langsung di dalam pembaca dokumen.\n*   **Dukungan untuk Instagram Stories:** Menambahkan kemampuan untuk mendeskripsikan dan menganalisis Instagram Stories melalui URL.\n*   **Mendukung Deskripsi video TikTok** Memperkenalkan dukungan untuk video TikTok, memungkinkan deskripsi visual lengkap dan transkripsi audio klip.\n* **Dialog Pembaruan yang Didesain Ulang:** Menampilkan antarmuka baru yang dapat diakses dengan kotak teks yang dapat digulir untuk membaca dengan jelas perubahan versi sebelum menginstal.\n* **Status & UX Terpadu:** Dialog file standar di seluruh add-on dan menyempurnakan perintah 'L' untuk melaporkan kemajuan real-time untuk semua tugas latar belakang."
		},
		{
			"language": "it",
			"displayName": "Vision Assistant Pro",
			"description": "Un assistente AI avanzato per NVDA che utilizza modelli Gemini.\nLayer Comandi: Premi NVDA+Shift+V, poi:\n- Traduttore intelligente (T) / Blocco appunti (Shift+T)\n- Miglioramento testo (R)\n- Descrivi l'oggetto (V) / Schermo intero (O)\n- Analisi video online (Shift+V)\n- Lettore Documenti (D)\n- File OCR (F)\n- Risolutore CAPTCHA (C)\n- Trascrizione audio (A)\n- Dettatura intelligente (S)\n- Annuncia lo stato (L)\n- Controllo aggiornamenti (U)",
			"changelog": "## Cambiamenti nella versione 4.0.1\n* **Lettore di documenti avanzato:** Un nuovo potente visualizzatore per PDF e immagini con selezione di intervalli di pagine, elaborazione in background e navigazione con Ctrl+PaginaSu/Giù senza soluzione di continuità.\\n\n* **Nuovo sottomenu Strumenti:** Aggiunto un sottomenu dedicato \"Vision Assistant\" nel menu Strumenti di NVDA per un accesso più rapido alle funzionalità principali, alle impostazioni e alla documentazione.\\n\n* **Personalizzazione flessibile:** ora puoi scegliere il motore OCR e la voce TTS preferiti direttamente dal pannello delle impostazioni.\\n\n* **Supporto per chiavi API multiple:** Aggiunto supporto per più chiavi API Gemini. Puoi inserire una chiave per riga o separarle con virgole nelle impostazioni.\\n\n* **Motore OCR alternativo:** Introdotto un nuovo motore OCR per garantire un riconoscimento affidabile del testo anche quando si raggiungono i limiti di quota dell'API Gemini.\\n\n* **Rotazione intelligente della chiave API:** Passa automaticamente e ricorda la chiave API più veloce per aggirare i limiti di quota.\\n\n* **Documento in MP3/WAV:** Funzionalità integrata per generare e salvare file audio di alta qualità sia nei formati MP3 (128 kbps) che WAV direttamente nel lettore.\\n\n* **Supporto per le storie di Instagram:** aggiunta la possibilità di descrivere e analizzare le storie di Instagram utilizzando i relativi URL.\\n\n* **Supporto TikTok:** introdotto il supporto per i video TikTok, che consente la descrizione visiva completa e la trascrizione audio dei clip.\\n\n* **Finestra di dialogo di aggiornamento riprogettata:** Presenta una nuova interfaccia accessibile con una casella di testo scorrevole per leggere chiaramente le modifiche alla versione prima dell'installazione.\\n\n* **Unified Status e UX:** Finestre di dialogo dei file standardizzate nel componente aggiuntivo e migliorato il comando 'L' per segnalare i progressi in tempo reale."
		},
		{
			"language": "pt_BR",
			"displayName": "Assistente de Visão Pro",
			"description": "Um assistente de IA avançado para NVDA usando modelos Gemini.\nCamada de Comandos: Pressione NVDA+Shift+v, em seguida:\nTradutor Inteligente (T) / Área de Transferência (Shift+T)\nRefinador de Texto (R)\nDescrever Objeto (V) / Tela Cheia (O)\nAnálise de Vídeo Online (Shift+V)\nLeitor de Documentos (D)\nOCR de Arquivos (F)\nSolucionador de CAPTCHA (C)\nTranscrição de Áudio (A)\nDitado Inteligente (S)\nAnunciar Status (L)\nVerificar Atualizações (U)",
			"changelog": "## Mudanças para 4.0.1\\n\n* **Leitor de documentos avançado:** um novo e poderoso visualizador de PDF e imagens com seleção de intervalo de páginas, processamento em segundo plano e navegação perfeita com `Ctrl+PageUp/Down`.\\n\n* **Novo submenu Ferramentas:** Adicionado um submenu dedicado \"Vision Assistant\" no menu Ferramentas do NVDA para acesso mais rápido aos principais recursos, configurações e documentação.\\n\n* **Personalização flexível:** agora você pode escolher seu mecanismo de OCR e voz TTS preferidos diretamente no painel de configurações.\\n\n* **Suporte a múltiplas chaves de API:** Adicionado suporte para múltiplas chaves de API Gemini. Você pode inserir uma chave por linha ou separá-las com vírgulas nas configurações.\\n\n* **Mecanismo de OCR alternativo:** foi introduzido um novo mecanismo de OCR para garantir reconhecimento de texto confiável mesmo quando atingir os limites de cota da API Gemini.\\n\n* **Rotação inteligente de chaves de API:** alterna automaticamente e lembra a chave de API que funciona mais rápido para contornar os limites de cota.\\n\n* **Documento para MP3/WAV:** Capacidade integrada para gerar e salvar arquivos de áudio de alta qualidade nos formatos MP3 (128 kbps) e WAV diretamente no leitor.\\n\n* **Suporte para Histórias do Instagram:** foi adicionada a capacidade de descrever e analisar Histórias do Instagram usando seus URLs.\\n\n* **Suporte ao TikTok:** suporte introduzido para vídeos do TikTok, permitindo descrição visual completa e transcrição de áudio dos clipes.\\n\n* **Caixa de diálogo de atualização redesenhada:** apresenta uma nova interface acessível com uma caixa de texto rolável para ler claramente as alterações de versão antes da instalação.\\n\n* **Status & UX unificados:** Diálogos de arquivos padronizados em todo o complemento e aprimoramento do comando 'L' para relatar o progresso em tempo real."
		},
		{
			"language": "pt_PT",
			"displayName": "Assistente de Visão Pro",
			"description": "Um assistente de IA avançado para NVDA utilizando modelos Gemini.\nCamada de Comandos: Pressione NVDA+Shift+v, em seguida:\n- Tradutor Inteligente (T) / Área de Transferência (Shift+T)\n- Refinador de Texto (R)\n- Descrever Objeto (V) / Ecrã Cheio (O)\n- Análise de Vídeo Online (Shift+V)\n- Leitor de Documentos (D)\n- OCR de Ficheiros (F)\n- Solucionador de CAPTCHA (C)\n- Transcriçãode Áudio (A)\n- Ditado Inteligente (S)\n- Anunciar Estado (L)\n- Verificar Atualizações (U)",
			"changelog": "## Alterações para a 4.0.1\n* Leitor de documentos avançado: Um novo e poderoso visualizador de PDF e imagens com seleção de intervalo de páginas, processamento em segundo plano e navegação fluida com `Ctrl+PageUp/Down`.\n* Novo submenu Ferramentas: Foi adicionado um submenu dedicado \"Vision Assistant\" no menu Ferramentas do NVDA para acesso mais rápido às funcionalidades principais, definições e documentação.\n* Personalização flexível: Agora pode escolher o seu motor de OCR e voz TTS preferidos diretamente no painel de definições.\n* Suporte para múltiplas chaves de API: Adicionado suporte para múltiplas chaves de API Gemini. Pode introduzir uma chave por linha ou separá-las por vírgulas nas definições.\n* Motor de OCR alternativo: Foi introduzido um novo motor de OCR para garantir um reconhecimento de texto fiável mesmo ao atingir os limites de cota da API Gemini.\n* Rotação inteligente de chaves de API: Alterna automaticamente e memoriza a chave de API que funciona mais rapidamente para contornar os limites de cota.\n* Documento para MP3/WAV: Capacidade integrada para gerar e guardar ficheiros de áudio de alta qualidade nos formatos MP3 (128 kbps) e WAV diretamente no leitor.\n* Suporte para Histórias do Instagram: Foi adicionada a capacidade de descrever e analisar Histórias do Instagram utilizando os seus URLs.\n* Suporte para o TikTok: Introduzido suporte para vídeos do TikTok, permitindo descrição visual completa e transcrição de áudio dos clipes.\n* Caixa de diálogo de atualização redesenhada: Apresenta uma nova interface acessível com uma caixa de texto rolável para ler claramente as alterações de versão antes da instalação.\n* Estado & UX unificados: Caixas de diálogo de ficheiros padronizadas em todo o complemento e melhoria do comando 'L' para reportar o progresso em tempo real."
		},
		{
			"language": "ru",
			"displayName": "Vision Assistant (Визуальный помощник)",
			"description": "Дополнение Vision Assistant - это продвинутый ИИ-помощник для NVDA, использующий модели Gemini.\nКомандный слой: нажмите NVDA+Shift+V, затем:.\nУмный переводчик (T) / Перевод из буфера (Shift+T)\nУлучшение текста (R).\nОписать объект (V) / Весь экран (O).\nАнализ онлайн-видео (Shift+V).\nСредство чтения документов (D).\nРаспознавание текста из файла (F).\nРешение CAPTCHA (C).\nРасшифровка аудио (A).\nУмный голосовой ввод (S).\nОтчёт о состоянии (L).\nПроверка обновлений (U).",
			"changelog": "## Изменения в версии 4.0.1\n*   **Продвинутое средство чтения документов:** Мощный новый просмотрщик для PDF и изображений с выбором диапазона страниц, фоновой обработкой и плавной навигацией с помощью `Ctrl+PageUp/Down`.\n*   **Новое подменю \"Инструменты\":** Добавлено специальное подменю \"Vision Assistant\" в меню \"Инструменты\" NVDA для быстрого доступа к основным функциям, настройкам и документации.\n*   **Гибкая настройка:** Теперь вы можете выбрать предпочитаемый движок OCR и голос TTS прямо из панели настроек.\n*   **Поддержка нескольких ключей API:** Добавлена поддержка нескольких ключей API Gemini. Вы можете вводить один ключ на строку или разделять их запятыми в настройках.\n*   **Альтернативный движок OCR:** Представлен новый движок OCR для обеспечения надёжного распознавания текста даже при достижении лимитов квоты API Gemini.\n*   **Умная ротация ключей API:** Автоматически переключается на самый быстрый рабочий ключ API и запоминает его для обхода лимитов квот.\n*   **Преобразование документа в MP3/WAV:** Интегрирована возможность создавать и сохранять высококачественные аудиофайлы в форматах MP3 (128 кбит/с) и WAV прямо в средстве чтения.\n*   **Поддержка историй Instagram:** Добавлена возможность описывать и анализировать истории Instagram по их URL.\n*   **Поддержка TikTok:** Добавлена поддержка видео TikTok, позволяющая получать полное визуальное описание и расшифровку аудио.\n*   **Переработанное диалоговое окно обновления:** Новый доступный интерфейс с прокручиваемым текстовым полем для чёткого чтения изменений версии перед установкой.\n*   **Унифицированный статус и UX:** Стандартизированы диалоги выбора файлов в дополнении и улучшена команда 'L' для отчёта о прогрессе в реальном времени."
		},
		{
			"language": "tr",
			"displayName": "Profesyonel Görsel Asistan",
			"description": "Gemini modellerini kullanan NVDA için gelişmiş bir yapay zeka asistanı.\nKomut Katmanı: NVDA+Shift+V tuşlarına basın ve ardından:\n- Akıllı Çeviri (T) / Pano (Shift+T)\n- Metin İyileştirici (R)\n- Nesneyi Betimle (V) / Tam ekran (O)\n- Çevrimiçi Video Analizi (Shift+V)\n- Belge Okuyucu (D)\n- Dosya OCR (F)\n- CAPTCHA Çözücü (C)\n- Ses dosyasını metne çevir (A)\n- Akıllı Dikte (S)\n- Durumu Seslendir (L)\n- Güncellemeleri Denetle (U)",
			"changelog": "## 4.0.1 için değişiklikler\n*   **Gelişmiş Belge Okuyucu:** Sayfa aralığı seçimi, arka planda işleme ve kesintisiz \"Ctrl+Sayfa Yukarı/Aşağı\" dolaşma özellikleriyle PDF ve görüntüler için yeni ve güçlü bir görüntüleyici.\n*   **Yeni Araçlar Alt Menüsü:** Temel özelliklere, ayarlara ve belgelere daha hızlı erişim için NVDA'nın Araçlar menüsü altına özel bir \"Görsel Asistan\" alt menüsü eklendi.\n*   **Esnek Özelleştirme:** Artık tercih ettiğiniz OCR motorunu ve TTS sesini doğrudan ayarlar panelinden seçebilirsiniz.\n*   **Çoklu API Anahtarı Desteği:** Birden fazla Gemini API anahtarı için destek eklendi. Ayarlarda her satıra bir anahtar girebilir veya bunları virgülle ayırabilirsiniz.\n*   **Alternatif OCR Motoru:** Gemini API kota sınırlarına ulaşıldığında bile güvenilir metin tanıma sağlamak için yeni bir OCR motoru kullanıma sunuldu.\n*   **Akıllı API Anahtarı Döndürme:** Kota sınırlarını aşmak için otomatik olarak en hızlı çalışan API anahtarına geçiş yapar ve onu hatırlar.\n*   **MP3/WAV'a belge:** Hem MP3 (128kbps) hem de WAV formatlarında yüksek kaliteli ses dosyalarını doğrudan okuyucunun içinde oluşturma ve kaydetmeye yönelik entegre yetenek.\n*   **Instagram Hikayeleri Desteği:** URL'lerini kullanarak Instagram Hikayelerini tanımlama ve analiz etme yeteneği eklendi.\n*   **TikTok Desteği:** Kliplerin tam görsel betimlemesine ve sesli transkripsiyonuna olanak tanıyan TikTok videoları için destek eklendi.\n*   **Yeniden Tasarlanan Güncelleme İletişim Kutusu:** Yüklemeden önce sürüm değişikliklerini net bir şekilde okumak için kaydırılabilir bir metin kutusu içeren yeni, erişilebilir bir arayüz içerir.\n*   **Birleşik Durum ve UX:** Eklenti genelinde standartlaştırılmış dosya iletişim kutuları ve gerçek zamanlı ilerlemeyi bildirmek için 'L' komutu geliştirildi."
		},
		{
			"language": "uk",
			"displayName": "Vision Assistant Pro",
			"description": "Розширений ШІ-асистент для NVDA, що використовує моделі Gemini.\nКомандний рівень: натисніть NVDA+Shift+V, а потім:\n- Розумний перекладач (T) / Буфер обміну (Shift+T)\n- Очищення тексту (R)\n- Опис об'єкта (V) / Повний екран (O)\n- Онлайн-аналіз відео (Shift+V)\n- Читач документів (D)\n- OCR файлів (F)\n- Розв'язування CAPTCHA (C)\n- Транскрипція аудіо (A)\n- Розумне диктування (S)\n- Оголошення статусу (L)\n- Перевірка оновлень (U)",
			"changelog": "## Зміни у версії 4.0\n*   **Розширений читач документів:** новий потужний переглядач PDF-файлів та зображень із можливістю вибору діапазону сторінок, фоновою обробкою та безперервною навігацією за допомогою комбінації клавіш Ctrl+PageUp/Down.\n*   **Нове підменю «Інструменти»:** у меню «Інструменти» NVDA додано спеціальне підменю «Vision Assistant» для швидшого доступу до основних функцій, налаштувань та документації.\n*   **Гнучке налаштування:** тепер ви можете вибрати бажаний механізм OCR та голос TTS безпосередньо в панелі налаштувань.\n*   **Підтримка декількох API-ключів:** додано підтримку декількох API-ключів Gemini для забезпечення безперервної роботи служби. Ви можете ввести один ключ на рядок або розділити їх комами в налаштуваннях.\n*   **Альтернативний механізм OCR:** Впроваджено новий механізм OCR для забезпечення надійного розпізнавання тексту навіть при досягненні лімітів квоти Gemini API.\n*   **Розумна зміна API-ключів:** Автоматично перемикається на найшвидший API-ключ і запам'ятовує його, щоб обійти ліміти квоти без ручного втручання.\n* **Документ у MP3/WAV:** інтегрована можливість створювати та зберігати високоякісні аудіофайли у форматах MP3 (128 кбіт/с) та WAV безпосередньо в програмі.\n* **Підтримка Instagram Stories:** додано можливість описувати та аналізувати Instagram Stories за допомогою їх URL-адрес.\n* **Підтримка TikTok:** додано підтримку відео TikTok, що дозволяє здійснювати повний візуальний опис та аудіотранскрипцію кліпів.\n* **Перероблений діалог оновлення:** Новий доступний інтерфейс із прокручуваним текстовим полем, що дозволяє чітко прочитати зміни версії перед встановленням.\n* **Уніфікований статус і UX:** Стандартизовані діалогові вікна файлів у всьому додатку та вдосконалена команда «L» для повідомлення про хід виконання всіх фонових завдань у режимі реального часу."
		},
		{
			"language": "vi",
			"displayName": "Vision Assistant Pro",
			"description": "Trợ lý AI nâng cao cho NVDA sử dụng các mô hình Gemini.\nLớp lệnh: Nhấn NVDA+Shift+V, sau đó:\n- Dịch thuật thông minh (T) / Dịch bộ nhớ tạm (Shift+T)\n- Tinh chỉnh văn bản (R)\n- Mô tả đối tượng (V) / Toàn màn hình (O)\n- Phân tích Video trực tuyến (Shift+V)\n- Hỏi đáp tài liệu (D)\n- Nhận diện văn bản OCR (F)\n- Giải mã CAPTCHA (C)\n- Chuyển tệp âm thanh thành văn bản (A)\n- Soạn thảo giọng nói thông minh (S)\n- Thông báo trạng thái (L)\n- Kiểm tra cập nhật (U)",
			"changelog": "## Những thay đổi cho phiên bản 4.0\n* **Trình đọc tài liệu nâng cao:** Trình xem PDF và hình ảnh mạnh mẽ mới, hỗ trợ chọn phạm vi trang, xử lý trong nền và điều hướng mượt mà bằng phím `Ctrl+PageUp/Down`.\n* **Trình đơn phụ mới:** Đã thêm trình đơn \"Vision Assistant\" vào menu Công cụ của NVDA để truy cập nhanh các tính năng, cài đặt và tài liệu.\n* **Tùy biến linh hoạt:** Bạn có thể chọn công cụ OCR và giọng đọc TTS ưa thích ngay trong bảng cài đặt.\n* **Hỗ trợ nhiều khóa API:** Cho phép nhập nhiều khóa API Gemini (mỗi dòng một khóa hoặc cách nhau bằng dấu phẩy) để đảm bảo hoạt động liên tục.\n* **Công cụ OCR thay thế:** Bổ sung công cụ OCR mới để đảm bảo nhận diện văn bản ổn định khi API Gemini đạt giới hạn hạn mức.\n* **Tự động luân chuyển khóa API:** Hệ thống tự động chuyển và ghi nhớ khóa API hoạt động nhanh nhất để vượt qua giới hạn hạn mức.\n* **Chuyển tài liệu thành âm thanh:** Tích hợp khả năng tạo và lưu tệp âm thanh chất lượng cao (WAV) từ các trang tài liệu trực tiếp trong trình đọc.\n* **Hỗ trợ story trên Instagram:** Đã thêm khả năng mô tả và phân tích Story trên Instagram bằng URL của chúng.\\n\n* **Hỗ trợ TikTok:** Giới thiệu hỗ trợ cho video TikTok, cho phép mô tả đầy đủ bằng hình ảnh và phiên âm âm thanh của clip.\\n\n* **Cải tiến hộp thoại cập nhật:** Giao diện mới hỗ trợ tiếp cận tốt hơn với khung văn bản có thể cuộn để đọc nội dung thay đổi rõ ràng hơn.\n* **Hợp nhất trạng thái & trải nghiệm:** Chuẩn hóa các hộp thoại chọn tệp và cải tiến lệnh 'L' để báo cáo tiến độ thời gian thực của các tác vụ chạy nền."
		}
	],
	"vtScanUrl": "https://www.virustotal.com/gui/file/1be26ac4f464a1fcdcde717d78379a7b044e840708f70d5c04c1bce8e05f1b20",
	"scanResults": {
		"codeQL-warnings": [
			{
				"ruleId": "py/incomplete-url-substring-sanitization",
				"rule": {
					"id": "py/incomplete-url-substring-sanitization",
					"index": 4,
					"toolComponent": {
						"index": 0
					}
				},
				"message": {
					"text": "The string [instagram.com](1) may be at an arbitrary position in the sanitized URL."
				},
				"locations": [
					{
						"physicalLocation": {
							"artifactLocation": {
								"uri": "addon/globalPlugins/visionAssistant/__init__.py",
								"uriBaseId": "%SRCROOT%",
								"index": 0
							},
							"region": {
								"startLine": 2887,
								"startColumn": 20,
								"endColumn": 45
							}
						}
					}
				],
				"partialFingerprints": {
					"primaryLocationLineHash": "2913bc0dd513cd37:1",
					"primaryLocationStartColumnFingerprint": "11"
				},
				"relatedLocations": [
					{
						"id": 1,
						"physicalLocation": {
							"artifactLocation": {
								"uri": "addon/globalPlugins/visionAssistant/__init__.py",
								"uriBaseId": "%SRCROOT%",
								"index": 0
							},
							"region": {
								"startLine": 2887,
								"startColumn": 20,
								"endColumn": 35
							}
						},
						"message": {
							"text": "instagram.com"
						}
					}
				]
			},
			{
				"ruleId": "py/incomplete-url-substring-sanitization",
				"rule": {
					"id": "py/incomplete-url-substring-sanitization",
					"index": 4,
					"toolComponent": {
						"index": 0
					}
				},
				"message": {
					"text": "The string [tiktok.com](1) may be at an arbitrary position in the sanitized URL."
				},
				"locations": [
					{
						"physicalLocation": {
							"artifactLocation": {
								"uri": "addon/globalPlugins/visionAssistant/__init__.py",
								"uriBaseId": "%SRCROOT%",
								"index": 0
							},
							"region": {
								"startLine": 2889,
								"startColumn": 21,
								"endColumn": 43
							}
						}
					}
				],
				"partialFingerprints": {
					"primaryLocationLineHash": "ecbb1fd672237310:1",
					"primaryLocationStartColumnFingerprint": "12"
				},
				"relatedLocations": [
					{
						"id": 1,
						"physicalLocation": {
							"artifactLocation": {
								"uri": "addon/globalPlugins/visionAssistant/__init__.py",
								"uriBaseId": "%SRCROOT%",
								"index": 0
							},
							"region": {
								"startLine": 2889,
								"startColumn": 21,
								"endColumn": 33
							}
						},
						"message": {
							"text": "tiktok.com"
						}
					}
				]
			},
			{
				"ruleId": "py/overly-large-range",
				"rule": {
					"id": "py/overly-large-range",
					"index": 5,
					"toolComponent": {
						"index": 0
					}
				},
				"message": {
					"text": "Suspicious character range that overlaps with \\w in the same character class."
				},
				"locations": [
					{
						"physicalLocation": {
							"artifactLocation": {
								"uri": "addon/globalPlugins/visionAssistant/lib/markdown/extensions/wikilinks.py",
								"uriBaseId": "%SRCROOT%",
								"index": 1
							},
							"region": {
								"startLine": 54,
								"startColumn": 33,
								"endColumn": 36
							}
						}
					}
				],
				"partialFingerprints": {
					"primaryLocationLineHash": "519eb9bd4ab56ccd:1",
					"primaryLocationStartColumnFingerprint": "24"
				}
			}
		],
		"codeQL-errors": [],
		"virusTotal": [
			{
				"_id": "1be26ac4f464a1fcdcde717d78379a7b044e840708f70d5c04c1bce8e05f1b20",
				"_type": "file",
				"filecondis": {
					"dhash": "0000000004070600",
					"raw_md5": "5fcbdd0aa28cd93e316ae899534407be"
				},
				"first_submission_date": 1769679991,
				"last_analysis_results": {},
				"last_analysis_stats": {
					"confirmed-timeout": 0,
					"failure": 0,
					"harmless": 0,
					"malicious": 0,
					"suspicious": 0,
					"timeout": 0,
					"type-unsupported": 0,
					"undetected": 0
				},
				"last_modification_date": 1769679993,
				"last_submission_date": 1769679991,
				"md5": "b46652fdc0e120701582052315df2d29",
				"names": [],
				"reputation": 0,
				"sha1": "3185bdee393e9701c9c33df9776302ddb5be4f7f",
				"sha256": "1be26ac4f464a1fcdcde717d78379a7b044e840708f70d5c04c1bce8e05f1b20",
				"size": 18289341,
				"tags": [],
				"times_submitted": 1,
				"total_votes": {
					"harmless": 0,
					"malicious": 0
				},
				"type_description": "unknown",
				"type_tags": [],
				"unique_sources": 1
			}
		]
	}
}
