{
	"addonId": "updateChannel",
	"displayName": "Update channel selector",
	"URL": "https://github.com/nvda-es/updateChannel/releases/download/v1.8/updateChannel-1.8.nvda-addon",
	"description": "This add-on allows you to switch quickly between NVDA snapshots and release types. Go to the update channel category on the NVDA settings dialog, choose your update channel and check for updates from the NVDA help menu. Choose the stable option and update again to return to an official release.",
	"sha256": "598603bc528ffbb09a78fb70448644e4fc12509fada8d4082542aed2d7f2bc04",
	"addonVersionName": "1.8",
	"addonVersionNumber": {
		"major": 1,
		"minor": 8,
		"patch": 0
	},
	"minNVDAVersion": {
		"major": 2023,
		"minor": 3,
		"patch": 4
	},
	"lastTestedVersion": {
		"major": 2024,
		"minor": 1,
		"patch": 0
	},
	"channel": "stable",
	"publisher": "jmdaweb",
	"sourceURL": "https://github.com/nvda-es/updateChannel",
	"license": "GPL v2",
	"homepage": "https://github.com/nvda-es/updateChannel",
	"licenseURL": "https://www.gnu.org/licenses/gpl-2.0.html",
	"translations": [
		{
			"language": "bg",
			"displayName": "Избор на канал за обновяване (Update channel selector)",
			"description": "Тази добавка ви позволява бързо да превключвате между тестовите и стабилните версии на NVDA. Отидете до категорията \"Канал за обновяване\" в диалоговия прозорец с настройките на NVDA, изберете вашия канал за обновяване и проверете за обновления от менюто \"Помощ\" на NVDA. Изберете опцията \"Стабилна\" и обновете отново, за да се върнете към стабилната версия."
		},
		{
			"language": "cs",
			"displayName": "Výběr aktualizačního kanálu",
			"description": "Tento doplněk umožňuje rychlé přepínání mezi aktualizačními kanály vývojových či stabilních vydání NVDA. V dialogu nastavení NVDA přejděte do kategorie aktualizační kanál, vyberte požadovaný aktualizační kanál a zkontrolujte aktualizace z nabídky nápovědy NVDA. Abyste se vrátili k oficiálnímu vydání NVDA, vyberte aktualizační kanál stabilní verze a znovu skontrolujte aktualizace."
		},
		{
			"language": "de",
			"displayName": "Update-Kanal-Auswahl",
			"description": "Mit dieser NVDA-Erweiterung können Sie schnell zwischen NVDA-Snapshots und Release-Typen wechseln. Wählen Sie in den NVDA-Einstellungen die Kategorie \"Update-Kanal-Auswahl\" aus, wählen Sie dann den gewünschten Update-Kanal aus und suchen Sie im Hilfemenü von NVDA nach Updates. Wählen Sie die stabile Option aus und starten Sie das Update erneut, um zu einer offiziellen Version zurückzukehren."
		},
		{
			"language": "es",
			"displayName": "Selector del canal de actualización",
			"description": "Este complemento te permite cambiar rápidamente entre tipos de versiones de desarrollo de NVDA y liberaciones. Ve a la categoría Canal de actualización en el diálogo de opciones de NVDA, elige tu canal de actualización y busca actualizaciones desde el menú Ayuda de NVDA. Elige la opción estable y actualiza de nuevo para volver a una liberación oficial."
		},
		{
			"language": "fa",
			"displayName": "انتخاب‌گرِ کانالِ بروزرسانی",
			"description": "این افزونه به شما اجازه میدهد بسرعت بینِ نسخه‌های فوری و رسمیِ NVDA جابجا بشوید. به دسته‌ی کانالِ بروزرسانی در تنظیماتِ NVDA بروید، کانالِ بروزرسانی را انتخاب کنید، و بروزرسانی‌ها را از منوی راهنما بررسی کنید. برای برگشتن به یک نسخه‌ی رسمی، گزینه‌ی پایدار را انتخاب و دوباره بروزرسانی کنید."
		},
		{
			"language": "fi",
			"displayName": "Päivityskanavan valitsin",
			"description": "Tämän lisäosan avulla voit nopeasti vaihtaa NVDA:n kehitysversioiden ja julkaisutyyppien välillä. Siirry NVDA:n asetusvalintaikkunassa Päivityskanava-kategoriaan, valitse haluamasi päivityskanava ja tarkista päivitykset NVDA:n Ohje-valikosta. Valitse Vakaa-vaihtoehto ja päivitä uudelleen palataksesi viralliseen versioon."
		},
		{
			"language": "fr",
			"displayName": "Sélecteur du canal de mise à jour",
			"description": "Cette extension vous permet de changer rapidement entre les types de versions de développement de NVDA et releases. Accédez à  la catégorie Canal de mise à jour du dialogue Paramètres de NVDA, choisissez votre   canal de mise à jour  et recherchez des mises à jour à partir du menu Aide de NVDA. Choisissez l'option stable et mettez à jour à nouveau pour revenir à une version officielle."
		},
		{
			"language": "gl",
			"displayName": "Selector de canle de actualización",
			"description": "Este complemento permíteche cambiar rapidamente entre versións experimentais de NVDA e tipos de versións. Vai á categoría canle de actualización no diálogo de opcións de NVDA; escolle a túa canle de actualización e e comproba actualizacións dende o menú de axuda de NVDA. Escolle a opción estable e actualiza de novo para volver a unha versión oficial."
		},
		{
			"language": "hr",
			"displayName": "Selektor kanala za aktualiziranje",
			"description": "Ovaj dodatak omogućuje brzo prebacivanje između NVDA snimaka i vrsta izdanja. Idi u kategoriju kanala za aktualiziranje u dijaloškom okviru NVDA postavki, odaberi kanal za aktualiziranje i provjeri postoje li nove verzije u izborniku NVDA pomoći. Odaberi opciju stabilne verzije i ponovo aktualiziraj za vraćanje na službeno izdanje."
		},
		{
			"language": "it",
			"displayName": "Selettore del canale per gli aggiornamenti",
			"description": "Questo componente aggiuntivo consente di passare rapidamente tra snapshot di NVDA ed altri tipi di rilascio. Vai alla categoria del canale di aggiornamento nella finestra di dialogo delle impostazioni di NVDA, scegli il canale di aggiornamento e controlla gli aggiornamenti dal menu dell'aiuto di NVDA. Scegli l'opzione stabile e aggiorna di nuovo per tornare a una versione ufficiale."
		},
		{
			"language": "pl",
			"displayName": "Update channel selector",
			"description": "Ten dodatek umożliwia szybkie przełączanie między migawkami NVDA i typami wydań. Przejdź do kategorii kanału aktualizacji w oknie dialogowym ustawień NVDA, wybierz kanał aktualizacji i sprawdź dostępność aktualizacji z menu pomocy NVDA. Wybierz opcję stabilną i zaktualizuj ponownie, aby powrócić do oficjalnego wydania."
		},
		{
			"language": "pt_PT",
			"displayName": "Selector de canais de actualização",
			"description": "Este extra permite alternar rapidamente entre os instantâneos do NVDA e as versões estáveis. Vá para a categoria de atualização de canal na caixa de diálogo de configurações do NVDA, escolha o seu canal de actualização e verifique se há actualizações no menu de ajuda do NVDA. Escolha a opção estável e actualize novamente para voltar a uma versão oficial estável."
		},
		{
			"language": "ro",
			"displayName": "Update channel selector",
			"description": "Acest supliment vă permite să treceți rapid de la instantaneele NVDA la tipurile de versiuni. Mergeți la categoria actualizare canal din panoul setărilor NVDA, alegeți-vă canalul de actualizare și căutați update-uri din meniul de ajutor al NVDA. Alegeți opțiunea stabilă și actualizați din nou pentru a vă întoarce la o versiune oficială."
		},
		{
			"language": "ru",
			"displayName": "Селектор канала обновления",
			"description": "Это дополнение позволяет быстро переключаться между снапшотами NVDA и типами релизов. Перейдите в категорию канала обновления в диалоговом окне настроек NVDA, выберите свой канал обновления и проверьте наличие обновлений в меню справки NVDA. Выберите стабильный вариант и снова обновитесь, чтобы вернуться к официальному выпуску."
		},
		{
			"language": "sr",
			"displayName": "Birač kanala ažuriranja",
			"description": "Ovaj dodatak vam dozvoljava da se brzo prebacujete između NVDA stabilnih i verzija za testiranje. Posetite kategoriju kanal ažuriranja NVDA dijaloga sa podešavanjima, izaberite vaš kanal ažuriranja a zatim proverite dostupna ažuriranja iz NVDA menija pomoći. Izaberite opciju stabilne verzije kako biste se ažuriranjem vratili na poslednju stabilnu verziju."
		},
		{
			"language": "tr",
			"displayName": "Güncelleme Kanalı Seçici",
			"description": "Bu eklenti, NVDA anlık görüntüleri ve çıkış türleri arasında hızlıca geçiş yapmanızı sağlar. NVDA ayarları iletişim kutusundaki güncelleme kanalı kategorisine gidin, istediğiniz güncelleme kanalını seçin ve NVDA yardım menüsünden güncellemeleri kontrol edin. Resmi sürüme geri dönmek için kararlı seçeneğini seçin ve NVDA'yı yeniden güncelleyin."
		},
		{
			"language": "uk",
			"displayName": "Вибір каналу оновлення",
			"description": "Цей додаток дозволяє швидко перемикатися між снепшотами і типами релізів NVDA. Увійдіть у категорію «Вибір каналу оновлень NVDA» у налаштуваннях NVDA, оберіть бажаний канал оновлення і перевірте наявність оновлень у меню довідки NVDA. Оберіть стабільний канал і оновіть щераз, щоб повернутися до стабільного релізу."
		},
		{
			"language": "zh_CN",
			"displayName": "更新通道选择器",
			"description": "这个插件可以让您在 NVDA 的各个版本之间进行快速切换。进入 NVDA 设置面板 / 更新通道类别下，选择一个所需的更新通道，然后在 NVDA 帮助菜单内“检查更新”。比如选择“稳定版”选项，执行“检查更新”就可以回到稳定版。"
		}
	],
	"reviewUrl": "https://github.com/nvaccess/addon-datastore/discussions/2811"
}
