{"addonId": "stationPlaylist", "displayName": "StationPlaylist", "URL": "https://github.com/ChrisDuffley/stationPlaylist/releases/download/26.01/stationPlaylist-26.01.nvda-addon", "description": "Улучшает поддержку приложений StationPlaylist. Кроме того, добавлены глобальные команды для приложения Studio.", "sha256": "fe384ce88a046a8b1561fa31157ee698b01095fcfa82babbd619356f663c45c5", "addonVersionName": "26.01", "addonVersionNumber": {"major": 26, "minor": 1, "patch": 0}, "minNVDAVersion": {"major": 2025, "minor": 3, "patch": 2}, "lastTestedVersion": {"major": 2025, "minor": 3, "patch": 2}, "channel": "stable", "publisher": "josephsl", "sourceURL": "https://github.com/ChrisDuffley/stationPlaylist", "license": "GPL v2", "homepage": "https://github.com/ChrisDuffley/stationPlaylist", "changelog": "* NVDA 2025.3.2 or later is required.\n* Add-on settings screen is now available while using Creator, Remote VT, and Track Tool with different settings for each app.\n* NVDA will announce labels for SPL app screens, including track properties, insert tracks dialog's search criteria controls (Studio, Creator, Remote VT), and Studio options dialog.\n* In Studio (local and remote), Creator, and Remote VT, NVDA will play a beep when search is completed in insert tracks dialog when NVDA is configured to play beeps for status announcements from SPL add-on settings/general category.\n* In Studio (local and remote) and Track Tool, NVDA will no longer announce dialog property content (description) in places such as track properties and Studio options screen.\n* In local Studio, NVDA will be less verbose when performing library rescan from insert tracks dialog (Control+Shift+R).\n* In local Studio, NVDA will report library scan count regardless of \"beep for status announcements\" setting from add-on settings.\n* In Remote Studio, when closing options screen (Control+O) while cart explorer is active, it is no longer necessary to reenter Cart Explorer to view updated cart assignments.\n* Resolved several issues while using insert tracks dialog in Remote Studio, including NVDA saying \"scan start\" when pressing Control+Shift+R and verbose output for search results status.\n* In track list in Creator and Track Tool, pressing Alt+number row keys to change column sort order will cause NVDA to announce the new sort order based on the column selected. There will be a delay when performing these commands in Creator.\n* In Creator, Remote VT, and Track Tool, status bar content will be reported when performing read status bar command (NVDA+End/desktop layout, NVDA+Shift+End/laptop layout). In particular, improved status bar content announcement performance in Creator.\n* In Creator and Remote VT, NVDA will announce search results count when searching for tracks in insert tracks dialog.\n* In Creator and Remote VT, NVDA will no longer appear to do nothing or play error tones when reporting playlist information from playlist editor such as playlist hour and day, scheduled, and rotation.", "licenseURL": "https://www.gnu.org/licenses/gpl-2.0.html", "submissionTime": 1766450437000}