{"addonId": "AIContentDescriber", "displayName": "Descripteur de contenu IA", "URL": "https://github.com/cartertemm/AI-content-describer/releases/download/v2025.06.17/AIContentDescriber-2025.06.17.nvda-addon", "description": "This add-on makes it possible to describe the focus object, navigator object, or screen using popular vision capable AI language models, like Claude, Gemini, or GPT4.\nIt also lets one understand where their face is positioned in the frame of a connected camera.\nThough content descriptions are quite detailed, they may not always be completely accurate or reflect real world information.\nPress NVDA+shift+i to pop up a menu asking how you wish to describe based on the current position, or NVDA+shift+u to describe the navigator object, or NVDA+shift+y for an image that has been copied to the clipboard such as in windows explorer, or NVDA+alt+i to ask additional questions about a description. Other keystrokes are customizable from the input gestures dialog.\nBy default, usage of GPT4 is free, thanks to the generocity of the team at PollinationsAI.\nIf you would like to use other models from OpenAI, head to https://platform.openai.com/account/api-keys and create an account, then create a key for interacting with the API.\nThen, choose the \"AI content describer\" category from NVDA's settings dialog -> manage models and enter your API key.\nThe process is similar for other model providers, see add-on documentation for more information on this.", "sha256": "9828fae0105ee763944979760d9f347a5d1efa99645ad999e91cb5cdc96d4d94", "addonVersionName": "2025.06.17", "addonVersionNumber": {"major": 2025, "minor": 6, "patch": 17}, "minNVDAVersion": {"major": 2023, "minor": 1, "patch": 0}, "lastTestedVersion": {"major": 2025, "minor": 1, "patch": 0}, "channel": "stable", "publisher": "Carter Temm, Carter Temm <cartertemm@gmail.com> and other contributors", "sourceURL": "https://github.com/cartertemm/AI-content-describer/", "license": "GPL v2", "licenseURL": "https://www.gnu.org/licenses/gpl-2.0.html", "submissionTime": 1750194945000}