{"addonId": "AIContentDescriber", "displayName": "Popis obsahu pomocí AI", "URL": "https://github.com/cartertemm/AI-content-describer/releases/download/v2025.02.05/AIContentDescriber-2025.02.05.nvda-addon", "description": "Tento doplněk umožňuje popsat aktuální fokus, prohlížený objekt nebo celou obrazovku pomocí populárních jazykových modelů umělé inteligence se strojovým viděním, jako je Claude, Gemini nebo GPT4.\nUmožňuje také zjistit, kde se nachází vaše tvář v záběru připojené kamery.\nPřestože jsou popisy obsahu poměrně detailní, nemusí vždy být zcela přesné nebo odpovídat reálným skutečnostem.\nChcete-li začít s GPT, navštivte stránku https://platform.openai.com/account/api-keys, vytvořte si zde účet a poté si vytvořte API klíč pro interakci s rozhraním této služby. Pro více informací si přečtěte nápovědu k doplňku.\nPoté v dialogu Nastavení NVDA vyberte kategorii \"Popis obsahu pomocí AI\" -> Spravovat modely a zde zadejte svůj API klíč.\nStiskněte klávesovou zkratku NVDA+shift+i a z nabídky, která se objeví, vyberte, co přesně si přejete popsat, nebo stiskněte klávesovou zkratku NVDA+shift+u pro popis aktuálně prohlíženého objektu, nebo NVDA+shift+y pro popis obrázku, který jste zkopírovali do schránky například v Průzkumníku Windows. Další klávesové zkratky si můžete přiřadit v dialogu Klávesové příkazy.", "sha256": "16a3c671a65203898d66111f1e8b4508e96c163ecb77233e2ff4f77d85c4dac9", "addonVersionName": "2025.02.05", "addonVersionNumber": {"major": 2025, "minor": 2, "patch": 5}, "minNVDAVersion": {"major": 2023, "minor": 1, "patch": 0}, "lastTestedVersion": {"major": 2024, "minor": 1, "patch": 0}, "channel": "stable", "publisher": "Carter Temm and contributors", "sourceURL": "https://github.com/cartertemm/AI-content-describer/", "license": "GPL v2", "licenseURL": "https://www.gnu.org/licenses/gpl-2.0.html", "submissionTime": 1738831875000, "reviewUrl": "https://github.com/nvaccess/addon-datastore/discussions/2048"}