{
	"addonId": "bluetoothaudio",
	"displayName": "BluetoothAudio",
	"URL": "https://github.com/mltony/nvda-bluetooth-audio/releases/download/v1.5.1/bluetoothaudio-1.5.1.nvda-addon",
	"description": "Bluetooth Audio is  an NVDA add-on that improves sound quality when working with bluetooth headphones or speakers.",
	"sha256": "bbac3cfee102dd49d24a3e872ca2009f89680592c2ae9335a377182961e22efc",
	"addonVersionName": "1.5.1",
	"addonVersionNumber": {
		"major": 1,
		"minor": 5,
		"patch": 1
	},
	"minNVDAVersion": {
		"major": 2019,
		"minor": 2,
		"patch": 0
	},
	"lastTestedVersion": {
		"major": 2023,
		"minor": 1,
		"patch": 0
	},
	"channel": "stable",
	"publisher": "Tony Malykh <anton.malykh@gmail.com>",
	"sourceURL": "https://github.com/mltony/nvda-bluetooth-audio",
	"license": "GPL v2",
	"homepage": "https://github.com/mltony/nvda-bluetooth-audio",
	"licenseURL": "https://www.gnu.org/licenses/gpl-2.0.html",
	"translations": [
		{
			"language": "bg",
			"displayName": "Bluetooth Аудио",
			"description": "\"Bluetooth Аудио\" е добавка за NVDA, която подобрява качеството на звука при работа със слушалки или високоговорители, свързани посредством Bluetooth."
		},
		{
			"language": "da",
			"displayName": "BluetoothAudio",
			"description": "Bluetooth Audio er en tilføjelse til NVDA, der forbedrer lydkvaliteten, når du arbejder med Bluetooth-hovedtelefoner eller højttalere."
		},
		{
			"language": "de",
			"displayName": "BluetoothAudio",
			"description": "Bluetooth Audio ist eine Erweiterung, die die Soundqualität von Lautsprechern oder kopfhöhrern in Verbindung mit NVDA verbessert."
		},
		{
			"language": "es",
			"displayName": "BluetoothAudio",
			"description": "Bluetooth Audio es un complemento de NVDA que mejora la calidad de sonido al trabajar con auriculares o altavoces Bluetooth."
		},
		{
			"language": "fi",
			"displayName": "BluetoothAudio",
			"description": "Bluetooth Audio on lisäosa, joka parantaa äänenlaatua bluetooth-kuulokkeita tai -kaiuttimia käytettäessä."
		},
		{
			"language": "fr",
			"displayName": "BluetoothAudio",
			"description": "Bluetooth Audio est une extension de NVDA qui améliore la qualité du son quand on travaille avec un casque ou des haut-parleurs bluetooth."
		},
		{
			"language": "gl",
			"displayName": "BluetoothAudio",
			"description": "Bluetooth Audio é un complemento para NVDA que mellora a calidade de son ao traballar con auriculares ou altofalantes bluetooth."
		},
		{
			"language": "he",
			"displayName": "BluetoothAudio",
			"description": "BluetoothAudio הינו תוסף nvda המשפר את איכות הקול בעבודה עם אוזניות והתקני קול מבוססי בלו טוס "
		},
		{
			"language": "hr",
			"displayName": "Bluetooth zvuk",
			"description": "Bluetooth zvuk je NVDA dodatak koji poboljšava kakvoću zvuka prilikom korištenja bluetooth slušalica ili zvučnika."
		},
		{
			"language": "hu",
			"displayName": "BluetoothAudio",
			"description": "A Bluetooth Audio bővítmény segít javítani a hangminőséget Bluetooth fülhallgatók és hangszórók  használata esetén."
		},
		{
			"language": "it",
			"displayName": "BluetoothAudio",
			"description": "Bluetooth Audio è un componente aggiuntivo che migliora la qualità del suono quando si utilizzano delle cuffie o degli altoparlanti Bluetooth."
		},
		{
			"language": "pl",
			"displayName": "BluetoothAudio",
			"description": "Bluetooth Audio poprawia jakość dźwięku w czasie korzystania z urządzeń bluetooth, takich jak słuchawki lub głośniki."
		},
		{
			"language": "pt_BR",
			"displayName": "Áudio Bluetooth",
			"description": "O Áudio Bluetooth é um complemento para NVDA que melhora a qualidade do som ao trabalhar com fones de ouvido ou alto-falantes bluetooth."
		},
		{
			"language": "pt_PT",
			"displayName": "BluetoothAudio",
			"description": "O Bluetooth Audio é um extra do NVDA que melhora a qualidade do som ao trabalhar com auscultadores ou altifalantes bluetooth."
		},
		{
			"language": "ro",
			"displayName": "Bluetooth audio",
			"description": "Bluetooth Audio este un supliment pentru NVDA care îmbunătățește calitatea sunetului atunci când lucrează cu căști bluetooth sau difuzoare."
		},
		{
			"language": "ru",
			"displayName": "BluetoothAudio",
			"description": "Bluetooth Audio — это дополнение для NVDA, улучшающее качество звука при работе с bluetooth-наушниками или колонками."
		},
		{
			"language": "sk",
			"displayName": "BluetoothAudio",
			"description": "Doplnok Bluetooth audio zlepšuje kvalitu reči NVDA pri používaní Bluetooth slúchadiel alebo reproduktorov."
		},
		{
			"language": "sr",
			"displayName": "BluetoothAudio",
			"description": "Bluetooth audio je NVDA dodatak koji poboljšava kvalitet zvuka kada radite sa Bluetooth zvučnicima ili slušalicama."
		},
		{
			"language": "sv",
			"displayName": "BluetoothAudio",
			"description": "Bluetooth Audio är ett tillägg till NVDA som  förbättrar ljudkvalitén när man använder bluetoothhörlurar eller bluetoothhögtalare."
		},
		{
			"language": "tr",
			"displayName": "BluetoothAudio",
			"description": "Bluetooth Audio, bluetooth kulaklık veya hoparlörlerle çalışırken ses kalitesini artıran bir NVDA eklentisidir."
		},
		{
			"language": "uk",
			"displayName": "BluetoothAudio",
			"description": "Bluetooth Audio - це додаток для NVDA, який поліпшує якість звуку під час роботи з Bluetooth-навушниками або динаміками."
		},
		{
			"language": "zh_CN",
			"displayName": "蓝牙音频",
			"description": "蓝牙音频是 NVDA 的插件，可在使用蓝牙耳机或蓝牙音箱时改进 NVDA 的语音效果。"
		}
	]
}
