{
	"addonId": "EnhancedDictionaries",
	"displayName": "Enhanced dictionaries processing for NVDA",
	"URL": "https://github.com/marlon-sousa/EnhancedDictionaries/releases/download/1.5.0/EnhancedDictionaries-1.5.0.nvda-addon",
	"description": "This addon introduces better dictionaries handling for NVDA.\nIt is now possible to use profile specific dictionaries, which eenables better productivity by allowing you to use different dictionaries for different applications and scenarius.",
	"sha256": "66990965f5ab75b4cfe82679f9ee9b41d468c0077de621ddea965a8e809d4af7",
	"addonVersionName": "1.5.0",
	"addonVersionNumber": {
		"major": 1,
		"minor": 5,
		"patch": 0
	},
	"minNVDAVersion": {
		"major": 2024,
		"minor": 1,
		"patch": 0
	},
	"lastTestedVersion": {
		"major": 2024,
		"minor": 1,
		"patch": 0
	},
	"channel": "stable",
	"publisher": "Marlon Sousa",
	"sourceURL": "https://github.com/marlon-sousa/EnhancedDictionaries",
	"license": "Mit License",
	"homepage": "https://github.com/marlon-sousa/EnhancedDictionaries",
	"licenseURL": "https://github.com/marlon-sousa/EnhancedDictionaries/blob/master/LICENSE",
	"translations": [
		{
			"language": "es",
			"displayName": "Procesamiento de diccionarios más avanzado para NVDA",
			"description": "Este complemento introduce mejoras en el procesamiento de diccionarios en NVDA.\nAhora puedes usar diccionarios específicos para cada perfil, lo que te permite una mayor productividad al posibilitar que diversos diccionarios sean usados en diferentes aplicaciones o para diferentes propósitos."
		},
		{
			"language": "fr",
			"displayName": "Traitement des dictionnaires plus avancés pour NVDA",
			"description": "Cette extension introduit des améliorations dans le traitement des dictionnaires dans NVDA.\nMaintenant, vous pouvez utiliser des dictionnaires spécifiques pour chaque profil, ce qui vous permet une plus grande productivité en permettant à divers dictionnaires d'être utilisés dans différentes applications ou à des fins différentes."
		},
		{
			"language": "hr",
			"displayName": "Poboljšana obrada rječnika za NVDA",
			"description": "Ovaj dodatak uvodi bolje rukovanje rječnicima za NVDA.\\n\nSada je moguće koristiti rječnike specifične za profil, što omogućuje bolju produktivnost dopuštajući vam korištenje različitih rječnika za različite aplikacije i scenarije."
		},
		{
			"language": "pt_BR",
			"displayName": "Processamento avançado de dicionários para NVDA",
			"description": "Este addon introduz melhorias no processamento de dicionários no NVDA. Agora é possível usar dicionários específicos para cada perfil, o que habilita maior produtividade ao permitir que diferentes dicionários sejam usados em diferentes aplicações ou para diferentes finalidades"
		},
		{
			"language": "pt_PT",
			"displayName": "Processamento avançado de dicionários para o NVDA",
			"description": "Este extra introduz melhorias no processamento de dicionários no NVDA. Agora, é possível usar dicionários específicos para cada perfil, o que permite uma maior produtividade ao possibilitar que dicionários diversos sejam usados em diferentes aplicações ou para finalidades diferenciadas."
		},
		{
			"language": "tr",
			"displayName": "NVDA için geliştirilmiş sözlükler işleme",
			"description": "Bu eklenti, NVDA'nın sözlük işlemesinde iyileştirmeler sunar.\nArtık her profil için özel sözlükler kullanabilirsiniz, bu da farklı sözlüklerin farklı uygulamalarda veya farklı amaçlarla kullanılmasına izin vererek daha fazla üretkenlik elde etmenizi sağlar."
		},
		{
			"language": "uk",
			"displayName": "Розширена обробка словників для NVDA",
			"description": "Цей додаток покращує роботу зі словниками для NVDA.\nТепер можна використовувати словники для конкретного профілю, що підвищує продуктивність, дозволяючи використовувати різні словники для різних програм та сценаріїв."
		}
	],
	"reviewUrl": "https://github.com/nvaccess/addon-datastore/discussions/2234"
}
