{
  "addonId": "AIContentDescriber",
  "displayName": "AI Content Describer",
  "URL": "https://github.com/cartertemm/AI-content-describer/releases/download/v2024.03.09/AIContentDescriber-2024.03.09.nvda-addon",
  "description": "This add-on makes it possible to describe the focus object, navigator object, or screen using the popular GPT4 vision artificial intelligence LLM.\nThough content descriptions are quite detailed, they may not always be completely accurate or reflect real world information.\nTo begin, head to https://platform.openai.com/account/api-keys and create an account, then create a key for interacting with the API. See add-on documentation for more information on this.\nThen, choose the \"AI content describer\" category from NVDA's settings dialog and enter your API key.\nPress NVDA+shift+i to pop up a menu asking how you wish to describe based on the current position, or NVDA+shift+u to describe the navigator object, or NVDA+shift+y for an image that has been copied to the clipboard such as in windows explorer. Other keystrokes are customizable from the input gestures dialog.",
  "sha256": "a74d1db863352465faa225d69907de8f949ad16ceaf07931185fa10606c12bb8",
  "addonVersionName": "2024.03.09",
  "addonVersionNumber": {
    "major": 2024,
    "minor": 3,
    "patch": 9
  },
  "minNVDAVersion": {
    "major": 2023,
    "minor": 1,
    "patch": 0
  },
  "lastTestedVersion": {
    "major": 2023,
    "minor": 2,
    "patch": 0
  },
  "channel": "stable",
  "publisher": "Carter Temm",
  "sourceURL": "https://github.com/cartertemm/AI-content-describer/",
  "license": "GPL v2",
  "licenseURL": "https://www.gnu.org/licenses/gpl-2.0.html",
  "translations": [
    {
      "language": "ru",
      "displayName": "Описатель контента с помощью ИИ",
      "description": "Это дополнение позволяет описать объект в фокусе, объект навигатора или экран с помощью популярного искусственного интеллекта GPT4 vision LLM.\nХотя описания контента довольно подробны, они не всегда могут быть полностью точными или отражать реальную информацию.\nДля начала перейдите на сайт https://platform.openai.com/account/api-keys и создайте учётную запись, а затем создайте ключ для взаимодействия с API. Более подробную информацию об этом можно найти в документации к дополнению.\nЗатем в диалоге настроек \nNVDA выберите категорию \"описатель контента с помощью ИИ\" и введите свой ключ API.\nНажмите NVDA + shift + i, чтобы вызвать меню с запросом о способе описания на основе текущей позиции, или NVDA+shift+u, чтобы описать объект навигатора, или NVDA+shift+y для изображения, скопированного в буфер обмена, например, в проводнике Windows. Другие сочетания клавиш можно настроить в диалоге жесты ввода."
    },
    {
      "language": "sr",
      "displayName": "AI opisivač sadržaja",
      "description": "Ovaj dodatak omogućava opisivanje fokusiranog objekta, navigacionog objekta, ili ekrana korišćenjem popularnog LLM modela GPT4 vision veštačke inteligencije.\nIako su opisi sadržaja poprilično detaljni, možda neće uvek biti potpuno precizni ili bidi u skladu sa informacijama u realnosti.\nDa biste počeli, posetite https://platform.openai.com/account/api-keys i napravite nalog, a zatim napravite ključ za API interakciju. Pogledajte dokumentaciju dodatka za više informacija o ovome.\nZatim, izaberite kategoriju \"AI opisivač sadržaja\" u dijalogu NVDA podešavanja i upišite vaš API ključ.\nPritisnite NVDA+šift+i da otvorite meni koji će vas upitati kako želite da dobijete opis u zavisnosti od trenutne pozicije, ili NVDA+šift+u da dobijete opis za navigacioni objekat i NVDA+šift+y za sliku koja je kopirana u privremenu memoriju nna primer iz Windows istraživača datoteka. Druge prečice se mogu prilagoditi iz dijaloga ulaznih komandi."
    },
    {
      "language": "uk",
      "displayName": "Описувач вмісту за допомогою ШІ",
      "description": "Цей додаток дає змогу описати об'єкт фокусування, об'єкт навігатора або екран за допомогою популярного штучного інтелекту GPT4 vision LLM.\nХоча описи вмісту є досить детальними, вони не завжди можуть бути повністю точними або відображати реальну інформацію.\nДля початку перейдіть на сайт https://platform.openai.com/account/api-keys і створіть обліковий запис, а потім створіть ключ для взаємодії з API. Докладнішу інформацію про це можна знайти в документації до додатка.\nПотім у діалозі налаштувань NVDA виберіть категорію \"Описувач вмісту за допомогою ШІ\" і введіть свій ключ API.\nНатисніть NVDA+shift+i, щоб викликати меню із запитом про спосіб опису на основі поточної позиції, або NVDA+shift+u, щоб описати об'єкт навігатора, або NVDA+shift+y для зображення, скопійованого до буфера обміну, наприклад, у провіднику Windows. Інші комбінації клавіш можна налаштувати у діалозі жести вводу."
    }
  ],
  "reviewUrl": "https://github.com/nvaccess/addon-datastore/discussions/2048"
}
