{
	"addonId": "AIContentDescriber",
	"displayName": "AI Content Describer",
	"URL": "https://github.com/cartertemm/AI-content-describer/releases/download/v2025.02.05/AIContentDescriber-2025.02.05.nvda-addon",
	"description": "This add-on makes it possible to describe the focus object, navigator object, or screen using popular vision capable AI language models, like Claude, Gemini, or GPT4.\nIt also lets one understand where their face is positioned in the frame of a connected camera.\nThough content descriptions are quite detailed, they may not always be completely accurate or reflect real world information.\nTo begin with GPT, head to https://platform.openai.com/account/api-keys and create an account, then create a key for interacting with the API. See add-on documentation for more information on this.\nThen, choose the \"AI content describer\" category from NVDA's settings dialog -> manage models and enter your API key.\nPress NVDA+shift+i to pop up a menu asking how you wish to describe based on the current position, or NVDA+shift+u to describe the navigator object, or NVDA+shift+y for an image that has been copied to the clipboard such as in windows explorer. Other keystrokes are customizable from the input gestures dialog.",
	"sha256": "16a3c671a65203898d66111f1e8b4508e96c163ecb77233e2ff4f77d85c4dac9",
	"addonVersionName": "2025.02.05",
	"addonVersionNumber": {
		"major": 2025,
		"minor": 2,
		"patch": 5
	},
	"minNVDAVersion": {
		"major": 2023,
		"minor": 1,
		"patch": 0
	},
	"lastTestedVersion": {
		"major": 2024,
		"minor": 1,
		"patch": 0
	},
	"channel": "stable",
	"publisher": "Carter Temm and contributors",
	"sourceURL": "https://github.com/cartertemm/AI-content-describer/",
	"license": "GPL v2",
	"licenseURL": "https://www.gnu.org/licenses/gpl-2.0.html",
	"submissionTime": 1738831875000,
	"translations": [
		{
			"language": "cs",
			"displayName": "Popis obsahu pomocí AI",
			"description": "Tento doplněk umožňuje popsat aktuální fokus, prohlížený objekt nebo celou obrazovku pomocí populárních jazykových modelů umělé inteligence se strojovým viděním, jako je Claude, Gemini nebo GPT4.\nUmožňuje také zjistit, kde se nachází vaše tvář v záběru připojené kamery.\nPřestože jsou popisy obsahu poměrně detailní, nemusí vždy být zcela přesné nebo odpovídat reálným skutečnostem.\nChcete-li začít s GPT, navštivte stránku https://platform.openai.com/account/api-keys, vytvořte si zde účet a poté si vytvořte API klíč pro interakci s rozhraním této služby. Pro více informací si přečtěte nápovědu k doplňku.\nPoté v dialogu Nastavení NVDA vyberte kategorii \"Popis obsahu pomocí AI\" -> Spravovat modely a zde zadejte svůj API klíč.\nStiskněte klávesovou zkratku NVDA+shift+i a z nabídky, která se objeví, vyberte, co přesně si přejete popsat, nebo stiskněte klávesovou zkratku NVDA+shift+u pro popis aktuálně prohlíženého objektu, nebo NVDA+shift+y pro popis obrázku, který jste zkopírovali do schránky například v Průzkumníku Windows. Další klávesové zkratky si můžete přiřadit v dialogu Klávesové příkazy."
		},
		{
			"language": "fr",
			"displayName": "Descripteur de contenu IA",
			"description": "Ce module complémentaire permet de décrire l'objet focal, l'objet navigateur ou l'écran à l'aide de modèles de langage d'IA populaires capables de vision, comme Claude, Gemini ou GPT4.\nIl permet également de comprendre où se situe un visage dans le cadre d'une caméra connectée.\nBien que les descriptions de contenu soient assez détaillées, elles peuvent ne pas toujours être tout à fait exactes ou refléter des informations réelles.\nPour commencer avec GPT, rendez-vous sur https://platform.openai.com/account/api-keys et créez un compte, puis créez une clé pour interagir avec l'API. Consultez la documentation du module complémentaire pour plus d’informations à ce sujet.\nEnsuite, choisissez la catégorie « Descripteur de contenu AI » dans la boîte de dialogue des paramètres de NVDA -> gérer les modèles et entrez votre clé API.\nAppuyez sur NVDA+shift+i pour faire apparaître un menu vous demandant comment vous souhaitez décrire en fonction de la position actuelle, ou NVDA+shift+u pour décrire l'objet navigateur, ou NVDA+shift+y pour une image qui a été copiée dans le presse-papiers comme dans l'explorateur Windows. D'autres raccourcis sont personnalisables à partir de la boîte de dialogue des gestes de saisie."
		},
		{
			"language": "ru",
			"displayName": "Описатель контента с помощью ИИ",
			"description": "Это дополнение позволяет описать объект в фокусе, объект навигатора или экран с помощью популярных языковых моделей искусственного интеллекта с поддержкой компьютерного зрения, таких как Claude, Gemini или GPT4.\nОно также позволяет вам понять, где находится лицо в кадре, с помощью подключённой камеры.\nХотя описания контента довольно подробны, они не всегда могут быть полностью точными или отражать реальную информацию.\nДля начала работы с GPT перейдите на страницу https://platform.openai.com/account/api-keys и создайте учётную запись, а затем создайте ключ для взаимодействия с API. Дополнительную информацию об этом см. В документации дополнения. \nЗатем в диалоге настроек NVDA выберите категорию \"описатель контента с помощью ИИ\" и введите свой ключ API.\nНажмите NVDA + shift + i, чтобы вызвать меню с запросом о способе описания объекта в фокусе, или NVDA+shift+u, чтобы описать объект навигатора, или NVDA+shift+y для изображения, скопированного в буфер обмена, например, в проводнике Windows.\nДругие сочетания клавиш можно настроить в диалоге жесты ввода."
		},
		{
			"language": "sk",
			"displayName": "Popis obsahu pomocou AI",
			"description": "Tento doplnok umožňuje popísať aktuálny fokus, prezeraný objekt alebo celú obrazovku pomocou populárnych jazykových modelov umelej inteligencie so strojovým videním, ako je Claude, Gemini alebo GPT4.\nUmožňuje tiež zistiť, kde sa nachádza vaša tvár v zábere pripojenej kamery.\nNapriek tomu, že sú popisy obsahu pomerne detailné, nemusia vždy byť úplne presné alebo zodpovedať reálnym skutočnostiam.\nAk chcete začať s GPT, navštívte stránku https://platform.openai.com/account/api-keys, vytvorte si tu účet a potom si vytvorte API kľúč pre interakciu s rozhraním tejto služby. Pre viac informácií si prečítajte nápovedu k doplnku.\nPotom v dialógu Nastavenia NVDA vyberte kategóriu \"Popis obsahu pomocou AI\" -> Spravovať modely a tu zadajte svoj API kľúč.\nStlačte klávesovú skratku NVDA+shift+i a z otvorenej ponuky vyberte, čo presne si prajete popísať, alebo stlačte klávesovú skratku NVDA+shift+u pre popis aktuálne prezeraného objektu, prípadne NVDA+shift+y pre popis obrázku, ktorý ste skopírovali do schránky napríklad v Prieskumníkovi Windows. Ďalšie klávesové skratky si môžete priradiť v dialógu Klávesové skratky."
		},
		{
			"language": "sr",
			"displayName": "AI opisivač sadržaja",
			"description": "This add-on makes it possible to describe the focus object, navigator object, or screen using popular vision capable AI language models, like Claude, Gemini, or GPT4.\nIt also lets one understand where their face is positioned in the frame of a connected camera.\nThough content descriptions are quite detailed, they may not always be completely accurate or reflect real world information.\nTo begin with GPT, head to https://platform.openai.com/account/api-keys and create an account, then create a key for interacting with the API. See add-on documentation for more information on this.\nThen, choose the \"AI content describer\" category from NVDA's settings dialog -> manage models and enter your API key.\nPress NVDA+shift+i to pop up a menu asking how you wish to describe based on the current position, or NVDA+shift+u to describe the navigator object, or NVDA+shift+y for an image that has been copied to the clipboard such as in windows explorer. Other keystrokes are customizable from the input gestures dialog."
		},
		{
			"language": "tr",
			"displayName": "Yapay Zeka İçerik Betimleyici",
			"description": "This add-on makes it possible to describe the focus object, navigator object, or screen using popular vision capable AI language models, like Claude, Gemini, or GPT4.\nIt also lets one understand where their face is positioned in the frame of a connected camera.\nThough content descriptions are quite detailed, they may not always be completely accurate or reflect real world information.\nTo begin with GPT, head to https://platform.openai.com/account/api-keys and create an account, then create a key for interacting with the API. See add-on documentation for more information on this.\nThen, choose the \"AI content describer\" category from NVDA's settings dialog -> manage models and enter your API key.\nPress NVDA+shift+i to pop up a menu asking how you wish to describe based on the current position, or NVDA+shift+u to describe the navigator object, or NVDA+shift+y for an image that has been copied to the clipboard such as in windows explorer. Other keystrokes are customizable from the input gestures dialog."
		},
		{
			"language": "uk",
			"displayName": "Описувач вмісту за допомогою ШІ",
			"description": "Цей додаток дає змогу описувати об’єкт у фокусі, об’єкт навігатора або екран за допомогою популярних мовних моделей штучного інтелекту з підтримкою зору, таких як Claude, Gemini або GPT4.\nЦе також дозволяє зрозуміти, де розташоване обличчя в кадрі за допомогою підключеної камери.\nХоча описи вмісту досить детальні, вони не завжди можуть бути повністю точними або відображати реальну інформацію.\nДля початку роботи з GPT перейдіть на сторінку https://platform.openai.com/account/api-keys і створіть обліковий запис, а потім створіть ключ для взаємодії з API. Додаткову інформацію про це див. у документації додатка.\nПотім у діалозі налаштувань NVDA виберіть категорію \"Описувач вмісту за допомогою ШІ\" і введіть свій ключ API.\nНатисніть NVDA+shift+i, щоб викликати меню із запитом про спосіб опису на основі поточної позиції, або NVDA+shift+u, щоб описати об'єкт навігатора, або NVDA+shift+y для зображення, скопійованого до буфера обміну, наприклад, у провіднику Windows. Інші комбінації клавіш можна налаштувати у діалозі жести вводу."
		}
	]
}