{
	"addonId": "numpadNavMode",
	"displayName": "Numpad Nav Mode",
	"URL": "https://github.com/opensourcesys/numpadNavMode/releases/download/v23.1.3/numpadNavMode-23.1.3.nvda-addon",
	"description": "Allows switching the numpad between NVDA navigation mode, and Windows navigation mode.\nEspecially useful if migrating from Jaws; or for laptop users preferring laptop mode, but who have a numpad and want to use it for arrow keys, etc.\nThe add-on also gives control of numlock state when starting NVDA or changing profiles..",
	"sha256": "0d52eb1333c05515fc6ab1d10032fe7f4471f624805e0cc2c057b355c42be88b",
	"addonVersionName": "23.1.3",
	"addonVersionNumber": {
		"major": 23,
		"minor": 1,
		"patch": 3
	},
	"minNVDAVersion": {
		"major": 2019,
		"minor": 3,
		"patch": 0
	},
	"lastTestedVersion": {
		"major": 2023,
		"minor": 1,
		"patch": 0
	},
	"channel": "stable",
	"publisher": "Luke Davis (Open Source Systems)",
	"sourceURL": "https://github.com/opensourcesys/numpadNavMode/",
	"license": "GPL v2",
	"homepage": "https://github.com/opensourcesys/numpadNavMode/blob/master/readme.md",
	"licenseURL": "https://www.gnu.org/licenses/gpl-2.0.html",
	"translations": [
		{
			"language": "bg",
			"displayName": "Навигационен режим на цифровия блок",
			"description": "Позволява превключване на цифровата клавиатура между режима на навигация на NVDA и режима на навигация на Windows.\nОсобено полезно, ако преминавате от JAWS. Или за потребители на лаптопи, предпочитащи лаптоп клавиатурната подредба, но които имат цифрова клавиатура и искат да я използват за навигация със стрелки и т.н.\nДобавката също така дава контрол върху състоянието на Num Lock при стартиране на NVDA или при промяна на конфигурационния профил."
		},
		{
			"language": "es",
			"displayName": "Numpad Nav Mode",
			"description": "Permite alternar el bloque numérico entre el modo de navegación de NVDA y el modo de navegación de Windows.\nEspecialmente útil si se migra desde Jaws, o para usuarios de portátiles que prefieren el modo portátil, pero que tienen un bloque numérico y quieren usarlo para pulsar las flechas, etc.\nEl complemento también da control del estado del bloqueo numérico al arrancar NVDA o cuando se cargan perfiles."
		},
		{
			"language": "fi",
			"displayName": "Laskinnäppäimistön navigointitila",
			"description": "Mahdollistaa laskinnäppäimistön vaihtamisen NVDA- ja Windows-navigointitilojen välillä.\nErityisen hyödyllistä JAWSista siirryttäessä tai kannettavien tietokoneiden käyttäjille, jotka käyttävät mieluummin kannettavan näppäimistöasettelua, mutta joilla on laskinnäppäimistö ja haluavat käyttää sitä nuolinäppäimiä varten jne.\nLisäosa voi myös hallita Numlockin tilaa NVDA:ta käynnistettäessä tai profiilia vaihdettaessa."
		},
		{
			"language": "fr",
			"displayName": "Numpad Nav Mode",
			"description": "Permet de basculer le pavé numérique entre le mode de navigation NVDA et le mode de navigation Windows.\nParticulièrement utile si la migration est à partir de Jaws ; ou pour les utilisateurs d'ordinateurs portables préférant le mode ordinateur portable, mais qui a un pavé numérique et qui souhaite l'utiliser pour les touches fléchées, etc.\nL'extension donne également le contrôle de l'état du verrouillage numérique lors du démarrage de NVDA ou des changements de profils."
		}
	]
}