{
	"addonId": "numpadNavMode",
	"displayName": "Numpad Nav Mode",
	"URL": "https://github.com/opensourcesys/numpadNavMode/releases/download/v23.1.1/numpadNavMode-23.1.1.nvda-addon",
	"description": "Allows switching the numpad between NVDA navigation mode, and Windows navigation mode.\nEspecially useful if migrating from Jaws; or for laptop users preferring laptop mode, but who have a numpad and want to use it for arrow keys, etc.\nThe add-on also gives control of numlock state when starting NVDA or changing profiles..",
	"sha256": "f2230e5ecbc2b2eccd7c844dbf2370d37c8fa2ed11ccb08396a146de22522854",
	"homepage": "https://github.com/opensourcesys/numpadNavMode/blob/master/readme.md",
	"addonVersionName": "23.1.1",
	"addonVersionNumber": {
		"major": 23,
		"minor": 1,
		"patch": 1
	},
	"minNVDAVersion": {
		"major": 2019,
		"minor": 3,
		"patch": 0
	},
	"lastTestedVersion": {
		"major": 2023,
		"minor": 1,
		"patch": 0
	},
	"channel": "stable",
	"publisher": "Open Source Systems, Ltd.",
	"sourceURL": "https://github.com/opensourcesys/numpadNavMode",
	"license": "GPL v2",
	"licenseURL": "https://www.gnu.org/licenses/gpl-2.0.html",
	"translations": [
		{
			"language": "es",
			"displayName": "Numpad Nav Mode",
			"description": "Permite alternar el bloque numérico entre el modo de navegación de NVDA y el modo de navegación de Windows.\nEspecialmente útil si se migra desde Jaws, o para usuarios de portátiles que prefieren el modo portátil, pero que tienen un bloque numérico y quieren usarlo para pulsar las flechas, etc.\nEl complemento también da control del estado del bloqueo numérico al arrancar NVDA o cuando se cargan perfiles."
		},
		{
			"language": "fi",
			"displayName": "Laskinnäppäimistön navigointitila",
			"description": "Mahdollistaa laskinnäppäimistön vaihtamisen NVDA- ja Windows-navigointitilojen välillä.\nErityisen hyödyllistä JAWSista siirryttäessä tai kannettavien tietokoneiden käyttäjille, jotka käyttävät mieluummin kannettavan näppäimistöasettelua, mutta joilla on laskinnäppäimistö ja haluavat käyttää sitä nuolinäppäimiä varten jne.\nLisäosa voi myös hallita Numlockin tilaa NVDA:ta käynnistettäessä tai profiilia vaihdettaessa."
		}
	]
}