{
	"addonId": "numpadNavMode",
	"displayName": "Numpad Nav Mode",
	"URL": "https://github.com/opensourcesys/numpadNavMode/releases/download/v23.1.8/numpadNavMode-23.1.8.nvda-addon",
	"description": "Allows switching the numpad between NVDA navigation mode, and Windows navigation mode.\nEspecially useful if migrating from Jaws; or for laptop users preferring laptop mode, but who have a numpad and want to use it for arrow keys, etc.\nThe add-on also gives control of numlock state when starting NVDA or changing profiles..",
	"sha256": "471eab786cebf0fc8ba3d9615951bc696be3ea06ff6ae035691b93aeabe4ff99",
	"addonVersionName": "23.1.8",
	"addonVersionNumber": {
		"major": 23,
		"minor": 1,
		"patch": 8
	},
	"minNVDAVersion": {
		"major": 2019,
		"minor": 3,
		"patch": 0
	},
	"lastTestedVersion": {
		"major": 2023,
		"minor": 2,
		"patch": 0
	},
	"channel": "stable",
	"publisher": "Luke Davis (Open Source Systems)",
	"sourceURL": "https://github.com/opensourcesys/numpadNavMode/",
	"license": "GPL v2",
	"homepage": "https://github.com/opensourcesys/numpadNavMode/blob/master/readme.md",
	"licenseURL": "https://www.gnu.org/licenses/gpl-2.0.html",
	"translations": [
		{
			"language": "bg",
			"displayName": "Навигационен режим на цифровия блок",
			"description": "Позволява превключване на цифровата клавиатура между режима на навигация на NVDA и режима на навигация на Windows.\nОсобено полезно, ако преминавате от JAWS. Или за потребители на лаптопи, предпочитащи лаптоп клавиатурната подредба, но които имат цифрова клавиатура и искат да я използват за навигация със стрелки и т.н.\nДобавката също така дава контрол върху състоянието на Num Lock при стартиране на NVDA или при промяна на конфигурационния профил."
		},
		{
			"language": "de",
			"displayName": "Navigationsmodus über den Nummernblock",
			"description": "Schaltet den Nummernblock zwischen dem Navigationsmodus von NVDA und Windows um.\nBesonders nützlich bei der Umstellung von JAWS; oder für Laptop-Benutzer, die den Laptop-Modus bevorzugen, aber einen Nummernblock haben und ihn für Pfeiltasten, etc. verwenden möchten.\nDie NVDA-Erweiterung ermöglicht auch die Kontrolle über den Status des Nummernblocks beim Starten von NVDA oder beim Wechsel des Profils..."
		},
		{
			"language": "es",
			"displayName": "Numpad Nav Mode",
			"description": "Permite alternar el bloque numérico entre el modo de navegación de NVDA y el modo de navegación de Windows.\nEspecialmente útil si se migra desde Jaws, o para usuarios de portátiles que prefieren el modo portátil, pero que tienen un bloque numérico y quieren usarlo para pulsar las flechas, etc.\nEl complemento también da control del estado del bloqueo numérico al arrancar NVDA o cuando se cargan perfiles."
		},
		{
			"language": "fi",
			"displayName": "Laskinnäppäimistön navigointitila",
			"description": "Mahdollistaa laskinnäppäimistön vaihtamisen NVDA- ja Windows-navigointitilojen välillä.\nErityisen hyödyllistä JAWSista siirryttäessä tai kannettavien tietokoneiden käyttäjille, jotka käyttävät mieluummin kannettavan näppäimistöasettelua, mutta joilla on laskinnäppäimistö ja haluavat käyttää sitä nuolinäppäimiä varten jne.\nLisäosa voi myös hallita Numlockin tilaa NVDA:ta käynnistettäessä tai profiilia vaihdettaessa."
		},
		{
			"language": "fr",
			"displayName": "Numpad Nav Mode",
			"description": "Permet de basculer le pavé numérique entre le mode de navigation NVDA et le mode de navigation Windows.\nParticulièrement utile si la migration est à partir de Jaws ; ou pour les utilisateurs d'ordinateurs portables préférant le mode ordinateur portable, mais qui a un pavé numérique et qui souhaite l'utiliser pour les touches fléchées, etc.\nL'extension donne également le contrôle de l'état du verrouillage numérique lors du démarrage de NVDA ou des changements de profils."
		},
		{
			"language": "gl",
			"displayName": "Numpad Nav Mode",
			"description": "Permite cambiar o bloque numérico entre o modo de navegación de NVDA e o modo de navegación de Windows.\nEspecialmente útil se se migra dende Jaws, ou para usuarios de portátiles que prefiren o modo portátil, pero que teñen un bloque numérico e queren usalo para premer as frechas, etc.\nO complemento tamén da o control do estado do bloqueo numérico ao arrancar o NVDA ou cando se cargan perfiles."
		},
		{
			"language": "pt_PT",
			"displayName": "Modo Numpad Nav",
			"description": "Permite alternar o numpad entre o modo de navegação NVDA, e o modo de navegação Windows.\nEspecialmente útil se migrar de jaws; ou para utilizadores de portáteis que preferem o modo portátil, mas que têm um numpad e o querem utilizar para teclas de setas, etc.\nO extra também dá o controlo do estado do numlock ao iniciar o NVDA ou ao alterar perfis..."
		},
		{
			"language": "ro",
			"displayName": "Numpad Nav Mode",
			"description": "Permite comutarea blocului numeric între modurile de navigare Windows și NVDA.\nEste util în special în cazul în care utilizatorii migrează de la JAWS sau pentru utilizatorii care preferă modul de laptop și ale căror laptop-uri au tastaturi cu bloc numeric, pe care utilizatorii poate vor să o folosească pe post de taste săgeți, etc.\nSuplimentul oferă și controlul stării blocului numeric la pornirea NVDA sau la modificarea profilurilor.."
		},
		{
			"language": "tr",
			"displayName": "Sayısal Tuş Takımı gezinme Modu",
			"description": "NVDA gezinme modu ile Windows gezinme modu arasında sayısal tuş takımının değiştirilmesine izin verir.\nÖzellikle daha önce Jaws kullananlar için kullanışlıdır; veya dizüstü bilgisayar modunu tercih eden ancak sayısal tuş takımına sahip olan ve onu ok tuşları vb. için kullanmak isteyen dizüstü bilgisayar kullanıcıları için.\nEklenti ayrıca, NVDA'yı başlatırken veya profilleri değiştirirken Numara kilidi tuşunun durumunun kontrolünü sağlar."
		},
		{
			"language": "uk",
			"displayName": "Режим навігації за допомогою цифрової клавіатури",
			"description": "Дозволяє перемикати цифрову клавіатуру між режимом навігації NVDA та режимом навігації Windows.\nОсобливо корисно, якщо ви переходите з Jaws; або для користувачів ноутбуків, які віддають перевагу режиму ноутбука, але мають цифрову клавіатуру і хочуть використовувати її для клавіш зі стрілками тощо.\nДодаток також дозволяє контролювати стан numlock при запуску NVDA або зміні профілю."
		}
	]
}
