{
	"displayName": "Braille Extender (legacy)",
	"publisher": "André-Abush Clause <dev@andreabc.net> and other contributors",
	"description": "BrailleExtender is a NVDA add-on that provides various features at braille level. Currently, the following features are implemented:\n* reload two favorite braille display with shortcuts.\n* automatic review cursor tethering in terminal role like in PuTTY, Powershell, bash, cmd.\n* auto scroll.\n* switch between several input/output braille tables.\n* mark the text with special attributes through dot 7, dot 8 or both.\n* use two output braille tables simultaneously.\n* display tab signs as spaces.\n* reverse forward scroll and back scroll buttons.\n* say the current line during text scrolling either in review mode, or in focus mode or both.\n* translate text easily in Unicode braille and vice versa. E.g.: z <--> ⠵.\n* convert cell description to Unicode braille and vice versa. E.g.: 123 <--> ⠇.\n* lock braille keyboard.\n* launch an application/URL with gesture.\n* braille dictionaries.\n* type with one-hand from braille keyboard.\n* display undefined characters from braille tables (including emojis) using altenative representations.\n* enter any character from braille keyboard (including emojis).\n* skip blank lines during text scrolling.\n* Speech History Mode.\n* and much more!\n\nFor some braille displays, it extends the braille display commands to provide:\n* offer complete gesture maps including function keys, multimedia keys, quick navigation, etc.;\n* emulate modifier keys, and thus any keyboard shortcut;\n* offer several keyboard configurations concerning the possibility to input dots 7 and 8, enter and backspace;\n* add actions and quick navigation through a rotor.",
	"addonId": "brlext",
	"addonVersionName": "23.02.18:9ff0db9",
	"addonVersionNumber": {
		"major": 23,
		"minor": 2,
		"patch": 19
	},
	"minNVDAVersion": {
		"major": 2019,
		"minor": 3,
		"patch": 0
	},
	"lastTestedVersion": {
		"major": 2022,
		"minor": 1,
		"patch": 0
	},
	"channel": "stable",
	"URL": "https://andreabc.net/projects/NVDA_addons/BrailleExtender/latest",
	"sha256": "5d62e1a3c1e8b8c3f429b78c230e07cce36e8bac5f3a5f0335659cf655df4363",
	"sourceURL": "https://addons.nvda-project.org/",
	"license": "unknown"
}