{
	"addonId": "KoruzBiz_MurText",
	"displayName": "Koruz.biz MurText",
	"URL": "https://github.com/koruzbiz/murtext/releases/download/1.9.2/KoruzBiz_MurText-1.9.2.nvda-addon",
	"description": "An NVDA plug-in for the MurText application, which transcribes audio/video files and WhatsApp voice messages in 100 languages.",
	"sha256": "c2282f81c351d5a8224ce644283636929d032f250270dc038ae299234bc64d24",
	"addonVersionName": "1.9.2",
	"addonVersionNumber": {
		"major": 1,
		"minor": 9,
		"patch": 2
	},
	"minNVDAVersion": {
		"major": 2022,
		"minor": 1,
		"patch": 0
	},
	"lastTestedVersion": {
		"major": 2025,
		"minor": 1,
		"patch": 0
	},
	"channel": "stable",
	"publisher": "Koruzbiz",
	"sourceURL": "https://github.com/koruzbiz/murtext/",
	"license": "GPL v2",
	"homepage": "https://MurText.org",
	"changelog": "Free and unlimited transcription! With a single shortcut, transcribe audio/video files and WhatsApp voice messages instantly. Use the same shortcut to quickly save other files from the WhatsApp desktop app.",
	"licenseURL": "https://www.gnu.org/licenses/gpl-2.0.html",
	"submissionTime": 1759215021000,
	"translations": [
		{
			"language": "de",
			"displayName": "Körüz.biz MurText",
			"description": "Ein NVDA-Plugin für die MurText-Anwendung, das Audio-/Videodateien und WhatsApp-Sprachnachrichten in 100 Sprachen transkribiert.",
			"changelog": "Kostenlose und unbegrenzte Transkription! Mit einer einzigen Tastenkombination transkribieren Sie sofort Audio-/Videodateien und WhatsApp-Sprachnachrichten. Verwenden Sie dieselbe Tastenkombination, um andere Dateien aus der WhatsApp-Desktop-App schnell zu speichern."
		},
		{
			"language": "fr",
			"displayName": "Körüz.biz MurText",
			"description": "Un plugin NVDA pour l'application MurText, qui transcrit des fichiers audio/vidéo et des messages vocaux WhatsApp dans 100 langues.",
			"changelog": "Transcription gratuite et illimitée ! Avec un seul raccourci, transcrivez instantanément des fichiers audio/vidéo et des messages vocaux WhatsApp. Utilisez le même raccourci pour enregistrer rapidement d'autres fichiers depuis l'application WhatsApp pour bureau."
		},
		{
			"language": "tr",
			"displayName": "Körüz.biz MurText",
			"description": "100 dilde ses/video dosyalarını ve WhatsApp sesli mesajlarını transkripsiyon yapan MurText uygulaması için NVDA eklentisi.",
			"changelog": "Ücretsiz ve sınırsız transkripsiyon! Tek bir kısayolla, ses/video dosyalarını ve WhatsApp sesli mesajlarını transkripsiyon yapın. Aynı kısayolla WhatsApp masaüstü uygulamasındaki diğer dosyalarınızı hızlı kaydedin."
		}
	]
}