{
	"addonId": "KoruzBiz_MurText",
	"displayName": "Koruz.biz MurText",
	"URL": "https://github.com/koruzbiz/murtext/releases/download/2.0.2/KoruzBiz_MurText-2.0.2.nvda-addon",
	"description": "An NVDA plug-in for the MurText application, which transcribes audio/video files and WhatsApp voice messages in 100 languages.",
	"sha256": "4299e736ee2b0f5f669f7a439957bb56db0da7998bc694e46d435ce44b8b0631",
	"addonVersionName": "2.0.2",
	"addonVersionNumber": {
		"major": 2,
		"minor": 0,
		"patch": 2
	},
	"minNVDAVersion": {
		"major": 2022,
		"minor": 1,
		"patch": 0
	},
	"lastTestedVersion": {
		"major": 2025,
		"minor": 3,
		"patch": 0
	},
	"channel": "stable",
	"publisher": "koruzbiz",
	"sourceURL": "https://github.com/koruzbiz/murtext/tree/2.0.2",
	"license": "GPL v2",
	"homepage": "https://MurText.org",
	"changelog": "Free and unlimited transcription! With a single shortcut, transcribe audio/video files and WhatsApp voice messages instantly. Use the same shortcut to quickly save other files from the WhatsApp desktop app.",
	"licenseURL": "https://www.gnu.org/licenses/gpl-2.0.html",
	"submissionTime": 1760093686000,
	"translations": [
		{
			"language": "ar",
			"displayName": "Körüz.biz MurText",
			"description": "إضافة NVDA لتطبيق MurText، تقوم بنسخ ملفات الصوت/الفيديو ورسائل الصوت في واتساب إلى نص بـ 100 لغة.",
			"changelog": "نسخ مجاني وغير محدود! باستخدام اختصار واحد، قم بنسخ ملفات الصوت/الفيديو ورسائل الصوت في واتساب على الفور. استخدم نفس الاختصار لحفظ الملفات الأخرى من تطبيق واتساب لسطح المكتب بسرعة."
		},
		{
			"language": "de",
			"displayName": "Körüz.biz MurText",
			"description": "Ein NVDA-Plugin für die MurText-Anwendung, das Audio-/Videodateien und WhatsApp-Sprachnachrichten in 100 Sprachen transkribiert.",
			"changelog": "Kostenlose und unbegrenzte Transkription! Mit einer einzigen Tastenkombination transkribieren Sie sofort Audio-/Videodateien und WhatsApp-Sprachnachrichten. Verwenden Sie dieselbe Tastenkombination, um andere Dateien aus der WhatsApp-Desktop-App schnell zu speichern."
		},
		{
			"language": "es",
			"displayName": "Körüz.biz MurText",
			"description": "Un complemento de NVDA para la aplicación MurText que transcribe archivos de audio/video y mensajes de voz de WhatsApp en 100 idiomas.",
			"changelog": "¡Transcripción gratuita e ilimitada! Con una sola tecla de acceso rápido, transcribe al instante archivos de audio/video y mensajes de voz de WhatsApp. Usa la misma tecla para guardar rápidamente otros archivos desde la aplicación de escritorio de WhatsApp."
		},
		{
			"language": "fr",
			"displayName": "Körüz.biz MurText",
			"description": "Un plugin NVDA pour l'application MurText, qui transcrit des fichiers audio/vidéo et des messages vocaux WhatsApp dans 100 langues.",
			"changelog": "Transcription gratuite et illimitée ! Avec un seul raccourci, transcrivez instantanément des fichiers audio/vidéo et des messages vocaux WhatsApp. Utilisez le même raccourci pour enregistrer rapidement d'autres fichiers depuis l'application WhatsApp pour bureau."
		},
		{
			"language": "hi",
			"displayName": "Koruz.biz MurText",
			"description": "MurText अनुप्रयोग के लिए एक NVDA प्लग-इन, जो 100 भाषाओं में ऑडियो/वीडियो फ़ाइलों और WhatsApp वॉइस संदेशों को ट्रांसक्राइब करता है।",
			"changelog": "मुफ़्त और असीमित ट्रांसक्रिप्शन! केवल एक शॉर्टकट से ऑडियो/वीडियो फ़ाइलों और WhatsApp वॉइस संदेशों को तुरंत ट्रांसक्राइब करें। उसी शॉर्टकट का उपयोग करके WhatsApp डेस्कटॉप ऐप से अन्य फ़ाइलें भी जल्दी सहेजें।"
		},
		{
			"language": "it",
			"displayName": "Körüz.biz MurText",
			"description": "Un plug-in NVDA per l'applicazione MurText che trascrive file audio/video e messaggi vocali WhatsApp in 100 lingue.",
			"changelog": "Trascrizione gratuita e illimitata! Con un solo tasto di scelta rapida, trascrivi istantaneamente file audio/video e messaggi vocali WhatsApp. Usa lo stesso tasto per salvare rapidamente altri file dall'app desktop di WhatsApp."
		},
		{
			"language": "ja",
			"displayName": "Körüz.biz MurText",
			"description": "MurTextアプリケーション用のNVDAプラグインで、音声/動画ファイルやWhatsAppの音声メッセージを100言語で文字起こしします。",
			"changelog": "無料かつ無制限の文字起こし！ショートカットキー1つで、音声/動画ファイルやWhatsAppの音声メッセージを即座に文字起こし。 同じキーでWhatsAppデスクトップアプリから他のファイルもすばやく保存できます。"
		},
		{
			"language": "pt",
			"displayName": "Körüz.biz MurText",
			"description": "Um plug-in NVDA para o aplicativo MurText que transcreve arquivos de áudio/vídeo e mensagens de voz do WhatsApp em 100 idiomas.",
			"changelog": "Transcrição gratuita e ilimitada! Com um único atalho, transcreva arquivos de áudio/vídeo e mensagens de voz do WhatsApp instantaneamente. Use o mesmo atalho para salvar rapidamente outros arquivos do aplicativo WhatsApp para desktop."
		},
		{
			"language": "ru",
			"displayName": "Körüz.biz MurText",
			"description": "Плагин NVDA для приложения MurText, который транскрибирует аудио/видео файлы и голосовые сообщения WhatsApp на 100 языках.",
			"changelog": "Бесплатная и неограниченная транскрипция! С помощью одной горячей клавиши мгновенно транскрибируйте аудио/видео файлы и голосовые сообщения WhatsApp. Используйте ту же клавишу, чтобы быстро сохранить другие файлы из настольного приложения WhatsApp."
		},
		{
			"language": "tr",
			"displayName": "Körüz.biz MurText",
			"description": "100 dilde ses/video dosyalarını ve WhatsApp sesli mesajlarını transkripsiyon yapan MurText uygulaması için NVDA eklentisi.",
			"changelog": "Ücretsiz ve sınırsız transkripsiyon! Tek bir kısayolla, ses/video dosyalarını ve WhatsApp sesli mesajlarını transkripsiyon yapın. Aynı kısayolla WhatsApp masaüstü uygulamasındaki diğer dosyalarınızı hızlı kaydedin."
		},
		{
			"language": "uk",
			"displayName": "Körüz.biz MurText",
			"description": "Додаток NVDA, який перетворює аудіо- та відеофайли на вашому комп’ютері, а також голосові повідомлення WhatsApp у текст понад 100 мовами.",
			"changelog": "Безкоштовна та необмежена транскрипція! Одним поєднанням клавіш миттєво транскрибуйте аудіо- й відеофайли та голосові повідомлення WhatsApp. Використовуйте ту саму комбінацію, щоб швидко зберігати інші файли з настільного додатка WhatsApp."
		},
		{
			"language": "zh",
			"displayName": "Koruz.biz MurText",
			"description": "MurText 应用程序的 NVDA 插件，可在 100 种语言中转录音频/视频文件和 WhatsApp 语音消息。",
			"changelog": "免费且无限制的转录！只需一个快捷键，即可立即转录音频/视频文件和 WhatsApp 语音消息。使用同一快捷键，还可以快速保存 WhatsApp 桌面应用中的其他文件。"
		}
	]
}