{
	"addonId": "KoruzBiz_MurText",
	"displayName": "Koruz.biz MurText",
	"URL": "https://github.com/koruzbiz/murtext/releases/download/2.1.1/KoruzBiz_MurText-2.1.1.nvda-addon",
	"description": "An NVDA add-on for the MurText application that converts audio/video files and WhatsApp voice messages into text in over 100 languages. Free and unlimited speech-to-text conversion! With a single shortcut, instantly convert audio/video files and WhatsApp voice messages into text. Use the same shortcut to quickly save other files from the WhatsApp desktop app.",
	"sha256": "f25f82c546cac4430135b806a556f2425fb4b510d7e3b52a25ab2621fadd272d",
	"addonVersionName": "2.1.1",
	"addonVersionNumber": {
		"major": 2,
		"minor": 1,
		"patch": 1
	},
	"minNVDAVersion": {
		"major": 2022,
		"minor": 1,
		"patch": 0
	},
	"lastTestedVersion": {
		"major": 2025,
		"minor": 3,
		"patch": 0
	},
	"channel": "stable",
	"publisher": "koruzbiz",
	"sourceURL": "https://github.com/koruzbiz/murtext",
	"license": "GPL v2",
	"homepage": "https://MurText.org",
	"changelog": "Added label recognition feature for WhatsApp Desktop. If you get the warning Could not click on the Copy menu, open NVDA Settings → Koruz.biz MurText category, and save the Copy label as it appears in your WhatsApp context menu.",
	"licenseURL": "https://www.gnu.org/licenses/gpl-2.0.html",
	"submissionTime": 1761009411000,
	"translations": [
		{
			"language": "ar",
			"displayName": "Körüz.biz MurText",
			"description": "إضافة NVDA لتطبيق MurText تقوم بتحويل ملفات الصوت والفيديو ورسائل WhatsApp الصوتية إلى نص بأكثر من 100 لغة. تحويل مجاني وغير محدود من الكلام إلى نص! من خلال اختصار واحد فقط، يمكنك تحويل ملفات الصوت والفيديو ورسائل WhatsApp الصوتية إلى نص على الفور. استخدم نفس الاختصار لحفظ الملفات الأخرى بسرعة من تطبيق WhatsApp لسطح المكتب.",
			"changelog": "تمت إضافة ميزة التعرف على التسميات لتطبيق WhatsApp Desktop. إذا تلقيت التحذير تعذر النقر على قائمة النسخ، افتح إعدادات NVDA → فئة Koruz.biz MurText واحفظ تسمية النسخ كما تظهر في قائمة السياق الخاصة بـ WhatsApp."
		},
		{
			"language": "de",
			"displayName": "Körüz.biz MurText",
			"description": "Ein NVDA-Add-on für die MurText-Anwendung, das Audio-/Videodateien und WhatsApp-Sprachnachrichten in über 100 Sprachen in Text umwandelt. Kostenlose und unbegrenzte Sprach-zu-Text-Umwandlung! Mit einer einzigen Tastenkombination können Sie Audio-/Videodateien und WhatsApp-Sprachnachrichten sofort in Text umwandeln. Verwenden Sie dieselbe Tastenkombination, um andere Dateien aus der WhatsApp-Desktop-App schnell zu speichern.",
			"changelog": "Funktion zur Etiketterkennung für WhatsApp Desktop hinzugefügt. Wenn Sie die Warnung 'Konnte nicht auf das Menü Kopieren klicken' erhalten, öffnen Sie NVDA-Einstellungen → Koruz.biz MurText-Kategorie und speichern Sie die Bezeichnung 'Kopieren', wie sie in Ihrem WhatsApp-Kontextmenü angezeigt wird."
		},
		{
			"language": "es",
			"displayName": "Körüz.biz MurText",
			"description": "Un complemento de NVDA para la aplicación MurText que convierte sus archivos de audio y video, así como los mensajes de voz de WhatsApp, en texto en más de 100 idiomas. ¡Conversión de voz a texto gratuita e ilimitada! Con un solo acceso directo, convierte al instante archivos de audio y video y mensajes de voz de WhatsApp en texto. Usa el mismo acceso directo para guardar rápidamente otros archivos desde la aplicación de escritorio de WhatsApp.",
			"changelog": "Se agregó la función de reconocimiento de etiquetas para WhatsApp Desktop. Si recibes la advertencia No se pudo hacer clic en el menú Copiar, abre Configuración de NVDA → categoría Koruz.biz MurText y guarda la etiqueta Copiar tal como aparece en tu menú contextual de WhatsApp."
		},
		{
			"language": "fr",
			"displayName": "Körüz.biz MurText",
			"description": "Une extension NVDA pour l’application MurText qui convertit les fichiers audio/vidéo et les messages vocaux WhatsApp en texte dans plus de 100 langues. Conversion vocale en texte gratuite et illimitée ! Avec un seul raccourci, convertissez instantanément des fichiers audio/vidéo et des messages vocaux WhatsApp en texte. Utilisez le même raccourci pour enregistrer rapidement d’autres fichiers depuis l’application de bureau WhatsApp.",
			"changelog": "Ajout de la fonction de reconnaissance des étiquettes pour WhatsApp Desktop. Si vous recevez l’avertissement Impossible de cliquer sur le menu Copier, ouvrez Paramètres NVDA → catégorie Koruz.biz MurText et enregistrez l’étiquette Copier telle qu’elle apparaît dans votre menu contextuel WhatsApp."
		},
		{
			"language": "hi",
			"displayName": "Koruz.biz MurText",
			"description": "MurText एप्लिकेशन के लिए एक NVDA ऐड-ऑन जो ऑडियो/वीडियो फाइलों और WhatsApp वॉयस संदेशों को 100 से अधिक भाषाओं में टेक्स्ट में परिवर्तित करता है। मुफ्त और असीमित स्पीच-टू-टेक्स्ट रूपांतरण! केवल एक शॉर्टकट के साथ, ऑडियो/वीडियो फाइलों और WhatsApp वॉयस संदेशों को तुरंत टेक्स्ट में बदलें। WhatsApp डेस्कटॉप ऐप से अन्य फाइलों को तेजी से सहेजने के लिए उसी शॉर्टकट का उपयोग करें।",
			"changelog": "WhatsApp Desktop के लिए लेबल पहचान सुविधा जोड़ी गई है। यदि आपको चेतावनी मिलती है कि कॉपी मेनू पर क्लिक नहीं किया जा सका, तो NVDA सेटिंग्स → Koruz.biz MurText श्रेणी खोलें और अपने WhatsApp संदर्भ मेनू में दिखाई देने वाले अनुसार कॉपी लेबल सहेजें।"
		},
		{
			"language": "it",
			"displayName": "Körüz.biz MurText",
			"description": "Un componente aggiuntivo NVDA per l'applicazione MurText che converte file audio/video e messaggi vocali WhatsApp in testo in oltre 100 lingue. Conversione vocale in testo gratuita e illimitata! Con una sola scorciatoia, converti immediatamente file audio/video e messaggi vocali WhatsApp in testo. Usa la stessa scorciatoia per salvare rapidamente altri file dall'app desktop di WhatsApp.",
			"changelog": "Aggiunta la funzione di riconoscimento delle etichette per WhatsApp Desktop. Se ricevi l’avviso Impossibile fare clic sul menu Copia, apri Impostazioni NVDA → categoria Koruz.biz MurText e salva l’etichetta Copia come appare nel menu contestuale di WhatsApp."
		},
		{
			"language": "ja",
			"displayName": "Körüz.biz MurText",
			"description": "MurText アプリ用の NVDA アドオンで、音声および動画ファイル、さらに WhatsApp 音声メッセージを100以上の言語でテキストに変換できます。無料で無制限の音声からテキストへの変換が可能です。単一のショートカットで音声/動画ファイルや WhatsApp 音声メッセージを瞬時にテキストに変換できます。同じショートカットを使って WhatsApp デスクトップアプリの他のファイルも素早く保存できます。",
			"changelog": "WhatsApp Desktop 用のラベル認識機能を追加しました。「コピー」メニューをクリックできませんという警告が出た場合は、NVDA 設定 → Koruz.biz MurText カテゴリを開き、WhatsApp のコンテキストメニューに表示される「コピー」ラベルを保存してください。"
		},
		{
			"language": "pt",
			"displayName": "Körüz.biz MurText",
			"description": "Um complemento NVDA para o aplicativo MurText que converte seus arquivos de áudio e vídeo, bem como mensagens de voz do WhatsApp, em texto em mais de 100 idiomas. Conversão de fala para texto gratuita e ilimitada! Com um único atalho, converta instantaneamente arquivos de áudio e vídeo e mensagens de voz do WhatsApp em texto. Use o mesmo atalho para salvar rapidamente outros arquivos do aplicativo WhatsApp para desktop.",
			"changelog": "Adicionado o recurso de reconhecimento de rótulos para o WhatsApp Desktop. Se você receber o aviso Não foi possível clicar no menu Copiar, abra Configurações do NVDA → categoria Koruz.biz MurText e salve o rótulo Copiar como aparece no menu de contexto do WhatsApp."
		},
		{
			"language": "ru",
			"displayName": "Körüz.biz MurText",
			"description": "Дополнение NVDA для приложения MurText, которое преобразует ваши аудио- и видеофайлы, а также голосовые сообщения WhatsApp в текст на более чем 100 языках. Бесплатное и неограниченное преобразование речи в текст! Одним сочетанием клавиш мгновенно преобразуйте аудио- и видеофайлы и голосовые сообщения WhatsApp в текст. Используйте то же сочетание клавиш, чтобы быстро сохранять другие файлы из настольного приложения WhatsApp.",
			"changelog": "Добавлена функция распознавания меток для WhatsApp Desktop. Если вы получаете предупреждение Не удалось нажать меню Копировать, откройте Настройки NVDA → категорию Koruz.biz MurText и сохраните метку Копировать так, как она отображается в контекстном меню WhatsApp."
		},
		{
			"language": "tr",
			"displayName": "Körüz.biz MurText",
			"description": "Ses/video dosyalarını ve WhatsApp sesli mesajlarını 100'den fazla dilde metne dönüştüren MurText uygulaması için NVDA eklentisi. Ücretsiz ve sınırsız konuşmadan metne dönüştürme! Tek bir kısayolla ses/video dosyalarını ve WhatsApp sesli mesajlarını anında metne dönüştürün. WhatsApp masaüstü uygulamasındaki diğer dosyaları hızla kaydetmek için aynı kısayolu kullanın.",
			"changelog": "WhatsApp Masaüstü için etiket tanıma özelliği eklendi. Kopyala menüsüne tıklanamadı uyarısını alırsanız, NVDA Ayarları → Koruz.biz MurText kategorisini açın ve Kopyala etiketini WhatsApp içerik menünüzde göründüğü şekilde kaydedin."
		},
		{
			"language": "uk",
			"displayName": "Körüz.biz MurText",
			"description": "Додаток NVDA для програми MurText, який перетворює аудіо/відео файли та голосові повідомлення WhatsApp у текст понад 100 мовами. Безкоштовне та необмежене перетворення мовлення в текст! За допомогою одного ярлика миттєво перетворюйте аудіо/відео файли та голосові повідомлення WhatsApp у текст. Використовуйте той самий ярлик, щоб швидко зберігати інші файли з настільного додатка WhatsApp.",
			"changelog": "Додано функцію розпізнавання міток для WhatsApp Desktop. Якщо ви отримуєте попередження Не вдалося натиснути меню Копіювати, відкрийте Налаштування NVDA → категорію Koruz.biz MurText і збережіть мітку Копіювати так, як вона відображається у контекстному меню WhatsApp."
		},
		{
			"language": "zh",
			"displayName": "Koruz.biz MurText",
			"description": "适用于 MurText 应用的 NVDA 插件，可将音频/视频文件和 WhatsApp 语音消息转换为超过100种语言的文本。免费且无限制的语音转文本！通过一个快捷键即可即时将音频/视频文件和 WhatsApp 语音消息转换为文本。使用相同快捷键快速保存 WhatsApp 桌面应用中的其他文件。",
			"changelog": "为 WhatsApp Desktop 添加了标签识别功能。如果出现“无法点击复制菜单”警告，请打开 NVDA 设置 → Koruz.biz MurText 类别，并按 WhatsApp 上的显示保存复制标签。"
		}
	]
}