{
	"addonId": "customNotifications",
	"displayName": "Custom Notifications",
	"URL": "https://github.com/nvdaes/customNotifications/releases/download/13.1.0/customNotifications-13.1.0.nvda-addon",
	"description": "Choose how NVDA should read toast notifications.\nYou can read just the application which sent a toast, and choose if notifications are spoken, displayed in braille or both.\nThis may  improve your experience with toast notifications and help you to keep your privacy.",
	"sha256": "22597d029647189cc938883d0d10b90b0c89c433bd059483279b9ff9925dffbf",
	"addonVersionName": "13.1.0",
	"addonVersionNumber": {
		"major": 13,
		"minor": 1,
		"patch": 0
	},
	"minNVDAVersion": {
		"major": 2026,
		"minor": 1,
		"patch": 0
	},
	"lastTestedVersion": {
		"major": 2026,
		"minor": 1,
		"patch": 0
	},
	"channel": "beta",
	"publisher": "nvdaes",
	"sourceURL": "https://github.com/nvdaes/customNotifications/releases/tag/13.1.0",
	"license": "GPL v2",
	"homepage": "https://github.com/nvdaes/customNotifications",
	"changelog": "* Compatible with NVDA 2026.1.",
	"licenseURL": "https://www.gnu.org/licenses/gpl-2.0.html",
	"submissionTime": 1771163891000,
	"translations": [
		{
			"language": "de",
			"displayName": "Benutzerdefinierte Benachrichtigungen",
			"description": "Wählen Sie aus, wie NVDA die Toast-Benachrichtigungen anzeigen soll.\nSie können nur die Anwendung hören, die eine Toast-Benachrichtigung gesendet hat und wählen Sie aus, ob die Benachrichtigungen über die Sprachausgabe oder auf der Braillezeile ausgegeben oder beides angezeigt werden soll.\nDies kann die Erfahrung mit Toast-Benachrichtigungen verbessern und helfen, die Privatsphäre zu wahren.",
			"changelog": "* Compatible with NVDA 2026.1."
		},
		{
			"language": "es",
			"displayName": "Notificaciones personalizadas",
			"description": "Elige cómo debería leer NVDA las notificaciones emergentes.\nPuedes simplemente leer la aplicación que envió la notificación, y elegir si las notificaciones se verbalizan, se muestran en braille o ambas.\nEsto puede mejorar tu experiencia con las notificaciones emergentes y ayudar a preservar tu privacidad.",
			"changelog": "* Compatible with NVDA 2026.1."
		},
		{
			"language": "fi",
			"displayName": "Mukautetut ilmoitukset",
			"description": "Valitse, miten NVDA lukee ilmoitusruudut.\nVoit valita pelkän ilmoituksen lähettäneen sovelluksen lukemisen ja puhutaanko ilmoitukset, näytetäänkö ne pistenäytöllä vai sekä että.\nTämä voi parantaa kokemustasi ilmoitusruuduista ja auttaa säilyttämään yksityisyytesi.",
			"changelog": "* Compatible with NVDA 2026.1."
		},
		{
			"language": "fr",
			"displayName": "Notifications personnalisées",
			"description": "Choisissez comment NVDA doit lire les notifications toast.\\n\nVous pouvez lire uniquement l'application qui a envoyé un toast et choisir si les notifications sont vocales, affichées en braille ou les deux.\\n\nCela peut améliorer votre expérience avec les notifications toast et vous aider à préserver votre confidentialité.",
			"changelog": "* Compatible with NVDA 2026.1."
		},
		{
			"language": "pt_BR",
			"displayName": "Notificações personalizadas",
			"description": "Escolha como o NVDA deve ler as notificações de brinde.\nVocê pode ler apenas o aplicativo que enviou um brinde escolher se as notificações serão faladas, exibidas em braile ou ambas.\nIsso pode melhorar sua experiência com as notificações de brinde ajudá-lo a manter sua privacidade.",
			"changelog": "* Compatible with NVDA 2026.1."
		},
		{
			"language": "pt_PT",
			"displayName": "Notificações personalizadas",
			"description": "Escolha como o NVDA deve ler as notificações de brinde.\nPode ler apenas a aplicação que enviou um brinde e escolher se as notificações são faladas, apresentadas em braille ou ambas.\nIsto pode melhorar a sua experiência com as notificações de toast e ajudá-lo a manter a sua privacidade.",
			"changelog": "* Compatible with NVDA 2026.1."
		},
		{
			"language": "ru",
			"displayName": "Персонализированные уведомления",
			"description": "Это дополнение позволяет выберать, как NVDA должен выводить всплывающие уведомления.\nВы можете настроить NVDA для чтения только имени приложения, из которого пришло уведомление, а также выбрать, будут ли уведомления озвучены, показаны шрифтом Брайля или и то, и другое.\nЭто может улучшить ваш опыт работы с уведомлениями и помочь вам сохранить конфиденциальность.",
			"changelog": "* Compatible with NVDA 2026.1."
		},
		{
			"language": "tr",
			"displayName": "Bildirimleri Özelleştir",
			"description": "NVDA'nın bildirimleri nasıl okuması gerektiğini seçin.\nYalnızca bir tost gönderen uygulamayı okuyabilir ve bildirimlerin konuşulup, Braille ile gösterilmesini veya her ikisini de seçebilirsiniz.\nBu, tost bildirimleriyle deneyiminizi geliştirebilir ve gizliliğinizi korumanıza yardımcı olabilir.",
			"changelog": "* Compatible with NVDA 2026.1."
		},
		{
			"language": "uk",
			"displayName": "Персоналізовані сповіщення",
			"description": "Виберіть, як NVDA має читати сповіщення.\nВи можете налаштувати NVDDA на читання лише назви програми, від якої надійшло сповіщення, а також вибрати, чи будуть сповіщення озвучені, показані шрифтом Брайля або і те, і інше.\nЦе може покращити ваш досвід роботи зі сповіщеннями й допоможе вам зберегти конфіденційність.",
			"changelog": "* Compatible with NVDA 2026.1."
		},
		{
			"language": "zh_CN",
			"displayName": "自定义通知",
			"description": "该插件用于自定义toast通知.\n您可以选择阅读整个通知或仅阅读发送通知的应用程序，还可以配置单独使用语音或盲文，抑或同时用两者来呈现通知。\n它可能会改善您的toast通知体验，并帮助您保护隐私。",
			"changelog": "* Compatible with NVDA 2026.1."
		}
	]
}