{"addonId": "AIContentDescriber", "displayName": "Descripteur de contenu IA", "URL": "https://github.com/cartertemm/AI-content-describer/releases/download/v2024.05.22/AIContentDescriber-2024.05.22.nvda-addon", "description": "Ce module complémentaire permet de décrire l'objet focal, l'objet navigateur ou l'écran à l'aide de modèles de langage d'IA populaires capables de vision, comme Claude, Gemini ou GPT4.\nIl permet également de comprendre où se situe un visage dans le cadre d'une caméra connectée.\nBien que les descriptions de contenu soient assez détaillées, elles peuvent ne pas toujours être tout à fait exactes ou refléter des informations réelles.\nPour commencer avec GPT, rendez-vous sur https://platform.openai.com/account/api-keys et créez un compte, puis créez une clé pour interagir avec l'API. Consultez la documentation du module complémentaire pour plus d’informations à ce sujet.\nEnsuite, choisissez la catégorie « Descripteur de contenu AI » dans la boîte de dialogue des paramètres de NVDA -> gérer les modèles et entrez votre clé API.\nAppuyez sur NVDA+shift+i pour faire apparaître un menu vous demandant comment vous souhaitez décrire en fonction de la position actuelle, ou NVDA+shift+u pour décrire l'objet navigateur, ou NVDA+shift+y pour une image qui a été copiée dans le presse-papiers comme dans l'explorateur Windows. D'autres raccourcis sont personnalisables à partir de la boîte de dialogue des gestes de saisie.", "sha256": "c6fa79fb1376659997258569941d34253f14ac9b148b8e2562847c9153a96fc9", "addonVersionName": "2024.05.22", "addonVersionNumber": {"major": 2024, "minor": 5, "patch": 22}, "minNVDAVersion": {"major": 2023, "minor": 1, "patch": 0}, "lastTestedVersion": {"major": 2024, "minor": 1, "patch": 0}, "channel": "stable", "publisher": "Carter Temm and contributors", "sourceURL": "https://github.com/cartertemm/AI-content-describer/", "license": "GPL v2", "licenseURL": "https://www.gnu.org/licenses/gpl-2.0.html", "reviewUrl": "https://github.com/nvaccess/addon-datastore/discussions/2048"}