{
  "addonId": "TimerForNVDA",
  "displayName": "Simple Timer and stopwatch for NVDA",
  "URL": "https://github.com/marlon-sousa/TimerForNVDA/releases/download/1.6.5/TimerForNVDA-1.6.5.nvda-addon",
  "description": "This addon brings a fast, functional ande simple implementation of timer and stopwatch to be used with NVDA.\nStart a timer or stopwatch, using the time unit and reporting modes you need.\nChoose between speech, sound or no reporters.\nMonitor progress through reporters, settings dialog or anywhere using NVDA commands.\nControl timer and stopwatch from anywhere using NVDA commands.",
  "sha256": "cada8eea370108ff7b1f2be1603ace3e1ccb59837094dbd546fac8ed40df1530",
  "addonVersionName": "1.6.5",
  "addonVersionNumber": {
    "major": 1,
    "minor": 6,
    "patch": 5
  },
  "minNVDAVersion": {
    "major": 2022,
    "minor": 1,
    "patch": 0
  },
  "lastTestedVersion": {
    "major": 2024,
    "minor": 1,
    "patch": 0
  },
  "channel": "stable",
  "publisher": "Marlon Sousa",
  "sourceURL": "https://github.com/marlon-sousa/TimerForNVDA",
  "license": "Mit License",
  "homepage": "https://github.com/marlon-sousa/TimerForNVDA",
  "licenseURL": "https://github.com/marlon-sousa/TimerForNVDA/blob/main/LICENSE",
  "translations": [
    {
      "language": "es",
      "displayName": "Temporizador y cronómetro simples para NVDA ",
      "description": "Este complemento trae una implementación simple, funcional y rápida del temporizador y del cronómetro para NVDA\nInicia un temporizador o cronómetro utilizando la unidad de tiempo y el modo de indicación que necesitas.\nElija entre la indicación por sonido, voz o ninguno.\nMonitorea el progreso a través de indicaciones, a través del diálogo de configuración o en cualquier lugar utilizando  las órdenes de NVDA.\nControla el temporizador o cronómetro desde cualquier lugar, utilizando las órdenes de NVDA."
    },
    {
      "language": "fr",
      "displayName": "Minuterie et chronomètre simples pour NVDA",
      "description": "Cette extension apporte une implémentation rapide, fonctionnelle et simple d'une minuterie et d'un chronomètre à utiliser avec NVDA.\nDémarrer une minuterie ou un chronomètre, en utilisant une unité de temps et les modes d'indications dont vous avez besoin.\nChoisisser l'indication entre parole, son ou aucun.\nSurveiller le progrès via des indications, via le dialogue de paramètres ou n'importe où à l'aide de commandes NVDA.\nContrôler la minuterie et le chronomètre de n'importe où avec des commandes NVDA."
    },
    {
      "language": "hr",
      "displayName": "Jednostavan brojač i štoperica za NVDA",
      "description": "Ovaj dodatak donosi brzu, funkcionalnu i jednostavnu implementaciju brojača i štoperice za korištenje s NVDA.\nPokrenite brojač ili štopericu, koristeći vremensku jedinicu i načine izvješćivanja koji su vam potrebni.\nOdaberite između govora, zvuka ili bez najave.\nPratite napredak kroz najave, dijalog postavki ili bilo gdje pomoću NVDA naredbi.\nKontrolirajte brojač i štopericu s bilo kojeg mjesta pomoću NVDA naredbi."
    },
    {
      "language": "pt_BR",
      "displayName": "Timer e cronômetro simples para NVDA",
      "description": "Este complemento trás uma implementação simples, funcional e rápida de timer e cronômetro para NVDA\nInicie um timer ou cronômetro, usando a unidade de tempo e o modo de relatórios que você precisar.\nEscolha entre relatórios de som, fala ou nenhum\nMonitore progresso usando relatórios ou sob demanda, usando comandos do NVDA.\nControle timer ou cronômetro de qualquer lugar, usando comandos do NVDA."
    },
    {
      "language": "pt_PT",
      "displayName": "Temporizador e cronómetro simples para o NVDA",
      "description": "Este extra trás uma implementação simples, funcional e rápida de temporizador e cronómetro para o NVDA\nInicie um temporizador ou cronómetro, usando a unidade de tempo e o modo de relatórios que precisar.\nEscolha entre relatórios de som, voz ou nenhum\nMonitore o progresso usando relatórios ou sob demanda, servindo-se de comandos do NVDA.\nControle o temporizador ou o cronómetro de qualquer lugar, utilizando apenas os comandos do NVDA."
    },
    {
      "language": "ru",
      "displayName": "Простой таймер и секундомер для NVDA",
      "description": "Это дополнение предлагает быструю, функциональную и простую реализацию таймера и секундомера для использования с NVDA.\nЗапустите таймер или секундомер, используя нужные вам единицы времени и режимы объявления.\nВыберите между функциями: речь, звук или ничего.\nОтслеживайте ход с помощью обозревателей, диалога настроек или где-либо еще с помощью команд NVDA.\nУправляйте таймером и секундомером в любом месте с помощью команд NVDA."
    },
    {
      "language": "tr",
      "displayName": "NVDA için Basit Zamanlayıcı ve kronometre",
      "description": "Bu eklenti, NVDA ile kullanılacak zamanlayıcı ve kronometrenin hızlı, işlevsel ve basit bir uygulamasını getiriyor.\nİhtiyacınız olan zaman birimini ve raporlama modlarını kullanarak bir zamanlayıcı veya kronometre başlatın.\nKonuşma, ses veya hiçbiri arasında seçim yapın.\nNVDA komutlarını kullanarak sesler, ayarlar iletişim kutusu veya herhangi bir yerde ilerlemeyi izleyin.\nNVDA komutlarını kullanarak zamanlayıcıyı ve kronometreyi her yerden kontrol edin."
    },
    {
      "language": "uk",
      "displayName": "Простий таймер і секундомір для NVDA",
      "description": "Цей додаток пропонує швидку, функціональну та просту реалізацію таймера та секундоміра для використання з NVDA.\nЗапустіть таймер або секундомір, використовуючи потрібні вам одиниці часу та режими оголошення.\nВиберіть між функціями: мовлення, звук або нічого.\nВідстежуйте перебіг за допомогою оголошень, діалогу налаштувань або будь-де за допомогою команд NVDA.\nКеруйте таймером і секундоміром будь-де за допомогою команд NVDA."
    }
  ],
  "reviewUrl": "https://github.com/nvaccess/addon-datastore/discussions/2216"
}
