{
	"addonId": "resourceMonitor",
	"displayName": "Resource Monitor",
	"URL": "https://github.com/josephsl/resourceMonitor/releases/download/23.02/resourceMonitor-23.02.1.nvda-addon",
	"description": "A handy resource monitor to report CPU load, memory usage, battery, disk usage status and more.",
	"sha256": "3bc3557324f8a1841ed140da683f3c178b35b11c73bffc035f28279e8e5f906d",
	"homepage": "https://addons.nvda-project.org/",
	"addonVersionName": "23.02.1",
	"addonVersionNumber": {
		"major": 23,
		"minor": 2,
		"patch": 1
	},
	"minNVDAVersion": {
		"major": 2022,
		"minor": 4,
		"patch": 0
	},
	"lastTestedVersion": {
		"major": 2023,
		"minor": 1,
		"patch": 0
	},
	"channel": "stable",
	"publisher": "josephsl",
	"sourceURL": "https://github.com/josephsl/resourcemonitor",
	"license": "GPL v2",
	"licenseURL": "https://www.gnu.org/licenses/gpl-2.0.html",
	"translations": [
		{
			"language": "an",
			"displayName": "Monitor de recursos",
			"description": "Un monitor de recursos a man ta informar d'a carga d'a CPU, de l'uso de memoria, d'a batería, d'o estau d'uso d'o disco y de muito mas."
		},
		{
			"language": "ar",
			"displayName": "وصف لمكونات الجهاز المادية ونظام التشغيل",
			"description": "تعمل هذه الإضافة على الإعلان عن متوسط تحميل المعالج, والذاكرة المستخدمة, كما تعلن عن حالة البطارية ومساحة الأقراص الصلبة والمتحركة والمزيد."
		},
		{
			"language": "bg",
			"displayName": "Наблюдение на ресурсите",
			"description": "Удобно средство за наблюдение на системните ресурси, за докладване на натоварването на централния процесор, използваната памет, състоянието на батерията, използването на диска и други."
		},
		{
			"language": "ca",
			"displayName": "Suport remot",
			"description": "Permet el control i accés remot a un altre equip."
		},
		{
			"language": "cs",
			"displayName": "Remote Support",
			"description": "Allows remote control of and remote access to another machine."
		},
		{
			"language": "da",
			"displayName": "Ressourcemonitor",
			"description": "En smart lille ressourcemonitor, som fortææler status for processorbelastning, hukommelsesforbrug, batteri, diskforbrug m.m."
		},
		{
			"language": "de",
			"displayName": "Ressourcen-Monitor",
			"description": "Ein praktischer Ressourcen-Monitor zur Anzeige von CPU-Auslastung, Arbeitsspeicher, Akkustatus, Speicherplatz auf Laufwerken und mehr."
		},
		{
			"language": "de_CH",
			"displayName": "Ressourcen-Monitor",
			"description": "Ein praktischer Ressourcen-Monitor zur Anzeige von CPU-Auslastung, Arbeitsspeicher, Akkustatus, Speicherplatz auf Laufwerken und mehr."
		},
		{
			"language": "el",
			"displayName": "Dropbox",
			"description": "Αναφορά κατάστασης Dropbox ή άνοιγμα μενού συντομεύσεων του Dropbox στη περιοχή εργασιών.\nΣυντόμευση: NVDA+Alt+D"
		},
		{
			"language": "en",
			"displayName": "NVDA recorder",
			"description": "Record in a text document all the speechs of NVDA, except in SayAll, and shows it in a dialog. Turn on/off with Alt+NumPad Plus."
		},
		{
			"language": "es",
			"displayName": "Resource Monitor",
			"description": "Un monitor de recursos a mano para informar de la carga de la CPU, del uso de memoria, de la batería, del estado de uso del disco y de mucho más."
		},
		{
			"language": "es_CO",
			"displayName": "Resource Monitor",
			"description": "Un monitor de recursos a mano para informar de la carga de la CPU, del uso de memoria, de la batería, del estado de uso del disco y de mucho más."
		},
		{
			"language": "fa",
			"displayName": "دیده‌بانِ منابع",
			"description": "یک دیده‌بانِ منابعِ دمِ دستی برای اعلامِ بارِ سیپی‌یو، میزانِ استفاده‌ی حافظه، باتری، وضعیتِ استفاده از دیسک و بیشتر."
		},
		{
			"language": "fi",
			"displayName": "Resurssienvalvonta",
			"description": "Monipuolinen resurssienvalvontalisäosa suorittimen kuormituksen, muistin-, akun- ja levynkäytön tilan sekä monien muiden tietojen lukemiseen."
		},
		{
			"language": "fr",
			"displayName": "Resource Monitor",
			"description": "Un superviseur de resources clés en mains pour rapporter la charge moyenne du processeur, l'utilisation de la mémoire, l'état d'utilisation des disques et de la batterie ainsi que d'autres informations."
		},
		{
			"language": "gl",
			"displayName": "Resource Monitor",
			"description": "Un monitor de recursos á man para informar da carga da CPU, utilización da memoria, do estado da batería e da utilización do disco."
		},
		{
			"language": "he",
			"displayName": "Resource Monitor",
			"description": "מציג דוח משאבים נגיש המפרט את רמת השימוש בזכרון, במעבד ובסוללה וכן מידע אודות שטח האיחסון בכונני הדיסקים."
		},
		{
			"language": "hi",
			"displayName": "सप्ताह का दिन",
			"description": "इस ऐड-ऑन की मदद से, आप एक चुनी हुई तारीख के अनुरूप सप्ताह का दिन पा सकेंगे."
		},
		{
			"language": "hr",
			"displayName": "Prati stanje resursa",
			"description": "Praktično praćenje stanja resursa za izvještavanje o opterećenju procesora, uporabi memorije, baterije, stanju uporabe diska i više."
		},
		{
			"language": "hu",
			"displayName": "Erőforrás-kilistázó",
			"description": "Egy kéznél levő erőforrás kilistázó amely meghatározza a processzor terheltségét, a használt memória és háttértár mértékét, az akkumulátor állapotát, a merevlemezek státuszát, és még jó néhány fontos számítógép jellemzőt."
		},
		{
			"language": "it",
			"displayName": "Resource Monitor",
			"description": "Un'utile analizzatore di risorse per segnalare il carico della CPU, l'utilizzo della memoria, lo stato della batteria,  la quantità di spazio utilizzato sul disco ed altro."
		},
		{
			"language": "ja",
			"displayName": "Resource Monitor",
			"description": "リソースモニターはCPU負荷、メモリ使用量、バッテリーの状態、ディスク使用量を通知します。"
		},
		{
			"language": "ka",
			"displayName": "Input lock",
			"description": " ამ დამატების საშუალებით, შეგიძლიათ დაბლოკოთ და განბლოკოთ თქვენი შეყვანის მოწყობილობები ერთი ჟესტითა თუ კლავიშთა კომბინაციით.\nამ ჟესტის შეცვლა შესაძლებელია შეყვანის ჟესტების დიალოგურ ფანჯარაში.."
		},
		{
			"language": "kn",
			"displayName": "ಗೋಲ್ಡ್ ವೇವ್",
			"description": "An add-on for enhancing access and usage of the GoldWave audio editor."
		},
		{
			"language": "ko",
			"displayName": "리소스 모니터",
			"description": "프로세서, 디스크, 메모리 사용률 및 베터리 상태를 알려줍니다."
		},
		{
			"language": "lt",
			"displayName": "Report Symbols",
			"description": "Leidžia išklausyti parašytus simbolius (ne raidinius ir ne skaitinius arba tuščius rašmenis), net jeigu ir išjungtas įvedamų simbolių tarimas."
		},
		{
			"language": "ne",
			"displayName": "श्रोत अनुगामी",
			"description": "CPU भार, भण्डारको प्रयोग, ब्याट्री र ढुकुटीको अवस्था बताउने छरितो श्रोत अनुगामी ।"
		},
		{
			"language": "nl",
			"displayName": "Resource Monitor",
			"description": "Een handig overzicht van CPU load, geheugengebruik, status van de batterij, schijfgebruik en meer."
		},
		{
			"language": "pl",
			"displayName": "Monitor zasobów",
			"description": "Podręczny monitor zasobów zgłaszający obciążenie CPU, użycie pamięci, baterię, status użycia dysku i więcej."
		},
		{
			"language": "pt",
			"displayName": "Agenda acessível",
			"description": "Permite o acesso a uma agenda acessível"
		},
		{
			"language": "pt_BR",
			"displayName": "Monitor de Recursos",
			"description": "Um monitor prático de recursos que anuncia carga da CPU, uso de memória, status de bateria, uso de disco e outros."
		},
		{
			"language": "pt_PT",
			"displayName": "Monitor de recursos",
			"description": "Um monitor de recursos acessível para indicar a carga do CPU, o uso de memória, a bateria, o estado de uso do disco e muito mais."
		},
		{
			"language": "ro",
			"displayName": "Resource Monitor",
			"description": "Un monitor de resurse folositor pentru raportarea încărcării CPU, ratei de folosire a memoriei, baterie, stare folosire disk și altele."
		},
		{
			"language": "ru",
			"displayName": "Resource Monitor",
			"description": "Удобный монитор ресурсов сообщающий о загрузке процессора, использовании памяти, состоянии заряда батареи, использовании диска и многого другого."
		},
		{
			"language": "sk",
			"displayName": "Monitor prostriedkov",
			"description": "Jednoduchý doplnok na zistenie vyťaženia procesora, využitej ram pamäte, stavu napájania, miesta na pripojených diskoch a podobne."
		},
		{
			"language": "sl",
			"displayName": "Nadzornik Virov",
			"description": "Priročni nadzornik virov poroča o obremenitvi CPE, izrabi pomnilnika, diska, o stanju porabe akumulatorja in več."
		},
		{
			"language": "sr",
			"displayName": "Resource Monitor",
			"description": "dobar monitor resursa koji prijavljuje bateriju , ram memoriju , iskorišćenost memorije na hard disku i još mnogo toga "
		},
		{
			"language": "sv",
			"displayName": "BluetoothAudio",
			"description": "Bluetooth Audio är ett tillägg till NVDA som  förbättrar ljudkvalitén när man använder bluetoothhörlurar eller bluetoothhögtalare."
		},
		{
			"language": "ta",
			"displayName": "வள கவனிப்பு",
			"description": "மையச் செயலக சுமை, நினைவக, மின்கல மற்றும் வட்டின் பயன்பாடு ஆகியவைகளை அறிவிக்கும் கையடக்க வள கவனிப்பு."
		},
		{
			"language": "tr",
			"displayName": "Kaynak İzleme",
			"description": "CPU yükü, hafıza kullanımı, pil ve disk kullanım durumunu takip etmek ve daha fazlası için pratik bir araç."
		},
		{
			"language": "uk",
			"displayName": "Монітор ресурсів",
			"description": "Зручний монітор ресурсів повідомляє про завантаженість процесора, використання оперативної пам'яті, статус акумулятора і дискового простору, та іншу інформацію."
		},
		{
			"language": "vi",
			"displayName": "Theo Dõi Tài Nguyên",
			"description": "Add-on này dùng để thông báo tình trạng sử dụng các thiết bị của máy, bao gồm: CPU, RAM, ổ đĩa và pin."
		},
		{
			"language": "zh_CN",
			"displayName": "资源监控器",
			"description": "一个易于使用的资源监控器，可以读出 CPU 负载、内存使用、电池和磁盘使用情况等等。"
		},
		{
			"language": "zh_TW",
			"displayName": "Resource Monitor",
			"description": "此資源監控元件能讀出 CPU 負載，記憶體、電池、磁碟使用情形。"
		}
	]
}