{
	"addonId": "Weather_Plus",
	"displayName": "Weather_Plus",
	"URL": "https://www.nvda.it/files/plugin/weather_plus9.7.nvda-addon",
	"description": "['Adds local temperature and forecast 24 hours and prediction up to 2 days.\\n', 'NVDA+w for the current bulletin.\\n', 'NVDA+shift+w for the prediction in the current 24 hours and prediction up to 2 days.\\n', 'NVDA+shift+w, pressed twice provides the hourlyforecast of the weather conditions.\\n', 'NVDA+shift+control+w for quickly enter a temporary city.\\n', 'NVDA + shift + control + alt + w for open the Weather Plus settings.\\n', 'NVDA+alt+w announces the date of the last update of the weather report.\\n', 'Shift+control+w alternates between Fahrenheit, Celsius and Kelvin.\\n', 'For other instructions, you can also press Add-on Help button in Add-ons manager.']",
	"sha256": "e56e539428b07f265a87932ca9ca4e3396b1637c0207b66ad28f51a37ba591a4",
	"addonVersionName": "9.7",
	"addonVersionNumber": {
		"major": 9,
		"minor": 7,
		"patch": 0
	},
	"minNVDAVersion": {
		"major": 0,
		"minor": 0,
		"patch": 0
	},
	"lastTestedVersion": {
		"major": 2024,
		"minor": 3,
		"patch": 0
	},
	"channel": "stable",
	"publisher": "Adriano Barbieri",
	"sourceURL": "https://www.nvda.it/files/plugin/weather_plus9.7.nvda-addon",
	"license": "GPL v2",
	"homepage": "https://www.nvda.it/weather-plus/",
	"licenseURL": "https://www.gnu.org/licenses/gpl-2.0.html",
	"translations": [
		{
			"language": "ar",
			"displayName": "Weather_Plus",
			"description": "يُضيفُ درجة الحرارة المحلية وتوقُّعات الطقس لأربع وعشرين ساعة، إضافةً لتوقُّعات الطقس ليويمن قادمين.\n\nNVDA+w لمعرفة النشرة الجوية  الحالية.\nNVDA+shift+w للحصول على توقُّعات الطقس للأربع وعشرين ساعة وتوقُّعات الطقس ليومين قادمين.\nNVDA+shift+w, الضغط عليه مرتين يوفّر توقُّعات أحوال الطقس لكلّ ساعة.\nNVDA+shift+control+w لضبط مدينة مؤقتة.\nNVDA + shift + control + alt + w لفتح أعدادات إدارة المدن.\nNVDA+alt+w للإعلان عن آخر تحديث للنشرة الجوية.\nShift+control+w للتبديل بين وحدة القياس .\nللحصول على تعليمات أخرى ، يمكنك أيضا الضغط على زر المساعدة للإضافة في مدير الإضافات."
		},
		{
			"language": "cs",
			"displayName": "Weather_Plus",
			"description": "Přidá místní teplotu a předpověď na 24 hodin a předpověď až na 2 dni. \n\nNVDA+w Ohlasi aktualni zpravu o počasí.\nNVDA+shift+w předpověď na aktuálních 24 hodin až na 2 dny. \\ n\nNVDA+shift+w, dvojité stisknutí poskytuje hodinovou předpověď povětrnostních podmínek. \\ n\nNVDA+shift+control+w pro rychle zadani docasneho mesta.\nNVDA+shift+control+alt+w Otevře dialog s nastavením doplňku počasí+.\nNVDA+alt+w ohlasi datum posledni aktualizace soucasne zpravy o pocasi.\nShift+control+w prepne mezi stupni Fahrenheit, Celsia a Kelvin.\nPro další informace otevřete nápovědu ve správci doplňku."
		},
		{
			"language": "da",
			"displayName": "Weather_Plus",
			"description": "Tilføjer lokal temperatur og prognose for 24 timer og vejrudsigt op til 2 dage.\nNVDA+w for den aktuelle melding.\nNVDA + shift + w for forudsigelse i det aktuelle 24 timer og forudsigelse op til 2 dage.\nNVDA + shift + w, der trykkes to gange, giver vejrudsigten pr. time.\nNVDA+shift+control+w for hurtigt at indtaste en midlertidig by.\nNVDA + shift + control + alt + w for at åbne indstillingerne i Vejret Plus.\nNVDA+alt+w Anoncerer datoen for den sidste opdatering af vejrudsigten.\nShift+control+w skifter imellem Fahrenheit, Celsius og Kelvin.\nDu kan også finde yderligere instruktioner ved at trykke knappen Hjælp til tilføjelsesprogram i værktøjet Administrér tilføjelsesprogrammer."
		},
		{
			"language": "de",
			"displayName": "Weather_Plus",
			"description": "Fügt lokale Temperatur und Vorhersage für 24 Stunden sowie die Vorhersage bis zu 2 Tagen hinzu.\nNVDA+W zeigt die aktuellen Wetterbedingungen an.\nNVDA+Umschalt+w für die Vorhersage für die aktuellen 24 Stunden und die Vorhersage bis zu 2 Tagen.\nNVDA+Umschalt+w, zweimal gedrückt, liefert die stündliche Vorhersage der Wetterbedingungen.\nNVDA+Umschalt+Strg+W legt eine temporäre Stadt fest.\nNVDA+Umschalt+Strg+Alt+W öffnet das Einstellungsfenster für weather Plus.\nNVDA+Alt+W zeigt das Datum der Aktualisierung des letzten Wetterberichts an.\nStrg+Umschalt+W schalttet temporär zwischen den Temperaturskalen Celsius, Fahrenheit und Kelvin um.\nFür weitere Anweisungen können Sie auch die Schaltfläche \"Hilfe\" im Menü \"Erweiterung verwalten\" klicken."
		},
		{
			"language": "en",
			"displayName": "Weather_Plus",
			"description": "Adds local temperature and forecast 24 hours and prediction up to 2 days.\nNVDA+w for the current bulletin.\nNVDA+shift+w for the prediction in the current 24 hours and prediction up to 2 days.\nNVDA+shift+w, pressed twice provides the hourlyforecast of the weather conditions.\nNVDA+shift+control+w for quickly enter a temporary city.\nNVDA + shift + control + alt + w for open the Weather Plus settings.\nNVDA+alt+w announces the date of the last update of the weather report.\nShift+control+w alternates between Fahrenheit, Celsius and Kelvin.\nFor other instructions, you can also press Add-on Help button in Add-ons manager."
		},
		{
			"language": "es",
			"displayName": "Weather_Plus",
			"description": "Añade la temperatura local y el pronóstico durante 24 horas y la predicción hasta 2 días.\nNVDA+w para el boletín actual.\nNVDA+shift+w para la predicción durante 24 horas y la predicción hasta 2 días.\nNVDA+shift+w, pulsado dos veces proporciona el pronóstico horario de las condiciones del tiempo.\nNVDA+shift+control+w para ingresar rápidamente una ciudad temporal.\nNVDA+shift+control+alt+w para abrir el cuadro de diálogo Configuración de Weather Plus.\nNVDA+alt+w anuncia la fecha de la última actualización del boletín meteorológico.\nShift+control+w alterna entre Fahrenheit, Celsius y Kelvin.\nPara otras instrucciones, también puedes pulsar el botón Ayuda del Complemento en el Administrador de Complementos."
		},
		{
			"language": "fr",
			"displayName": "Weather_Plus",
			"description": "Ajoute la température locale et les prévisions à 24 heures et jusqu'à 2 jours au-delà.\nNVDA+w pour le bulletin en cours.\nNVDA+maj+w pour les prévisions à 24 heures et jusqu'à 2 jours au-delà.\nNVDA+maj+w, appuyé deux fois fournit les prévision horaires des conditions météo.\nNVDA+maj+contrôle+w pour saisir rapidement une ville temporaire.\nNVDA + maj + contrôle + alt + w pour ouvrir les paramètres de Weather Plus.\nNVDA+alt+w annonce la date de dernière mise à jour du bulletin météo.\nMaj+contrôle+w alterne entre Fahrenheit, Celsius et Kelvin.\nPour d'autres instructions, vous pouvez aussi presser le bouton d'aide de l'extension dans le Gestionnaire d'Extensions."
		},
		{
			"language": "gl",
			"displayName": "Weather_Plus",
			"description": "Engade a temperatura local e o pronóstico durante 24 horas e a predición ata 2 días.\nNVDA+w para o anuncio actual.\nNVDA+shift+w para a predición durante 24 horas e a predición ata 2 días.\nNVDA+shift+w, premido dúas veces proporciona a previsión por horas das condicions climatolóxicas.\nNVDA+shift+control+w para introducir rapidamente unha cidade temporal.\nNVDA+shift+control+alt+w Abrir o diálogo de opcións do Weather Plus.\nNVDA+alt+w anuncia a data da última actualización do boletín meteorolóxico.\nShift+control+w alterna entre Fahrenheit, Celsius e Kelvin.\nPara outras instrucións, tamén pode premer o botón Axuda do Complemento no Administrador de Complementos."
		},
		{
			"language": "hr",
			"displayName": "Weather_Plus",
			"description": "Dodaje lokalnu temperaturu i prognozu za 24 sata te predviđanje do 2 dana. \\ N\nNVDA+w za trenutačnu prognozu.\nNVDA + shift + w za predviđanje u trenutna 24 sata i predviđanje do 2 dana. \\ N\nNVDA + shift + w, pritisnuto dva puta, pruža prognozu vremenskih uvjeta po satima. \\ N\nNVDA+šift+kontrol+w za brzi unos privremenog grada.\nNVDA+šift+kontrol+alt+w za otvaranje postavki za Vremensku prognozu plus.\nNVDA+alt+w najavljuje datum zadnjeg aktualiziranja vremenskog izveštaja.\nŠift+kontrol+w mijenja između Fahrenhaita, Celzija i kelvina.\nZa dodatne upute, pritisni gumb Pomoć u upravljaču dodataka."
		},
		{
			"language": "it",
			"displayName": "Weather_Plus",
			"description": "Aggiunge la temperatura locale e la previsione 24 ore su 24 e la previsione fino a 2 giorni.\nNVDA+w per bollettino attuale.\nNVDA+shift+w per la previsione nelle 24 ore correnti e previsione fino a 2 giorni.\nNVDA+shift+w, premuto due volte fornisce la previsione oraria delle condizioni meteorologiche.\n\nNVDA+shift+control+w immissione rapida di una città temporanea.\nNVDA+shift+control+alt+w Apre la finestra impostazioni di Weather Plus.\nNVDA+alt+w Annuncia la data dell'ultimo aggiornamento del bollettino metereologico.\nShift+control+w alterna tra Fahrenheit, Centigradi e Kelvin.\nPer altre istruzioni, è anche possibile premere il pulsante Aiuto sul componente aggiuntivo Nel Gestore componenti aggiuntivi."
		},
		{
			"language": "pl",
			"displayName": "Weather_Plus",
			"description": "Dodaje temperaturę lokalną i prognozę 24-godzinną i wykaz dwudniowy.\nNVDA+w ogłasza aktualne warunki.\nNVDA+shift+w dla prognozy 24-godzinnej i dwudniowej.\nNVDA+shift+w, wciśnięto dwa razy dostarcza godzinną pogodę.\nNVDA+shift+control+w dla szybkiego wpisywania tymczasowego miasta.\nNVDA+shift+control+alt+w otwiera okno dialogowe ustawień Weather Plus.\nNVDA+alt+w Podaje ostatnią date aktualizacji biuletynu pogodowego.\nShift+control+w przełącza się pomiędzy farenhajtami, celsjuszami i kelwinami.\nAby uzyskać więcej instrukcji, naciśnij pomoc dodatku w menedżerze dodatków."
		},
		{
			"language": "pt_BR",
			"displayName": "Weather_Plus",
			"description": "Adiciona temperatura local e previsão de 24 horas e predição de até 2 dias.\nNVDA+w informa as condições meteorológicas atuais.\nNVDA+shift+w para a predição das 24 horas atuais e predição até 2 dias.\nNVDA+shift+w, pressionado duas vezes fornece a previsão horária das condições meteorológicas.\nNVDA+shift+control+w para inserir rapidamente uma cidade temporária.\nNVDA+shift+control+alt+w Para abrir o diálogo de configurações do Weather Plus.\nNVDA+alt+w anuncia a data da última atualização do boletim meteorológico.\nShift+control+w alterna entre Fahrenheit, Celsius e Kelvin.\nPara outras instruções, você também pode pressionar o botão Ajuda do complemento no Gestor de complementos."
		},
		{
			"language": "pt_PT",
			"displayName": "Weather_Plus",
			"description": "Adiciona a temperatura local e a previsão para 24 horas e previsões até 3 dias.\nNVDA+w informa as condições meteorológicas actuais.\nNVDA+Shift+W para a previsão para 24 horas e próximos 2 dias.\nNVDA+Shift+W, pressionado duas vezes fornece a previsão horária das condições meteorológicas\nNVDA+shift+control+w para inserir rapidamente uma cidade temporária.\nNVDA+shift+control+alt+w Para abrir o diálogo de configurações do Weather Plus.\nNVDA+alt+w Indica a data da última actualização da previsão do tempo.\nShift+control+w alterna entre Fahrenheit, centígrados e Kelvin.\nPara outras instruções, pode ppressionar o botão \"Ajuda do Complemento\", no \"gestor de extras\"."
		},
		{
			"language": "ro",
			"displayName": "Weather_Plus",
			"description": "Adaugă temperatura locală și prognoza pe 24 de ore, precum și previziunile meteorologice pentru următoarele două zile.\nNVDA+w pentru buletinul actual.\nNVDA+shift+w pentru previziunile pe 24 de ore și pentru prognoza pe două zile.\nNVDA+shift+w apăsată de două ori furnizează prognoza orară.\nNVDA+shift+control+w alege un oraș temporar.\nNVDA+shift+control+alt+w Deschide dialogul de setări Weather Plus.\nNVDA+alt+w anunță data ultimei actualizări a buletinului meteorologic.\nShift+control+w comută între Fahrenheit, Celsius și Kelvin.\nPentru alte instrucțiuni, puteți apăsa butonul de ajutor care se găsește în administratorul de suplimente."
		},
		{
			"language": "ru",
			"displayName": "Weather_Plus",
			"description": "Добавляет локальную температуру и прогноз на 24 часа и прогноз на 2 дня.\nNVDA+w для текущей погоды.\nNVDA+Shift+W для прогноза на ближайшие 24 часа и на 2 дня.\nNVDA+Shift+w, нажатая дважды, предоставляет почасовой прогноз погодных условий.\nNVDA+shift+control+w для быстрого ввода временного города.\nNVDA+Shift+Control+Alt+w для открытия настроек Weather Plus.\nNVDA+alt+w объявляет дату последнего обновления сводки погоды.\nShift+Ctrl+w переключение между шкалой Фаренгейта, Цельсия и Кельвина.\nДля получения дополнительных инструкций, вы можете нажать кнопку \"Справка\" в менеджере дополнений."
		},
		{
			"language": "sk",
			"displayName": "Weather_Plus",
			"description": "Pridá miestnu teplotu a predpoveď na 24 hodín a predpoveď až na 2 dni. \\ N\nNVDA+w  oznámy aktuálne počasie.\nNVDA+shift+w predpoveď na aktuálnych 24 hodín až na 2 dni. \\ n\npredpoveď na aktuálnych 24 hodín až na 2 dni. \\ n\nNVDA+shift+w, dvojité stlačenie poskytuje hodinovú predpoveď poveternostných podmienok. \\ n\nNVDA+shift+ctrl+w umožní zadať dočasné mesto.\nNVDA+shift+ctrl+alt+w Otvorí nastavenia doplnku Počasie.\nNVDA+alt+w oznámi dátum poslednej aktualizácie dát o počasí.\nShift+ctrl+w  prepína oznamovanie teploty v stupňoch Fahrenheita, Celzia a Kelvina.\nPre ďalšie informácie otvorte nápovedu v správcovi doplnkov."
		},
		{
			"language": "sr",
			"displayName": "Weather_Plus",
			"description": "Dodaje lokalnu temperaturu i prognozu za 24 sata kao i predviđanje za do 2 dana.\nNVDA+w za trenutnu prognozu.\nNVDA+šift +w Za izveštaj za trenutna  24 sata kao i predviđanje prognoze za do 2 dana.\nNVDA+šift +w, ako se pritisne dva puta pruža prognozu sata i vremenske uslove.\nNVDA+shift+control+w Brzo unošenje privremenog grada.\nNVDA+shift+control+alt+w Otvara Weather Plus prozor za podešavanje.\nNVDA+alt+w Izgovara vreme ažuriranja zadnjeg meteo izveštaja.\nShift+control+w Izbor između Farenhajta, Celzijusa i Kelvina.\nZa dodatna uputstva, pritisnite dugme Pomoć u menadžeru (upravljaču) NVDA dodataka."
		},
		{
			"language": "tr",
			"displayName": "Weather_Plus",
			"description": "Seçili şehrin sıcaklık bilgisini; 24 saatlik ve sonraki iki gün için hava tahmin raporunu verir.\nNVDA+w mevcut bülten için.\nNVDA+shift+w 24 saatlik ve sonraki iki gün için hava tahmin raporunu sunar.\nNVDA+shift+w, iki kez basıldığında, saatlik hava durumu bilgisini verir.\nNVDA+shift+control+w hızlıca geçici bir şehre girmek için.\nNVDA + shift + control + alt + w Weather Plus ayarlarını açmak için.\nNVDA+alt+w Hava Raporunun son güncelleme zamanını seslendirir.\nShift+control+w Fahrenheit, Celsius ve Kelvin arasında değişiklik yapar.\nDiğer talimatlar için, Eklenti yöneticisi içindeki Yardım düğmesine de basabilirsiniz."
		},
		{
			"language": "uk",
			"displayName": "Weather_Plus",
			"description": "Додає локальну температуру і прогноз на 24 години і прогноз на 2 дні.\nNVDA+w для поточної погоди.\nNVDA+Shift+W для прогнозу на найближчі 24 години і на 2 дні.\nNVDA+Shift+w, натиснута двічі, надає погодинний прогноз погодних умов.\nNVDA+shift+control+w для швидкого введення тимчасового міста.\nNVDA+Shift+Control+Alt+w для відкриття налаштувань Weather Plus.\nNVDA+alt+w оголошує дату останнього оновлення прогнози погоди.\nShift+Ctrl+w перемикання між шкалою Фаренгейта, Цельсія і Кельвіна.\nДля отримання додаткових інструкцій, ви можете натиснути кнопку \"Довідка\" в менеджері додатків."
		},
		{
			"language": "vi",
			"displayName": "Weather_Plus",
			"description": "Thêm nhiệt độ địa phương,  dự báo trong 24 giờ và đến hai ngày tiếp sau.\nNVDA+w để biết thông tin hiện tại.\nNVDA+shift+w để dự báo cho 24 giờ hiện tại và đến hai ngày sau đó.\nNVDA+shift+w, bấm hai lần sẽ cung cấp dự báo thời tiết từng giờ.\nNVDA + shift + control + w để nhập nhanh tỉnh / thành tạm. \\ N\nNVDA + shift + control + alt + w để mở cài đặt Weather Plus. \\ N\nNVDA + alt + w thông báo ngày cập nhật cuối cùng của dự báo thời tiết. \\ N\nShift+control+w chuyển giữa Fahrenheit, Celsius và Kelvin.\nĐể có thêm thông tin, bạn cũng có thể bấm nút trợ giúp Add-on trong trình quản lý Add-on."
		}
	],
	"reviewUrl": "https://github.com/nvaccess/addon-datastore/discussions/4080"
}
