{
	"addonId": "inputLock",
	"displayName": "Input lock",
	"URL": "https://github.com/jmdaweb/inputLock/releases/download/v1.14/inputLock-1.14.nvda-addon",
	"description": " With this addon, you will be able to lock and unlock your input devices with a single gesture or key press.\nThis gesture can be changed from Input Gestures dialog.",
	"sha256": "3382b05d6f67dcfae1539ef219b103869b4f17e94f0598dea7c12e2bd43b282d",
	"addonVersionName": "1.14",
	"addonVersionNumber": {
		"major": 1,
		"minor": 14,
		"patch": 0
	},
	"minNVDAVersion": {
		"major": 2023,
		"minor": 3,
		"patch": 4
	},
	"lastTestedVersion": {
		"major": 2024,
		"minor": 1,
		"patch": 0
	},
	"channel": "stable",
	"publisher": "jmdaweb",
	"sourceURL": "https://github.com/jmdaweb/inputLock",
	"license": "GPL v2",
	"homepage": "https://github.com/jmdaweb/inputLock",
	"licenseURL": "https://www.gnu.org/licenses/gpl-2.0.html",
	"translations": [
		{
			"language": "ar",
			"displayName": "تعطيلُ الإدخال",
			"description": "مع هذه الإضافة، ستغدو قادرًا على تفعيل أو تعطيل الإدخال عبر أجهزة الإدخال الخاصة بك بضغطة واحدة على مفتاح اختصار أو إيماءة.\nيمكن تغيير هذا الاختصار عبر مربّع حوار تخصيص اختصارات NVDA."
		},
		{
			"language": "bg",
			"displayName": "Заключване на входа (Input lock)",
			"description": "С тази добавка ще можете да заключвате и отключвате входните си устройства само с един жест или с натискане на клавишна комбинация.\nВъпросният жест може да бъде променен от диалоговия прозорец \"Жестове на въвеждане\"."
		},
		{
			"language": "da",
			"displayName": "Inputlås",
			"description": "Med denne tilføjelse vil du kunne låse og låse op for dine inputenheder med en enkelt bevægelse eller tastetryk. Den tilhørende kommando kan ændres fra dialogboksen \"Inputbevægelser\"."
		},
		{
			"language": "de",
			"displayName": "Eingabesperre",
			"description": "Mit dieser NVDA-Erweiterung können Sie Ihre Eingabegeräte mit einer einzigen Geste oder Tastenkombination sperren und entsperren.\nDiese Geste kann im Dialogfeld für die Tastenbefehle in der Kategorie \"Eingaben\" angepasst werden."
		},
		{
			"language": "es",
			"displayName": "Bloqueo de entrada",
			"description": " Con este complemento, podrás bloquear y desbloquear tus dispositivos de entrada con un único gesto o combinación de teclado.\nEste gesto se puede modificar desde el diálogo gestos de entrada."
		},
		{
			"language": "fa",
			"displayName": "قفلِ ورودی",
			"description": " با این افزونه میتوانید دستگاه‌های ورودی را با استفاده از یک حرکت یا فِشُردنِ یک کلید قفل کنید یا از حالت قفل دربیاورید.\nاین حرکت یا کلید از پنجره‌ی مدیریتِ فرمان‌های ورودی قابل اختصاص دادن یا تغییر است."
		},
		{
			"language": "fi",
			"displayName": "Syöttölukko",
			"description": "Tämän lisäosan avulla voidaan lukita syöttölaitteet tai avata niiden lukitus yhdellä näppäinkomennolla.\nTätä komentoa on mahdollista muuttaa Syöttökomennot-valintaikkunasta."
		},
		{
			"language": "fr",
			"displayName": "Input lock",
			"description": " Avec cette extension, vous pourrez verrouiller et déverrouiller vos périphériques d'entrée en un seul geste ou en appuyant sur une touche.\nCe geste peut être modifié à partir du dialogue Gestes de commandes."
		},
		{
			"language": "gl",
			"displayName": "Input lock",
			"description": " Con este complemento, poderás bloquear e desbloquear o teu dispositivo de entrada cun só xesto ou pulsación de teclas.\nEste xesto pódese cambiar no diálogo de Xestos de Entrada de NVDA."
		},
		{
			"language": "he",
			"displayName": "נעילת קלט",
			"description": "בעזרת תוסף זה תוכלו לנעול ולבטל נעילת עכבר בזמן העבודה עם NVDA"
		},
		{
			"language": "hr",
			"displayName": "Zaključaj unos",
			"description": " S ovim dodatkom je moguće zaključati ulazne uređaje jednim tipkovničkim prečacem ili gestom.\nOva gesta se može promijeniti u dijaloškom okviru za Ulazne geste."
		},
		{
			"language": "it",
			"displayName": "Input lock",
			"description": "Tramite questo componente aggiuntivo, sarà possibile bloccare o sbloccare il proprio dispositivo di input con un gesto o una combinazione di tasti.\nTale gesto può essere configurato nelle finestra tasti e gesti di immissione."
		},
		{
			"language": "ka",
			"displayName": "Input lock",
			"description": " ამ დამატების საშუალებით, შეგიძლიათ დაბლოკოთ და განბლოკოთ თქვენი შეყვანის მოწყობილობები ერთი ჟესტითა თუ კლავიშთა კომბინაციით.\nამ ჟესტის შეცვლა შესაძლებელია შეყვანის ჟესტების დიალოგურ ფანჯარაში.."
		},
		{
			"language": "pl",
			"displayName": "Input lock",
			"description": " Za pomocą tego dodatku, możliwe jest blokowanie myszy lub klawiatury przy pomocy jednego naciśniętego klawisza lub zdarzenia wejścia.\nto zdarzenie wejścia może być zmienione w oknie dialogowym zdarzenia wejścia."
		},
		{
			"language": "pt_BR",
			"displayName": "Bloqueio de entrada",
			"description": " Com este complemento, poderá bloquear e desbloquear os seus dispositivos de entrada com um único comando ou pressionamento de tecla.\nEsse comando pode ser alterado no menu Definir Comandos."
		},
		{
			"language": "pt_PT",
			"displayName": "Bloqueio de entrada",
			"description": " Com este extra, poderá bloquear e desbloquear os seus dispositivos de entrada com um único comando ou pressionar de tecla.\nEsse comando pode ser alterado no menu \"definir comandos\"."
		},
		{
			"language": "ro",
			"displayName": "blocare intrări",
			"description": "Cu acest supliment, veți putea bloca și debloca dispozitivele de intrare cu o singură comandă sau o apăsare de tastă. Comanda respectivă poate fi schimbat din dialogul Gesturi de intrare ân preferințele din meniul NVDA."
		},
		{
			"language": "ru",
			"displayName": "Input lock",
			"description": " С помощью этого дополнения, вы сможете блокировать любое устройство ввода, используя только один жест или комбинацию клавиш.\nЭтот жест может быть изменён в диалоге \"Жесты ввода\"."
		},
		{
			"language": "sk",
			"displayName": "Blokovanie vstupu",
			"description": "Umožňuje rýchlo zablokovať a odblokovať vstup z klávesnice, myši a dotykovej obrazovky pomocou jednej klávesovej skratky alebo jediného dotykového gesta.\nSkratku nastavíte v dialógu Klávesové skratky."
		},
		{
			"language": "sr",
			"displayName": "Zaključavanje unosa",
			"description": " Sa ovim dodatkom, moćićete da zaključate i otključate vaše uređaje za unos jednim pokretom na ekranu ili jednom prečicom.\nMože se promeniti iz dijaloga \"ulane komande\"."
		},
		{
			"language": "tr",
			"displayName": "Girdi kilidi",
			"description": " Bu eklenti ile, tek bir hareket ya da tuşa basarak giriş aygıtlarını kilitlemek ve kilidini açmak mümkün.\nBu hareket girdi hareketleri iletişim kutusundan değiştirilebilir."
		},
		{
			"language": "uk",
			"displayName": "Блокування введення",
			"description": "  З цим додатком у вас з’явиться можливість блокувати й розблоковувати ваші пристрої введення одним жестом або натисканням комбінації клавіш.\nЦей жест можна змінити в діалозі «Жести вводу»."
		},
		{
			"language": "vi",
			"displayName": "Khóa đầu vào",
			"description": "Với add-on này, bạn có thể khóa hay mở khóa các thiết bị đầu vào bằng một thao tác hay phím tắt đơn giản.\nCó thể thay đổi thao tác từ hộp thoại quản lý các cử chỉ."
		},
		{
			"language": "zh_CN",
			"displayName": "输入锁",
			"description": "使用此插件，您只需一个手势或按键即可锁定或解锁输入设备。可从“按键与手势”对话框更改此手势。"
		}
	],
	"reviewUrl": "https://github.com/nvaccess/addon-datastore/discussions/2822"
}
