{
	"addonId": "BrailleExtender",
	"displayName": "Braille Extender",
	"URL": "https://github.com/aaclause/BrailleExtender/releases/download/23.08.15.2-dev/BrailleExtender-23.08.15.nvda-addon",
	"description": "BrailleExtender is a NVDA add-on that provides various features at braille level. Currently, the following features are implemented:\n* reload two favorite braille display with shortcuts.\n* automatic review cursor tethering in terminal role like in PuTTY, Powershell, bash, cmd.\n* auto scroll.\n* switch between several input/output braille tables.\n* mark the text with special attributes through dot 7, dot 8 or both.\n* use two output braille tables simultaneously.\n* display tab signs as spaces.\n* reverse forward scroll and back scroll buttons.\n* say the current line during text scrolling either in review mode, or in focus mode or both.\n* translate text easily in Unicode braille and vice versa. E.g.: z <--> ⠵.\n* convert cell description to Unicode braille and vice versa. E.g.: 123 <--> ⠇.\n* lock braille keyboard.\n* launch an application/URL with gesture.\n* braille dictionaries.\n* type with one-hand from braille keyboard.\n* display undefined characters from braille tables (including emojis) using altenative representations.\n* enter any character from braille keyboard (including emojis).\n* skip blank lines during text scrolling.\n* Speech History Mode.\n* and much more!\n\nFor some braille displays, it extends the braille display commands to provide:\n* offer complete gesture maps including function keys, multimedia keys, quick navigation, etc.;\n* emulate modifier keys, and thus any keyboard shortcut;\n* offer several keyboard configurations concerning the possibility to input dots 7 and 8, enter and backspace;\n* add actions and quick navigation through a rotor.",
	"sha256": "404f4f8da0d357a3f4b2714d07307c2ea6fcf56f9744a1433904e55642f9c8a7",
	"addonVersionName": "23.08.15",
	"addonVersionNumber": {
		"major": 23,
		"minor": 8,
		"patch": 15
	},
	"minNVDAVersion": {
		"major": 2021,
		"minor": 1,
		"patch": 0
	},
	"lastTestedVersion": {
		"major": 2023,
		"minor": 1,
		"patch": 0
	},
	"channel": "dev",
	"publisher": "André-Abush Clause",
	"sourceURL": "https://github.com/aaclause/BrailleExtender/releases/tag/23.08.15.2-dev",
	"license": "GPL v2",
	"homepage": "https://andreabc.net/projects/NVDA_addons/BrailleExtender",
	"licenseURL": "https://www.gnu.org/licenses/gpl-2.0.html",
	"translations": [
		{
			"language": "ar",
			"displayName": "Braille Extender",
			"description": "BrailleExtender هي إضافة برمجية لقارئ الشاشة nvda تقدم بعض المزايا الإضافية المتعلقة باستخدام برايل. حالياً تحتوي الإضافة على المزايا التالية:\n* إمكانية تفضيل جهازين مختلفين من أسطر برايل الإلكترونية والتبديل بينهما بمفتاح اختصار.\n* الربط التلقائي لمؤشر الاستعراض في نوافذ البرامج التي تستخدم الأوامر الكتابية مثل PuTTY, Powershell, bash, cmd.\n* التمرير التلقائي.\n* التبديل بين العديد من جداول الإدخال والعرض المفضلة مباشرةً بمفتاح اختصار.\n* تحديد النصوص ذات السمات الخاصة بالنقطة السابعة أو الثامنة أو كلاهما.\n* استخدام جدولين من جداول عرض برايل في نفس الوقت.\n* عرض علامات التاب كمسافات.\n* عكس وظيفة أزرار التمرير للأمام والتمرير للخلف.\n* قراءة السطر الحالي أثناء تمرير النص إما في نمط الاستعراض أو في نمط التركيز أو في كليهما.\n* ترجمة النص بسهولة بطريقة برايل Unicode والعكس. فمثلا: z <--> ⠵.\n* تحويل الوصف النقطي لخلايا برايل إلى Braille Unicode وبالعكس، مثال: 123 <--> ⠇.\n* إغلاق لوحة مفاتيح برايل.\n* تشغيل تطبيق أو رابط معين بسرعة.\n* قواميس برايل.\n* اكتب بيد واحدة من لوحة مفاتيح برايل.\n* عرض أحرف غير مُعرَّفة من جداول برايل (بما في ذلك الرموز التعبيرية) باستخدام التمثيل البديل.\n* أدخل أي حرف من لوحة مفاتيح برايل (بما في ذلك الرموز التعبيرية).\n* تخطي الأسطر الفارغة أثناء تمرير النص.\n* Speech History Mode.\n* وغير ذلك الكثير!\n\nفي حالة بعض أسطر عرض برايل، تقوم الإضافة بزيادة مفاتيح الاختصار للأوامر لتشمل:\n* تقديم مخططات كاملة للاختصارات، بما في ذلك مفاتيح الوظائف ومفاتيح تشغيل الوسائط والتحرك السريع وغير ذلك.;\n* محاكاة مفاتيح التعديل، وبالتالي إمكانية محاكاة أي مفتاح اختصار تقريبا;\n* تقديم العديد من الإعدادات الخاصة بلوحة المفاتيح فيما يتعلق بكتابة النقطتين السابعة والثامنة، ومفتاح الإدخال ومفتاح الحذف الخلفي;\n* تنفيذ إجراآت والتحرك السريع عبر الدوار."
		},
		{
			"language": "da",
			"displayName": "Udvidelse til Punktskrift",
			"description": "Udvidelsen til Punktskrift er en NVDA-tilføjelse, som tilbyder en lang række funktioner på punktskriftniveau. Følgende funktioner er for øjeblikket implementeret:\n* indstil to foretrukne punktdisplays med genveje.\n* automatisk binding af gennemsynsmarkør  i terminalmode som i PuTTY, Powershell, bash, cmd.\n* auto-rul.\n* Skift imellem flere punkttabeller til indtastning/visning.\n* markér tekst med særlige attributter ved hjælp af punkt 7, punkt 8 eller begge.\n* brug to punkttabeller til visning.\n* vis tabulatortegn som mellemrum.\n* Vend knapperne til at rulle fremad og bagud.\n* oplæs den aktuelle linje under tekstrulning enten i gennemsynstilstand eller i fokustilstand eller begge dele.\n* oversætte tekst nemt til Unicode punktskrift og vice versa fx: z <--> ⠵.\n* Konvertere beskrivelse af punktceller til Unicode punktskrift og omvendt. Fx: 123 <--> ⠇.\n* lås punkttastaturet.\n* Åbn en applikation/URL med en inputbevægelse.\n* punktskriftordbøger.\n* type with one-hand from braille keyboard.\n* Vis udefinerede tegn fra punkttabeller (herunder emojis) ved hjælp af alternative gengivelser.\n* indskriv alle tegn fra punktskrifttastaturet (også emojis).\n* Spring blanke linjer over ved tekstrulning.\n* Tilstanden Talehistorik.\n* og meget mere!\n\nudvider punktskriftkommandoerne på nogle punktdisplays, så de omfatter:\n* tilbyder komplette kommandosæt herunder funktionstaster, multimedietaster, hurtig navigation, osv.;\n* emulere modifikatortaster og derved alle genvejstaster;\n* indeholder flere tastaturkonfigurationer vedrørende muligheden for at indskrive prik 7 og 8, enter og backspace;\n* tilføj handlinger og hurtig navigering via en rotor."
		},
		{
			"language": "de",
			"displayName": "Braille Extender",
			"description": "Braille Extender ist eine NVDA-Erweiterung, die verschiedene Braile-Funktionen in NVDA implementiert. Aktuell sind folgende Funktionen verfügbar:\n* Möglichkeit, eine zweite bevorzugte Braillezeile mit Hilfe  eines Tastenbefehls zu laden.\n* Automatische Kopplung des Cursors in Eingabeaufforderungen wie PuTTY, Powershell, Bash, cmd.\n* Automatisches Weiterlesen.\n* Möglichkeit, zwischen verschiedenen Braille-Ein- und -Ausgabetabellen zu wechseln.\n* Speziell formatierter Text durch Punkte 7, 8 oder beide hervorheben.\n* zwei Braille-Ausgabetabellen gleichzeitig verwenden.\n* Tabulatorzeichen mit Leerzeichen darstellen.\n* Scrolltasten für links und rechts vertauschen.\n* aktuelle Zeile während des Textscrollens, entweder im darstellungsmodus, im Fokusmodus oder beidem ansagen.\n* Text einfach in Unicode braille und umgekehrt übersetzen, z.B.: z <--> ⠵.\n* Schnelle Konvertierung von Modulbeschreibungen in Unicode-Braille und umgekehrt. Zum Beispiel: 123 <--> ⠇.\n* Braille-Tastatur sperren.\n* Anwendung oder URL schnell mit Hilfe eines Tastenbefehls aufrufen.\n* Braille-Wörterbücher.\n* einhändig über die Braille-Tastatur schreiben.\n* undefinierte Zeichen in den Braille-Tabellen (einschließlich Emojis) unter Verwendung alternativer Darstellungen anzeigen.\n* beliebige Zeichen über die Braille-Tastatur eingeben (einschließlich Emojis).\n* Leerzeilen beim Lesen überspringen.\n* Sprachausgabenverlauf.\n* und vieles mehr!\n\nErweitert die Braillezeilen-Befehle für bestimmte Braillezeilenmodelle:\n* vollständige Befehlszuweisungen einschließlich Funktionstasten, Multimediatasten, schnelle Navigation usw anbieten.;\n* NVDA-Tasten und sämtliche Tastenkombination emulieren;\n* Bietet verschiedene Tastaturkonfigurationen hinsichtlich der Möglichkeit der Eingabe von Punkt 7 und 8 sowie der Eingabe- und Rücktaste;\n* Hinzufügen von Aktionen und schnelle Navigation durch einen Rotor."
		},
		{
			"language": "es",
			"displayName": "Braille Extender",
			"description": "BrailleExtender es un complemento de NVDA que proporciona varias funciones a nivel braille. Actualmente, se implementan las siguientes funciones:\n* recargar dos pantallas braille favoritas con accesos directos.\n* revisión automática del cursor de anclaje en el papel de terminal como en PuTTY, Powershell, bash, cmd.\n* desplazamiento automático.\n* cambiar entre varias tablas braille de entrada/salida.\n* marcar el texto con atributos especiales mediante el punto 7, el punto 8 o ambos.\n* utilizar simultáneamente dos tablas braille de salida.\n* mostrar signos de tabulación como espacios.\n* botones de desplazamiento hacia delante y hacia atrás.\n* decir la línea actual durante el desplazamiento del texto en modo revisión, en modo enfoque o en ambos.\n* traducir texto fácilmente en braille Unicode y viceversa. Por ejemplo: z <--> ⠵.\n* convertir la descripción de la celda en braille Unicode y viceversa. Ej: 123 <--> ⠇.\n* bloquear teclado braille.\n* lanzar una aplicación/URL con un gesto.\n* diccionarios braille.\n* escribir con una mano desde el teclado braille.\n* mostrar caracteres no definidos de las tablas braille (incluidos los emojis) mediante representaciones alternativas.\n* introducir cualquier carácter del teclado braille (incluidos emojis).\n* omitir líneas en blanco durante el desplazamiento de texto.\n* Modo de historial de voz.\n* ¡y mucho más!\n\nPara algunas pantallas braille, amplía los comandos de pantalla braille para proporcionar:\n* ofrece mapas gestuales completos que incluyen teclas de función, multimedia, navegación rápida, etc.;\n* emula las teclas modificadoras y, por tanto, cualquier método abreviado de teclado;\n* ofrece varias configuraciones de teclado relativas a la posibilidad de introducir los puntos 7 y 8, intro y retroceso;\n* añadir acciones y navegación rápida a través de un rotor."
		},
		{
			"language": "fa",
			"displayName": "BrailleExtender",
			"description": "BrailleExtender یک افزونه برای NVDA است که امکاناتِ گوناگونی را در سطحِ بریل فراهم می‌آورَد. در حالِ حاضر، ویژگی‌های زیر توسطِ این افزونه در اختیار کاربر قرار میگیرد:\n* بارگذاریِ دو نمایشگر بریل با استفاده از میانبر.\n* اتصالِ خودکارِ مکان‌نمای بازبینی به بریل در نقش‌های پایانه‌مانند، مثلا PuTTY, Powershell, bash, cmd.\n* مرورِ خودکار.\n* بینِ چندین جدولِ بریلِ ورودی و خروجی سوییچ میکند.\n* نشانه‌گذاری متنِ دارای ویژگی‌های خاص با نقطه‌ی ۷ یا ۸ یا هردو.\n* استفاده‌ی همزمان از دو جدولِ خروجیِ بریل.\n* نمایشِ علامت‌های تب به شکلِ فاصله.\n* کارِ دکمه‌های جلو بردن و عقب بردن را معکوس میکند.\n* خواندنِ خطِّ جاری هنگامِ مرور در حالت بازبینی، حالتِ فرمان‌پذیری یا هردو.\n* متن را به‌آسانی به بریلِ یونیکُد و برعکس برمیگردانَد. مثلا، z <--> ⠵.\n* توصیفِ خانه‌های بریل را به بریلِ یونیکُد و برعکس تبدیل میکند؛ مثلا، 123 <--> ⠇.\n* قفل کردنِ صفحه‌کلیدِ بریل.\n* راه‌اندازیِ سریعِ یک برنامه یا آدرسِ اینترنتی با یک فرمان.\n* دیکشنری‌های بریل.\n* تایپ با صفحه‌کلیدِ بریل با یک دست.\n* نمایشِ نویسه‌های تعریف‌نشده در جدول‌ها (از قبیلِ ایموجی‌ها) با استفاده از روش‌های جایگزین.\n* هر نویسه‌ای (از جمله ایموجی‌ها) را با صفحه‌کلیدِ بریل وارد کنید.\n* رد کردنِ خط‌های خالی هنگامِ مرورِ متن.\n* Speech History Mode.\n* و بیشتر از این‌ها!\n\nبرای برخی نمایشگرهای بریل، فرمان‌های نمایشگرِ بریل را گسترش میدهد تا موارد زیر را فراهم کند:\n* ارائه‌ی نقشه‌ی کاملی از فرمان‌ها شامل کلید‌های کاربردی (F)، کلیدهای چندرسانه‌ای، پیمایشِ سریع و غیره;\n* شبیه‌سازیِ کلیدهای مبدل و همچنین کلیدهای میانبر;\n* عرضه‌ی چندین پیکربندیِ صفحه‌کلیدی، نظر به امکانِ ورودِ نقطه‌های ۷ و ۸، Enter و Backspace;\n* عملیات و پیمایشِ سریع را از طریق یک گردونه (Rotor) اضافه کنید."
		},
		{
			"language": "fr",
			"displayName": "Braille Extender",
			"description": "BrailleExtender est un greffon NVDA qui fournit diverses fonctionnalités au niveau braille. Actuellement, les fonctionnalités suivantes sont implémentées:\n* basculer entre deux afficheurs braille favoris ou encore de les recharger aisément.\n* basculer automatiquement le suivi braille en mode revue dans les applications avec terminal comme PuTTY, Powershell, bash, cmd.\n* défilement automatique.\n* boucler entre ses tables d’entrée/de sortie.\n* marquer le texte avec des attributs spéciaux par le biais du point 7 et/ou du point 8.\n* utiliser deux tables braille de sortie simultanément.\n* afficher les signes de tabulation en tant qu’espaces.\n* inverser les boutons de défilement arrière et avant.\n* énoncer la ligne en cours en mode revue et/ou en mode focus pendant le défilement du texte.\n* traduire le texte facilement en braille Unicode et inversement. Ex. : z <-> ⠵.\n* convertir la description de la cellule en braille Unicode et vice versa. Ex .: 123 <-> ⠇.\n* verrouiller le clavier braille.\n* lancer une application / URL avec un geste.\n* dictionnaires braille.\n* saisir d’une seule main sur le clavier braille.\n* afficher les caractères non définis des tables braille (y compris les emojis) en utilisant des représentations alternatives.\n* saisir n’importe quel caractère depuis le clavier braille (y compris les emojis).\n* ignorer les lignes vides pendant le défilement.\n* Mode historique vocal.\n* et beaucoup plus !\n\nPour certains afficheurs braille, il étend le mappage, en permettant:\n* de fournir des ensembles de geste complets comprenant les touches de fonction, les touches multimédia, la navigation rapide, etc..;\n* d’émuler les touches de combinaison, et donc n’importe quel raccourci clavier;\n* propose plusieurs configurations de clavier concernant la possibilité de saisir les points 7 et 8, d’entrer et de revenir en arrière;\n* ajouter des actions et une navigation rapide dans un rotor."
		},
		{
			"language": "he",
			"displayName": "BrailleExtenderהרחבות ברייל  ",
			"description": "BrailleExtender הוא תוסף של NVDA המספק תכונות שונות ברמת ברייל. בשלב זה, התכונות הבאות מיושמות:\n* טעינה מחדש של שני צגי ברייל מועדפים באמצעות מקשי קיצור.\n* מעבר אוטומטי למצב סקירה עבור  אפליקציות שנבחרו (ברירת מחדל: PuTTY, Powershell, bash, cmd)..\n* גלילה אוטומטית.\n* מעבר בין מספר טבלאות קלט\\פלט ברייל.\n* סימון מאפיני טקסט מסויימים בעזרת נקודות 7 או 8 או שתיהן ..\n* שימוש בשתי טבלאות פלט  ברייל בו זמנית.\n* תצוגת  סימני הטאב כרווחים.\n* הפיכת כפתורי גלילה קדימה ואחורה.\n* הכרזת השורה הנוכחית במהלך גלילה טקסט, במצב סקיר או במצב פוקוס או שניהם.ה.\n* translate text easily in Unicode braille and vice versa. E.g.: z <--> ⠵.\n* convert cell description to Unicode braille and vice versa. E.g.: 123 <--> ⠇.\n* נעל מקלדת ברייל.\n* launch an application/URL with gesture.\n* מילוני  ברייל.\n* הקלדה במקלדת ברייל ביד אחת.\n* תצוגת סימנים בלתי מוגדרים על צג הברייל (כולל סמלי הבעה) תוך שימוש בשיטות תצוגה אלטרנטיביות .\n* הקלדת כל אות או סימן במקלדת ברייל (כולל סימלי הבעה) .\n* skip blank lines during text scrolling.\n* Speech History Mode.\n* ועוד ועוד!\n\nעבור כמה צגי ברייל, הוא מרחיב את פקודות צג ברייל כדי לספק:\n* מאפשר גישה לכפתורי  פונקציה, מקשי מולטימדיה, ניווט מהיר;\n* הפעלת צירופי מקשי פקודה ולפיכך מאפשר ביצוע כל קיצור מקשים;\n* מציע מספר תצורות המקלדת לגבי האפשרויות קלט, נקודות 7 ו 8, אנטר ומחיקה;\n* add actions and quick navigation through a rotor."
		},
		{
			"language": "hr",
			"displayName": "Braille Extender",
			"description": "BrailleExtender je NVDA dodatak koji dodaje nove mogućnosti na nivou brajice. Trenutno, slijedeće značajek su dostupne:\n* ponovno učitavanje dvaju omiljenihbrajičnih redaka sa prečacima.\n* automatsko prebacivanje kursora u određenim aplikacijama terminala kao što su to default: PuTTY, Powershell, bash, cmd.\n* automatsko čitanje.\n* prebacuje između nekoliko ulaznih ili izlaznih brajičnih tablica.\n* označavanje teksta uz pomoć posebnih oznaka koristeći točkice 7 8 ili obje točkice zajedno.\n* istovremeno korištenje dvije izlazne brajične tablice.\n* prikazivanje znakova tabulatora kao razmake.\n* zamjena mjesta tipkama za čitanje napred /nazad.\n* izgovori trenutni redak u načinu teksta radi li se o načinu fokusa pregleda ili obaju.\n* prevedite tekst s lakoćom u brajični Unicode i obratno. NPR: z <--> ⠵.\n* pretvorite tekst u brajični unicode i obratno. Npr: 123 <--> ⠇.\n* zaključavanje brajičnog retka.\n* pokrenite aplikaciju/URL uz pomoć geste.\n* brajični rječnici.\n* pišite jednom rukom na brajičnoj tipkovnici.\n* prikaz nedefiniranih brajičnih znakova u tablicama (uključujući emoji) koristeći alternativni prikaz.\n* upišite bilo koji znak s brajičnom tipkovnicom (uključujući emoji).\n* preskače prazne retke prilikom automatskog čitanja.\n* Način povijesti govora.\n* i još puno toga!\n\nOsim toga, za neke brajične retke, proširuje dodijeljene tipke kako bi omogućio:\n* nudi konfigurirane prečace uključujući funkcijske tipke, multimedijske tipke, brzo kretanje, itd.;\n* oponašanje modifikatora, te stoga i drugih prečaca na tipkovnici;\n* omogućava nekoliko konfiguracija za upis brajičnih znakova uključujući točkice 7 i 8, enter i backspace;\n* dodavanje akcija i brza navigacija putem rotora."
		},
		{
			"language": "it",
			"displayName": "Braille Extender",
			"description": "Braille Extender è un componente aggiuntivo di NVDA che fornisce una serie di funzionalità riguardanti il Braille. Attualmente sono implementate le seguenti funzioni:\n* caricamento di due display Braille con tasti rapidi.\n* attivazione automatica del cursore di controllo nelle finestre terminale, come in PuTTY, Powershell, bash, prompt dei comandi.\n* scorrimento automatico.\n* gestione di più tabelle Braille di scrittura e lettura.\n* marcatura del testo con attributi speciali mediante il punto 7, il punto 8 o entrambi.\n* utilizzo contemporaneo di due tabelle Braille di lettura.\n* possibilità di mostrare i caratteri di tabulazione come spazi.\n* inversione dei pulsanti di scorrimento avanti e indietro presenti sui display Braille.\n* lettura della riga corrente durante lo scorrimento del testo, in modalità focus, revisione o entrambe.\n* possibilità di tradurre facilmente il testo in Braille Unicode e viceversa. Esempio: z <--> ⠵.\n* conversione della descrizione celle in Braille Unicode e viceversa. Esempio: 123 <--> ⠇.\n* blocco della tastiera Braille.\n* tasti rapidi per aprire un'applicazione o un indirizzo web.\n* dizionari Braille.\n* scrittura ad una mano con la tastiera Braille.\n* possibilità di mostrare i caratteri non definiti delle tabelle Braille (comprese le emoji) utilizzando rappresentazioni alternative.\n* inserimento di qualunque carattere dalla tastiera Braille (comprese le emoji).\n* salta le righe vuote durante lo scorrimento del testo.\n* Speech History Mode.\n* e molte altre!\n\nCon qualche display braille, l'add-on estende l'insieme dei comandi disponibili:\n* offre mappature tasti complete, compresi tasti funzione, tasti multimediali, tasti di navigazione veloce, ecc.;\n* simula i tasti modificatori e quindi tutti i tasti della tastiera del pc;\n* offre diverse configurazioni tastiera riguardanti la possibilità di inserire i punti 7 e 8, invio e backspace;\n* aggiunge azioni e comandi per la navigazione veloce mediante un rotore."
		},
		{
			"language": "pl",
			"displayName": "Braille Extender",
			"description": "BrailleExtender to wtyczka do NVDA dodająca nowe funkcje na poziomie brajla. Obecnie dostępne są następujące funkcje:\n* Ponowne wczytywanie dwóch ulubionych monitorów brajlowskich za pomocą skrótów klawiszowych.\n* Automatyczne przełączanie do trybu przeglądu dla terminali aplikacji takich jak PuTTY, Powershell, bash, cmd.\n* Czytanie automatyczne.\n* Przełączanie pomiędzy kilkoma tablicami brajlowskimi wprowadzania/wyjścia.\n* Oznacza tekst specjalnymi właściwościami formatowania, przy użyciu punktu 7, 8 lub obu punktów jednocześnie.\n* Jednoczesne używanie dwóch tablic wyjścia.\n* Wyświetlanie znaków tabulacji jako spacji.\n* Zamiana przycisków przewijania w przód i w tył.\n* Podczas przewijania tekstu, wypowiada aktualny wiersz, zarówno w trybie przeglądania jak i w trybie punktu uwagi.\n* łatwe przekształcanie tekstu do brajla unikodowe i na odwrót. NP: z <--> ⠵.\n* Konwertuje opis komórki brajlowskiej do brajla unikodowego i na odwrót. NP: 123 <--> ⠇.\n* zablokuj klawiaturę brajlowską.\n* Uruchom aplikację/URL za pomocą skrótu.\n* Słowniki brajlowskie.\n* Wpisuj jedną ręką na klawiaturze brajlowskiej.\n* Wyświetlanie niezdefiniowanych znaków z tablic brajlowskich (włączając w to emoji) używając alternatywnych opisów.\n* wpisywanie jakiegokolwiek znaku (włączając w to emoji).\n* omijanie pustych wierszy przy włączonym automatycznym czytaniu.\n* Tryb historii mowy.\n* i wiele więcej!\n\nDla niektórych monitorów brajlowskich, rozszerza mapowanie klawiszy, aby umożliwić:\n* dostęp do pełnych map poleceń, takich jak spis klawiszy funkcyjnych, multimedialnych i szybkiej nawigacji;\n* emulowanie modyfikatorów, a co za tym idzie, innych skrótów klawiszowych;\n* oferuje kilka konfiguracji klawiatur, umożliwiając wpisywanie punktów 7-8, enter i backspace;\n* dodawanie akcji i szybka nawigacja przez rotor."
		},
		{
			"language": "ru",
			"displayName": "Braille Extender",
			"description": "Braille Extender это дополнение для NVDA, предоставляющее различные возможности, призванные существенно расширить функционал поддержки брайля. На данный момент доступны следующие функции::\n* перезагрузка до двух брайлевских дисплеев по горячим клавишам..\n* Автоматическая привязка курсора в терминальных приложениях, как например PuTTY, Powershell, bash, cmd.\n* автопрокрутка.\n* быстрое переключение между несколькими избранными брайлевскими таблицами ввода и вывода.\n* Подчёркивает текст специальными атрибутами с помощью точек 7, и 8 или обеих.\n* одновременное использование двух таблиц брайлевского вывода..\n* отображение символов табуляции пробелами..\n* возможность поменять местами функции правой и левой клавиши прокрутки..\n* Проговаривание актуальной строки в режиме просмотра или обзора.\n* Переведите текст из уникодового брайля и обратно. напр.: z <--> ⠵.\n* Переконвертируйте брайлевские клетки в брайлевский юникод и наоборот: 123 <--> ⠇.\n* Заблокировать брайлевскую клавиатуру.\n* Запустите приложение/URL с помощью жеста.\n* Брайлевские словари.\n* Набор знаков с брайлевского дисплея одной рукой.\n* Показывает неопределённые знаки  (включая эмодзи) используя описания.\n* Набор любого знака с брайлевской клавиатуры (включая эмодзи).\n* Перескакивает пустые строки в режиме автоматического чтения.\n* Режим истории речи.\n* И ещё больше!\n\nдля некоторых брайлевских дисплеев дополнение предоставляет расширенный набор горячих клавиш, чтобы иметь возможность:\n* Предоставляет готовые сочетания клавиш включая клавиши функций, мультимедиальных клавиш, быстрой навигации, итд.;\n* эмуляции клавиш модификаторов и через них эмуляции практически любых сочитаний горячих клавиш стандартной клавиатуры.;\n* предлагает несколько профилей конфигурации клавиатуры брайлевского ввода, касательно режимов ввода точек 7 и 8 и эмуляции клавиш enter и back space.;\n* Добавление быстрых действий и навигация с помощью ротора."
		},
		{
			"language": "tr",
			"displayName": "Braille Genişletici",
			"description": "Braille Genişletici, braille düzeyinde çeşitli özellikler sağlayan bir NVDA eklentisidir. Şu anda, aşağıdaki özellikler uygulanmaktadır:\n* kısayollarla iki favori braille ekranını yeniden yükleyin.\n* puTTY, Powershell, bash, cmd'deki gibi terminal rolünde otomatik inceleme imleci bağlama.\n* otomatik kaydırma.\n* birkaç giriş/çıkış braille tablosu arasında geçiş yapın.\n* metni özel niteliklerle 7 nokta, 8 nokta veya her ikisi aracılığıyla işaretleyin.\n* aynı anda iki çıkış braille tablosu kullanın.\n* sekme işaretlerini boşluk olarak göster.\n* ileri kaydırma ve tersi geri kaydırma düğmeleri.\n* gözden geçirme modunda veya odak modunda veya her ikisinde de metin kaydırma sırasında geçerli satırı duyur.\n* unicode braille'de metni kolayca çevirin veya tam tersi. Örn: z <--> ⠵.\n* hücre açıklamasını Unicode braille'e veya tam tersine dönüştürün. Ör.: 123 <--> ⠇.\n* braille klavyesini kilitle.\n* hareket ile bir uygulama/URL başlat.\n* braille sözlükleri.\n* braille klavyeden tek elle yazın.\n* alternatif gösterimleri kullanarak braille tablolarından (emojiler dahil) tanımsız karakterleri görüntüleyin.\n* braille klavyesinden herhangi bir karakter girin (emojiler dahil).\n* metin kaydırma sırasında boş satırları atla.\n* Konuşma Geçmişi Modu.\n* ve daha fazlası!\n\nBazı braille ekranları için, braille ekran komutlarını şu şekilde genişletir:\n* işlev tuşları, multimedya tuşları, hızlı gezinme vb. dahil olmak üzere eksiksiz hareket haritaları sunar.;\n* değiştirici tuşları ve dolayısıyla herhangi bir klavye kısayolunu taklit eder;\n* 7 ve 8 noktalarını girme, enter ve geri alma olasılığı ile ilgili çeşitli klavye konfigürasyonları sunar;\n* bir rotor aracılığıyla eylemler ve hızlı gezinme ekleyin."
		},
		{
			"language": "uk",
			"displayName": "Розширювач брайля",
			"description": "Розширювач брайля — це додаток для NVDA, який надає низку функцій для брайля. Наразі він має такі функції:\n* перезавантажити два обрані брайлівські дисплеї комбінацією клавіш.\n* автоматично прив'язувати брайль до переглядового курсора у терміналах на зразок PuTTY, Powershell, bash, cmd.\n* автопрокрутка.\n* перемикання між кількома брайлівськими таблицями введення/виведення.\n* маркувати текст спеціальними атрибутами з крапки 7, крапки 8 або з обох.\n* використовувати дві брайлівські таблиці виведення одночасно.\n* показувати знаки табуляції як пробіли.\n* поміняти місцями кнопки прокрутки вперед і назад.\n* промовляє поточний рядок під час прокрутки або в режимі перегляду, або в режимі фокуса, або в обох.\n* легко переводить текст в Unicode braille і навпаки. Наприклад: z <--> ⠵.\n* перетворювати опис брайлівських комірок в Unicode braille і навпаки. Наприклад: 123 <--> ⠇.\n* блокувати брайлівську клавіатуру.\n* запустити застосунок/URL жестом.\n* брайлівські словники.\n* друкувати однією рукою на брайлівській клавіатурі.\n* показувати невизначені у брайлівській таблиці символи (включно з емодзі), використовуючи альтернативне подання.\n* вводити будь-які символи з брайлівської клавіатури (включаючи емодзі).\n* пропускати порожні рядки під час прокрутки тексту.\n* Режим історії мовлення.\n* і набагато більше!\n\nДля деяких брайлівських дисплеїв він розширює команди брайлівських дисплеїв, які надають:\n* пропонує повний набір жестів, включаючи функціональні клавіші, мультимедійні клавіші, швидку навігацію тощо.;\n* емулювати клавіші-модифікатори і, відповідно, будь-яку комбінацію клавіш;\n* пропонує кілька конфігурацій клавіатури для введення крапок 7 і 8, ентера і бекспейса;\n* додати дії і швидку навігацію за допомогою ротора."
		},
		{
			"language": "zh_TW",
			"displayName": "Braille Extender",
			"description": "BrailleExtender 是 NVDA 附加元件，可提供各種點字功能。目前，包括了:\n* 使用快速鍵重新載入兩台最常用的點顯器.\n* 在終端機（如 PuTTY，Powershell，bash，cmd）中自動跟隨檢閱游標.\n* 自動捲動.\n* 在多個輸入/輸出點字表之間切換.\n* 通過第七點，第八點，或七、八點，標記特殊屬性文字.\n* 同時使用兩個輸出點字表.\n* 將 tab 顯示為空格.\n* 前後捲動鍵互換.\n* 在檢閱模式或焦點模式，或同時在這兩種情況下，讀出文字捲動時的目前行.\n* 輕鬆用 Unicode 點字翻譯文字，反之亦然。例如:z <--> ⠵.\n* 將一方點字描述轉換為 Unicode 點字，反之亦然。例如:123 <--> ⠇.\n* 鎖定點字鍵盤.\n* 用手勢啟動應用程式/ URL.\n* 點字字典.\n* 用點字鍵盤單手打字.\n* 從點字表顯示未定義字元（包括表情符號）中的未定義自原.\n* 從點字鍵盤輸入任何自原（包括表情符號）.\n* 文字捲動中跳過空白.\n* 語音歷史模式.\n* 以及更多功能！\n\n對於某些點顯器，它擴充了點顯器命令以提供:\n* 提供完整手勢，包括功能鍵，多媒體鍵，快速導航等。;\n* 模擬組合鍵，從而模擬任何鍵盤快速鍵;\n* 提供幾種與輸入第七點、第八點，輸入和倒退鍵有關的鍵盤設定;\n* 通過轉輪新增動作和快速導航."
		}
	]
}