{"addonId": "stationPlaylist", "displayName": "Station Playlist", "URL": "https://github.com/ChrisDuffley/stationPlaylist/releases/download/25.12/stationPlaylist-25.12.3.nvda-addon", "description": "Enhances support for StationPlaylist apps. In addition, adds global commands for the Studio application from everywhere.", "sha256": "51dd63b720eaea8fa039416f817cdbfbb34b431e5272c30ef31043dddccd2137", "addonVersionName": "25.12.3", "addonVersionNumber": {"major": 25, "minor": 12, "patch": 3}, "minNVDAVersion": {"major": 2025, "minor": 1, "patch": 2}, "lastTestedVersion": {"major": 2025, "minor": 3, "patch": 2}, "channel": "stable", "publisher": "josephsl", "sourceURL": "https://github.com/ChrisDuffley/stationPlaylist", "license": "GPL v2", "homepage": "https://github.com/ChrisDuffley/stationPlaylist", "changelog": "* Added a setting in add-on settings under status announcements to announce when a cart finishes playing (NVDA will say 'cart stopped').\n* In add-on settings/status announcements, cart name checkbox is now cart announcement check list box with the former setting becoming a checkable option.\n* In Studio 6.20 and later, SPL Controller can be used to control local Studio and/or Remote Studio. A new setting in add-on settings dialog under Advanced settings panel allows configuring SPL Controller coverage/scope between both local Studio and Remote Studio or one or the other. In earlier Studio releases, SPL Controller layer will control local Studio.\n* NVDA will announce labels for SPL app screens, including track properties, insert tracks dialog's search criteria controls (Studio, Creator, Remote VT), and Studio options dialog.\n* In local Studio, performing track elapsed (Alt+Shift+T) and remaining time (Control+Alt+T) commands will also announce elapsed and remaining time for the currently playing voice track and/or cart. In addition, pressing SPL Controller, R will announce remaining duration of the playing track, voice track, or cart for local Studio.\n* Metadata streaming and status announcements settings panels will not be shown when opening add-on settings screen from Remote Studio.\n* Settings to report library scans and listener requests will not be shown in add-on settings when opened from Remote Studio.\n* In local Studio, NVDA will announce track starts value correctly (SPL Assistant, S).\n* In local Studio, NVDA will no longer announce wrong information when locating various screen information such as weather data if error log button is shown on screen.\n* In local Studio, NVDA will report library scan count regardless of \"beep for status announcements\" setting from add-on settings.\n* Library scan announcement toggle command (NVDA+Shift+R) is now limited to local Studio.\n* Changed the following SPL Assistant JAWS layout commands: hour duration (H to T), hour remaining duration (Shift+H to H), library scan (Shift+R to Alt+T), cart edit/insert (T to number row 0).\n* Resolved \"Time Scheduled/Time\" column announcement and usage in local Studio 6.20, including reporting of wrong column content when vertical column navigation is set to \"Time Scheduled\", NVDA reporting \"Time Scheduled not found\" when this column is configured as a columns explorer slot, and wrong column title shown in playlist transcripts.\n* Resolved issues working with results from insert tracks dialog in local Studio 6.20, including NVDA saying \"Artist not found\" when performing columns explorer commands (Control+NVDA+number row) to obtain artist information, wrong column information announced in columns explorer, and top and bottom beeps being heard.\n* NVDA will no longer include empty column content when generating playlist transcripts in plain text and HTML list formats.\n* In local Studio, NVDA will no longer announce \"no track playing\" when announcing next track title when no tracks are playing but next track title is showing on screen.\n* In local Studio, NVDA will no longer appear to do nothing or play error tones when cart edit/insert mode is toggled while cart explorer is active.\n* In Remote Studio, taking playlist snapshots (SPL Assistant, F8) shows more accurate results.\n* In Remote Studio, NVDA will no longer do nothing or play error tones when announcing current and next track titles and is configured to announce track player information.\n* In Remote Studio, when closing options screen (Control+O) while cart explorer is active, it is no longer necessary to reenter Cart Explorer to view updated cart assignments.\n* Resolved several issues while using insert tracks dialog in Remote Studio, including NVDA saying \"scan start\" when pressing Control+Shift+R and verbose output for search results status.\n* In Creator, Remote VT, and Track Tool, status bar content will be reported when performing read status bar command (NVDA+End/desktop layout, NVDA+Shift+End/laptop layout).\n* In Creator and Remote VT, NVDA will announce search results count when searching for trakcs in insert tracks dialog.", "licenseURL": "https://www.gnu.org/licenses/gpl-2.0.html", "submissionTime": 1765974088000}