{
	"addonId": "ReminderApp",
	"displayName": "ReminderApp",
	"URL": "https://raw.githubusercontent.com/Adriano-Barbieri62/ReminderApp-Addon/main/ReminderApp-2.2.nvda-addon",
	"description": "This add-on is designed to manage reminders, appointments, anniversaries and birthdays in an original and intuitive way.\nWith ReminderApp, you will not only be able to create and organize your reminders, but you will also have a address book at hand for your contacts.\nNVDA+Shift+F1, Stop the ongoing alarm.\nNVDA+Shift+F2, Open the ReminderApp GUI, if pressed 2 times close it.\nNVDA+Shift+F3, shows a preview of the day's reminder.\nFor other instructions, you can also press Add-on Help button in Add-ons manager.",
	"sha256": "c3958d4c4afa9d6b4a0b98900489ddc5e3e771366cfcd23c8bf9f3250a8f5d22",
	"addonVersionName": "2.2",
	"addonVersionNumber": {
		"major": 2,
		"minor": 2,
		"patch": 0
	},
	"minNVDAVersion": {
		"major": 2020,
		"minor": 1,
		"patch": 0
	},
	"lastTestedVersion": {
		"major": 2025,
		"minor": 2,
		"patch": 0
	},
	"channel": "stable",
	"publisher": "Adriano Barbieri",
	"sourceURL": "https://github.com/Adriano-Barbieri62/ReminderApp-Addon",
	"license": "GPL v2",
	"homepage": "https://github.com/Adriano-Barbieri62/ReminderApp-Addon",
	"licenseURL": "https://www.gnu.org/licenses/gpl-2.0.html",
	"submissionTime": 1753635574000,
	"translations": [
		{
			"language": "ar",
			"displayName": "المُذكِّر",
			"description": "تم تصميم هذه الإضافة لإدارة التذكيرات والمواعيد والذكريات وأعياد الميلاد بطريقة أصلية وبديهية. مع ReminderApp، لن تتمكن فقط من إنشاء وتنظيم تذكيراتك، بل سيكون لديك أيضًا دفتر عناوين لجهات الاتصال الخاصة بك. NVDA+Shift+F1، لإيقاف التنبيه الجاري. NVDA+Shift+F2، لفتح واجهة ReminderApp الرسومية، وإذا تم الضغط عليها مرتين، سيتم إغلاقها. NVDA+Shift+F3، يعرض معاينة لتذكير اليوم. للحصول على تعليمات أخرى، يمكنك أيضًا الضغط على زر المساعدة للإضافات في مدير الإضافات."
		},
		{
			"language": "cs",
			"displayName": "Připomínky",
			"description": "Tento doplněk je navržen tak, aby spravoval připomínky, schůzky, výročí a narozeniny originálním a intuitivním způsobem.\\n S ReminderApp nebudete moci pouze vytvářet a organizovat své připomínky, ale budete mít také adresář pro své kontakty.\\n NVDA+Shift+F1, zastavení aktuálního alarmu.\\n NVDA+Shift+F2, otevře grafické rozhraní ReminderApp, pokud stisknete dvakrát, zavře ho.\\n NVDA+Shift+F3, zobrazuje náhled dnešní připomínky.\\n Pro další pokyny můžete také stisknout tlačítko Nápověda doplňku v manažeru doplňků."
		},
		{
			"language": "de",
			"displayName": "Erinnerungen",
			"description": "Dieses Add-on wurde entwickelt, um Erinnerungen, Termine, Jahrestage und Geburtstagswünsche auf eine originelle und intuitive Weise zu verwalten.\\n Mit ReminderApp können Sie nicht nur Ihre Erinnerungen erstellen und organisieren, sondern haben auch ein Adressbuch für Ihre Kontakte zur Hand.\\n NVDA+Shift+F1, Stoppt den laufenden Alarm.\\n NVDA+Shift+F2, Öffnet die ReminderApp-Oberfläche, bei zweimaligem Drücken wird sie geschlossen.\\n NVDA+Shift+F3, zeigt eine Vorschau der Erinnerung des Tages.\\n Für weitere Anweisungen können Sie auch die Schaltfläche \"Add-on-Hilfe\" im Add-on-Manager drücken."
		},
		{
			"language": "en",
			"displayName": "ReminderApp",
			"description": "This add-on is designed to manage reminders, appointments, anniversaries and birthdays in an original and intuitive way.\nWith ReminderApp, you will not only be able to create and organize your reminders, but you will also have a address book at hand for your contacts.\nNVDA+Shift+F1, Stop the ongoing alarm.\nNVDA+Shift+F2, Open the ReminderApp GUI, if pressed 2 times close it.\nNVDA+Shift+F3, shows a preview of the day's reminder.\nFor other instructions, you can also press Add-on Help button in Add-ons manager."
		},
		{
			"language": "es",
			"displayName": "ReminderApp",
			"description": "Este complemento está diseñado para gestionar recordatorios, citas, aniversarios y cumpleaños de manera original e intuitiva.\nCon ReminderApp, no solo podrás crear y organizar tus recordatorios, sino que también tendrás una libreta de direcciones a mano para tus contactos.\nNVDA+Shift+F1, Detener la alarma en curso.\nNVDA+Shift+F2, Abrir la interfaz gráfica de ReminderApp, si se presiona dos veces, se cerrará.\nNVDA+Shift+F3, Muestra una vista previa del recordatorio del día.\nPara más instrucciones, también puedes presionar el botón de Ayuda del complemento en el Administrador de complementos."
		},
		{
			"language": "fr",
			"displayName": "ReminderApp",
			"description": "Cette extension est conçue pour gérer les rappels, les rendez-vous, les célébrations et les anniversaires de manière originale et intuitive.\nAvec ReminderApp, vous ne pourrez pas seulement créer et organiser vos rappels, mais vous aurez également un carnet d'adresses à portée de main pour vos contacts.\nNVDA+Shift+F1, Arrêter l'alarme en cours.\nNVDA+Shift+F2, Ouvrir l'interface graphique de ReminderApp, si appuyé deux fois, la fermer.\nNVDA+Shift+F3, Affiche un aperçu du rappel du jour.\nPour d'autres instructions, vous pouvez également appuyer sur le bouton d'aide de l'extension dans le gestionnaire d'extensions."
		},
		{
			"language": "hr",
			"displayName": "Podsjetnik",
			"description": "Ovaj dodatak je dizajniran za upravljanje podsjetnicima, sastancima, godišnjicama i rođendanima na originalan i intuitivan način.\nS ReminderAppom nećete samo moći kreirati i organizirati svoje podsjetnike, već ćete imati i adresar za svoje kontakte na dohvat ruke.\nNVDA+Shift+F1, Zaustavite tekući alarm.\nNVDA+Shift+F2, Otvorite sučelje ReminderApp-a, ako ga pritisnete dva puta, zatvorite ga.\nNVDA+Shift+F3, Prikazuje pregled današnjeg podsjetnika.\nZa ostale upute, možete također pritisnuti gumb pomoći za dodatak u upravitelju dodataka."
		},
		{
			"language": "it",
			"displayName": "ReminderApp",
			"description": "Questo componente aggiuntivo è progettato per gestire i promemoria, gli appuntamenti, gli anniversari e i compleanni in modo originale e intuitivo.\nCon ReminderApp, non solo sarai in grado di creare e organizzare i tuoi promemoria, ma avrai anche a portata di mano una rubrica per i tuoi contatti.\nNVDA+Shift+F1, Ferma l'allarme in corso.\nNVDA+Shift+F2, Apre l'interfaccia grafica di ReminderApp, se premuto due volte la chiude.\nNVDA+Shift+F3, Mostra un'anteprima del promemoria del giorno.\nPer altre istruzioni, puoi anche premere il pulsante di aiuto del componente aggiuntivo nel gestore dei componenti aggiuntivi."
		},
		{
			"language": "pt_BR",
			"displayName": "Lembrete",
			"description": "Este complemento foi projetado para gerenciar lembretes, compromissos, aniversários e datas comemorativas de maneira original e intuitiva.\nCom o ReminderApp, você não apenas poderá criar e organizar seus lembretes, mas também terá um catálogo de contatos à mão.\nNVDA+Shift+F1, Parar o alarme em andamento.\nNVDA+Shift+F2, Abrir a interface gráfica do ReminderApp, se pressionado duas vezes, fechá-la.\nNVDA+Shift+F3, exibe uma prévia do lembrete do dia.\nPara outras instruções, você também pode pressionar o botão de Ajuda do complemento no Gerenciador de Complementos."
		},
		{
			"language": "pt_PT",
			"displayName": "Lembrete",
			"description": "Este complemento foi projetado para gerenciar lembretes, compromissos, aniversários e datas comemorativas de maneira original e intuitiva.\nCom o ReminderApp, você não apenas poderá criar e organizar seus lembretes, mas também terá um catálogo de contatos à mão.\nNVDA+Shift+F1, Parar o alarme em andamento.\nNVDA+Shift+F2, Abrir a interface gráfica do ReminderApp, se pressionado duas vezes, fechá-la.\nNVDA+Shift+F3, exibe uma prévia do lembrete do dia.\nPara outras instruções, você também pode pressionar o botão de Ajuda do complemento no Gerenciador de Complementos."
		},
		{
			"language": "ro",
			"displayName": "ReminderApp",
			"description": "Acest addon este conceput pentru a gestiona notificările, programările, aniversările și zilele de naștere într-un mod original și intuitiv.\nCu ReminderApp, nu doar că vei putea crea și organiza notificările, dar vei avea și o agendă la îndemână pentru contactele tale.\nNVDA+Shift+F1, Oprește alarma în curs.\nNVDA+Shift+F2, Deschide interfața grafică ReminderApp, dacă este apăsat de două ori, se va închide.\nNVDA+Shift+F3, afișează o previzualizare a notificării zilei.\nPentru alte instrucțiuni, poți apăsa și butonul Ajutor addon în Managerul de Addonuri."
		},
		{
			"language": "ru",
			"displayName": "Reminder App",
			"description": "Это дополнение предназначено для управления напоминаниями, встречами, юбилеями и днями рождения в оригинальной и интуитивно понятной форме.\nС ReminderApp вы не только сможете создавать и организовывать свои напоминания, но также получите доступ к адресной книге для ваших контактов.\nNVDA+Shift+F1 — Остановить текущий сигнал.\nNVDA+Shift+F2 — Открыть графический интерфейс ReminderApp; если нажать дважды — закрыть его.\nNVDA+Shift+F3 — Показать предварительный просмотр напоминаний на текущий день.\nДля получения дополнительных инструкций вы также можете нажать кнопку \"Справка по дополнению\" в менеджере дополнений."
		},
		{
			"language": "sk",
			"displayName": "Pripomienky",
			"description": "Tento doplnok je navrhnutý na správu pripomienok, schôdzok, výročných dátumov a narodenín originálnym a intuitívnym spôsobom.\nS aplikáciou ReminderApp nebudete môcť len vytvárať a organizovať svoje pripomienky, ale budete mať aj adresár kontaktov po ruke.\nNVDA+Shift+F1, zastaviť prebiehajúci alarm.\nNVDA+Shift+F2, otvoriť grafické rozhranie ReminderApp, ak ho stlačíte dvakrát, zavrie sa.\nNVDA+Shift+F3, zobrazí náhľad pripomienky na daný deň.\nPre ďalšie pokyny môžete tiež stlačiť tlačidlo Pomocník doplnku v Správcovi doplnkov."
		},
		{
			"language": "tr",
			"displayName": "Hatırlatıcı",
			"description": "Bu eklenti, hatırlatıcıları, randevuları, yıldönümlerini ve doğum günlerini özgün ve sezgisel bir şekilde yönetmek için tasarlanmıştır.\nReminderApp ile sadece hatırlatıcılarınızı oluşturup düzenlemekle kalmayacak, aynı zamanda kişilerinize ait bir adres defteriniz de olacak.\nNVDA+Shift+F1, devam eden alarmı durdurur.\nNVDA+Shift+F2, ReminderApp GUI'yi açar, iki kez basıldığında kapatılır.\nNVDA+Shift+F3, günün hatırlatıcısının önizlemesini gösterir.\nDiğer talimatlar için, ayrıca Eklenti Yöneticisi'ndeki Eklenti Yardım butonuna basabilirsiniz."
		},
		{
			"language": "uk",
			"displayName": "Додаток для нагадування",
			"description": "Цей додаток призначений для керування нагадуваннями, зустрічами, річницями та днями народження в оригінальний і зручний спосіб.\nЗа допомогою ReminderApp ви зможете не лише створювати й організовувати свої нагадування, але й мати під рукою адресну книгу для своїх контактів.\nNVDA+Shift+F1 — Зупинити поточне нагадування.\nNVDA+Shift+F2 — Відкрити графічний інтерфейс ReminderApp, при повторному натисканні — закрити його.\nNVDA+Shift+F3 — Показати попередній перегляд нагадувань на день.\nДля інших інструкцій ви також можете натиснути кнопку Довідка про додаток у менеджері додатків."
		}
	]
}