{
	"addonId": "enhancedTouchGestures",
	"displayName": "Enhanced Touch Gestures",
	"URL": "https://github.com/kefaslungu/enhancedTouchGestures/releases/download/25.06/enhancedTouchGestures-25.06.nvda-addon",
	"description": "A suite of additional touch commands, including navigation and help commands.\n\tRequires a touch-enabled computer with Windows 8.1 or later with NVDA 2017.4 or later installed.",
	"sha256": "95ad115e23983e900c996522b875158f55e467b97764cbc1c2507baa564afc67",
	"addonVersionName": "25.06",
	"addonVersionNumber": {
		"major": 25,
		"minor": 6,
		"patch": 0
	},
	"minNVDAVersion": {
		"major": 2024,
		"minor": 1,
		"patch": 0
	},
	"lastTestedVersion": {
		"major": 2025,
		"minor": 1,
		"patch": 0
	},
	"channel": "stable",
	"publisher": "josephsl",
	"sourceURL": "https://github.com/kefaslungu/enhancedTouchGestures",
	"license": "GPL v2",
	"homepage": "https://github.com/kefaslungu/enhancedTouchGestures/blob/main/readme.md",
	"licenseURL": "https://www.gnu.org/licenses/gpl-2.0.html",
	"submissionTime": 1749530577000,
	"translations": [
		{
			"language": "bg",
			"displayName": "Подобрени сензорни жестове (Enhanced Touch Gestures)",
			"description": "Комплект допълнителни сензорни команди, включително команди за табулация и помощ.\n\tИзисква компютър със сензорна поддръжка с Windows 8.1 или по-нова версия и NVDA 2017.4 или по-нова версия."
		},
		{
			"language": "da",
			"displayName": "Udvidede berøringsfunktioner",
			"description": "Et sæt af yderligere touch-kommandoer, herunder tabbe- og hjælpekommandoer.\n\tKræver en computer med touch-understøttelse med Windows 8.0 eller senere og med NVDA 2017.4 eller senere installeret."
		},
		{
			"language": "de",
			"displayName": "Erweiterte Berührungsgesten",
			"description": "Eine Reihe zusätzlicher Touch-Befehle, einschließlich Navigations- und Hilfe-Befehle.\n\tBenötigt einen Computer mit einem berührungsempfindlichen  Bildschirm mit Windows 8.0 oder höher. NVDA 2012.4 oder höher muss installiert sein."
		},
		{
			"language": "de_CH",
			"displayName": "Erweiterte Touch-gesten",
			"description": "Eine Reihe zusätzlicher Touch-Befehle, einschliesslich Navigations- und Hilfe-Befehle.\n\tBenötigt einen Computer mit einem berührungsempfindlichen  Bildschirm mit Windows 8.0 oder höher. NVDA 2012.4 oder höher muss installiert sein."
		},
		{
			"language": "es",
			"displayName": "Enhanced Touch Gestures",
			"description": "Una suite de órdenes táctiles adicionales, incluyendo órdenes de tabulación y de ayuda.\n\tRequieren de un ordenador táctil habilitado con Windows 8.1 o posterior con NVDA 2017.4 o posterior instalado."
		},
		{
			"language": "fa",
			"displayName": "فرمان‌های لمسیِ پیشرفته",
			"description": "مجموعه‌ای از فرمان‌های لمسیِ اضافی، مشتمل بر فرمان‌های حرکتی و راهنما.\n\tنیازمندِ یک رایانه‌ی مجهز به صفحه‌ی لمسی، با ویندوز ۸.۱ و بالاتر، و NVDA نگارش ۲۰۱۷.۴ و بالاتر است."
		},
		{
			"language": "fi",
			"displayName": "Laajennetut kosketuseleet",
			"description": "Kokoelma lisäkomentoja kosketusnäytön käyttämiseen, siirtyminen ja ohjekomennot mukaan lukien.\n\tVaatii kosketusnäytöllisen tietokoneen, jossa on asennettuna Windows 8.1 tai uudempi sekä NVDA 2017.4 tai uudempi."
		},
		{
			"language": "fr",
			"displayName": "Enhanced Touch Gestures",
			"description": "Une suite de commandes tactiles supplémentaires, y compris des commandes de navigation et d'aide.\n\tNécessite un ordinateur tactile avec Windows 8.0 ou version ultérieure avec NVDA 2017.4 ou version ultérieure installé."
		},
		{
			"language": "gl",
			"displayName": "Enhanced Touch Gestures",
			"description": "Unha suite de ordes tactiles adicionais, incluindo ordes de tabulación e de axuda.\n\tRequiren dun computador tactil habilitado co Windows 8.1 ou posterior co NVDA 2017.4 ou posterior instalado."
		},
		{
			"language": "he",
			"displayName": "מחוות מגע משופרות",
			"description": "חבילה של פקודות מגע נוספות, כולל טאבים פקודות עזרה.\n\tנדרש מחשב עם אינטרקאציה במגע עם Windows 8.0 ואילך ועם NVDA 2012.3 ואילך."
		},
		{
			"language": "hr",
			"displayName": "Dodatne dodirne geste",
			"description": "Paket dodatnih naredbi za dodire, uključujući naredbe za kretanje i za pomoć.\n\tPotrebno je računalo koje omogućuje rad dodirom i na kojem je instaliran sustav Windows 8.1 ili noviji i NVDA 2017.4 ili noviji."
		},
		{
			"language": "it",
			"displayName": "Enhanced Touch Gestures",
			"description": "Un insieme di comandi touch aggiuntivi, comprendenti comandi per la navigazione e l'aiuto.\n\tRichiede un computer configurato con un touch screen, sistema operativo Windows 8.1 o successivo e NVDA 2017.4 o versioni successive."
		},
		{
			"language": "pl",
			"displayName": "Enhanced Touch Gestures",
			"description": "Jest to zestaw dodatkowych komend dotykowych, takich jak komendy nawigacji i pomocy.\n\tWymaga włączonego interfejsu dotykowego, systemu Windows 8.0 lub nowszego oraz NVDA 2012.3 lub nowszego."
		},
		{
			"language": "pt_BR",
			"displayName": "Gestos Táteis Aprimorados",
			"description": "Um conjunto de comandos de toque adicionais, incluindo comandos de navegação e ajuda.\n\tRequer um computador habilitado para toque com o Windows 8.1 ou posterior com o NVDA 2017.4 ou posterior instalado."
		},
		{
			"language": "pt_PT",
			"displayName": "Gestos de toque aprimorados",
			"description": "Um conjunto de comandos adicionais de toque, incluindo comandos de tabulação e ajuda.\nRequer um computador preparado para toque, com o Windows 8.1 ou posterior,  que tenha o NVDA 2017.4 ou posterior instalado."
		},
		{
			"language": "ro",
			"displayName": "Enhanced Touch Gestures",
			"description": "O suită de comenzi tactile adiționale, incluzând comenzile de navigare și de ajutor.\n\tNecesită un computer cu funcția touch activată, cu Windows 8.1 sau mai nou și cu NVDA 2017.4 sau mai nou instalat."
		},
		{
			"language": "ru",
			"displayName": "Улучшенные сенсорные жесты",
			"description": "Набор дополнительных сенсорных команд, включая команды навигации и справки.\n\tТребуется компьютер с поддержкой сенсорного  взаимодействия под управлением Windows 8.1 или выше с установленной NVDA 2017.4 или выше."
		},
		{
			"language": "sk",
			"displayName": "Pokročilé dotykové gestá",
			"description": "Sada ďalších dotykových príkazov, vrátane navigačných a pomocných príkazov\n\tVyžaduje počítač s dotykovou obrazovkou so systémom Windows od verzie 8.1 s nainštalovaným programom NVDA od verzie 2017.4."
		},
		{
			"language": "sl",
			"displayName": "Napredne Dotikabilne Kretnje",
			"description": "Skupek dodatnih dotikabilnih ukazov, vključno z ukazi za krmiljenje in pomoč.\n\tPotreben je računalnik z omogočeno interakcijo z dotiki z Windows 8.1 ali kasnejšimi z NVDA 2017.4 ali kasnejšo nameščeno."
		},
		{
			"language": "sr",
			"displayName": "Enhanced Touch Gestures",
			"description": "Dodatne komande za ekran osetljiv na dodir, uključujući komande za navigaciju i pomoć.\n\tZahteva računar sa ekranom osetljivim na dodir i Windows 8.1 ili noviji sa programom NVDA 2017.4 ili novijim instaliranim."
		},
		{
			"language": "tr",
			"displayName": "Gelişmiş Dokunma Hareketleri",
			"description": "navigasyon ve yardım komutları da dahil olmak üzere, ek dokunmatik komutlardan oluşan bir paket.\n\tNVDA 2017.4 ya da sonraki sürümlerinden birinin kurulu olduğu, dokunmatik ekranlı ve en az Windows 8.1 yüklü bir bilgisayar gerektirir."
		},
		{
			"language": "uk",
			"displayName": "Розширення сенсорних жестів",
			"description": "Набір додаткових жестових команд, включно з командами навігації й довідки.\n\tВимагає комп’ютера з увімкненим сенсорним екраном на Windows 8.1 або пізнішою з встановленою NVDA 2017.4 або пізнішою."
		},
		{
			"language": "zh_CN",
			"displayName": "触摸屏手势增强",
			"description": "一套附加的触摸手势，涵盖了导航和帮助命令。\n需要安装了 NVDA 2017.4 或更高版本， Windows 8.1 或更高版本且带有触摸屏的电脑。"
		}
	]
}
