{
	"displayName": "Report Symbols",
	"publisher": "nvdaes",
	"description": "Allows to listen the typed symbols (non alphanumeric or blank characters), even when the speaking of characters is turned off.",
	"homepage": "https://github.com/nvdaes/reportSymbols",
	"addonId": "reportSymbols",
	"addonVersionName": "6.4",
	"addonVersionNumber": {
		"major": 6,
		"minor": 4,
		"patch": 0
	},
	"minNVDAVersion": {
		"major": 2019,
		"minor": 3,
		"patch": 0
	},
	"lastTestedVersion": {
		"major": 2021,
		"minor": 3,
		"patch": 1
	},
	"channel": "stable",
	"URL": "https://github.com/nvdaes/reportSymbols/releases/download/6.4/reportSymbols-6.4.nvda-addon",
	"sha256": "8318fa720855e565377737388317fe02727a6a162694b1ac87cd1d701f9e728d",
	"sourceURL": "https://github.com/nvdaes/reportSymbols/",
	"license": "GPL v2",
	"licenseURL": "https://www.gnu.org/licenses/old-licenses/gpl-2.0.html",
	"translations": [
		{
			"language": "bg",
			"displayName": "Съобщаване на символите",
			"description": "Позволява да прослушвате въвежданите символи (не буквено-цифровите или празните знаци), дори когато опцията \"Изговаряй въведените букви или знаци\" е изключена."
		},
		{
			"language": "da",
			"displayName": "Oplæs symboler",
			"description": "Giver dig mulighed for at høre de ikke-alfa-numeriske tegn, du skriver, selv hvis oplæsning af tegn er slået fra."
		},
		{
			"language": "de",
			"displayName": "Symbol-Ansagen",
			"description": "Ermöglicht das Anhören der getippten Symbole (keine alphanumerische Zeichen oder Leerzeichen), auch wenn das Sprechen von Zeichen ausgeschaltet ist."
		},
		{
			"language": "de_CH",
			"displayName": "Symbol-Ansagen",
			"description": "Ermöglicht das Anhören der getippten Symbole (keine alphanumerische Zeichen oder Leerzeichen), auch wenn das Sprechen von Zeichen ausgeschaltet ist."
		},
		{
			"language": "es",
			"displayName": "Report Symbols",
			"description": "Permite escuchar los símbolos tecleados (caracteres no alfanuméricos o en blanco), incluso cuando la verbalización de caracteres esté desactivada."
		},
		{
			"language": "fa",
			"displayName": "اعلامِ نمادها",
			"description": "امکانِ شنیدنِ نمادهای تایپ‌شده (نمادهای غیر الفبا‌عددی و نمادهای خالی) را، حتی در صورتی که خواندنِ نویسه‌ها غیرفعال باشد فراهم میکند."
		},
		{
			"language": "fi",
			"displayName": "Puhu symbolit",
			"description": "Mahdollistaa kirjoitettujen symbolien (ei-aakkosnumeeristen ja tyhjämerkkien) kuulemisen, vaikka merkkien puhuminen on poistettu käytöstä."
		},
		{
			"language": "fr",
			"displayName": "Report Symbols",
			"description": "Permet d'entendre les symboles écrits (caractères non alphanumériques ou blancs), même si la verbalisation des caractères écrits est désactivée."
		},
		{
			"language": "gl",
			"displayName": "Report Symbols",
			"description": "Permite escoitar os símbolos tecleados (carácteres non alfanuméricos ou en branco), incluso cando a fala de carácteres estea desactivada."
		},
		{
			"language": "he",
			"displayName": "דיווח סמלים",
			"description": "מאפשר להאזין לסמלים שהוקלדו (לא תווים אלפאנומריים), גם כאשר הדיבור על תווים כבוי."
		},
		{
			"language": "hr",
			"displayName": "Javi znakove",
			"description": "Omogućuje slušanje utipkanih znakova (nealfanumeričkih znakova ili praznih znakova), čak i kad je izgovaranje utipkanih znakova isključeno."
		},
		{
			"language": "hu",
			"displayName": "Karakterbejelentő",
			"description": "A beírt karakterek meghallgatása (nem alfanumerikus, vagy üres karakterek), akkor is, ha a karakterek bemondása ki van kapcsolva."
		},
		{
			"language": "it",
			"displayName": "Leggi simboli",
			"description": "Consente di ascoltare i simboli digitati (caratteri non alfanumerici), anche quando la lettura caratteri digitati è disattivata."
		},
		{
			"language": "lt",
			"displayName": "Report Symbols",
			"description": "Leidžia išklausyti parašytus simbolius (ne raidinius ir ne skaitinius arba tuščius rašmenis), net jeigu ir išjungtas įvedamų simbolių tarimas."
		},
		{
			"language": "pl",
			"displayName": "Report Symbols",
			"description": "Wymawia wpisywane znaki (niealfanumeryczne lub puste), nawet wtedy, kiedy echo znaków jest wyłączone."
		},
		{
			"language": "pt_BR",
			"displayName": "Informar Símbolos",
			"description": "Permite ouvir os símbolos digitados (caracteres não alfanuméricos ou invisíveis/em branco), mesmo quando a fala de caracteres está desativada."
		},
		{
			"language": "pt_PT",
			"displayName": "Anunciar símbolos",
			"description": "Permite ouvir os símbolos digitados (caracteres não alfanuméricos ou invisíveis), mesmo quando  a opção \"Anunciar caracteres\" está desactivada."
		},
		{
			"language": "ro",
			"displayName": "Report Symbols",
			"description": "Îți permite să asculți simbolurile scrise (caracterele non-alphanumerice), chiar dacă citirea caracterelor este dezactivată."
		},
		{
			"language": "ru",
			"displayName": "Report Symbols",
			"description": "Позволяет прослушивать набранные символы (не буквенно-цифровые или пустые символы), даже если произношение символов отключено."
		},
		{
			"language": "sk",
			"displayName": "Čítať napísané symboly",
			"description": "Umožňuje oznamovať napísané znaky (medzeri a prázdne riadky) aj v prípade, ak je vypnuté čítanie napísaných znakov."
		},
		{
			"language": "sl",
			"displayName": "Sporočanje Simbolov",
			"description": "Dovoljuje poslušati natipkane simbole (nealfanumerične ali prazne znake) tudi, ko je pripovedovanje znakov izključeno."
		},
		{
			"language": "sr",
			"displayName": "Prijavljivanje simbola",
			"description": "Dozvoljava slušanje ukucanih simbola(znakovi koji nisu alfanumerički), čak i kada je izgovor ukucanih znakova isključen."
		},
		{
			"language": "tr",
			"displayName": "Sembolleri Bildir",
			"description": "Karakterlerin konuşması kapalı olsa bile, yazılan sembollerin (alfanumerik olmayan veya boş karakterler) dinlenmesini sağlar."
		},
		{
			"language": "zh_CN",
			"displayName": "朗读符号",
			"description": "此插件允许听取输入的符号包括（非字母数字的字符），即使关闭了NVDA的输入字符朗读."
		}
	]
}