{
	"addonId": "NativeSpeechGeneration",
	"displayName": "NativeSpeechGeneration",
	"URL": "https://github.com/MuhammadGagah/native-speech-generation/releases/download/v1.1/NativeSpeechGeneration-1.1.nvda-addon",
	"description": "Harness the power of Google's state-of-the-art Gemini AI for high-quality speech generation directly within NVDA. This add-on provides a user-friendly dialog to convert text into natural-sounding audio.\n\nKey Features:\n- High-Quality Voices: Choose between Gemini Pro for premium, life-like speech and Gemini Flash for standard quality, responsive generation.\n- Single and Multi-Speaker Modes: Easily generate audio for a single speaker or create dynamic dialogues with two distinct speakers. Simply format your text with \"SpeakerName:\" to assign voices.\n- Advanced Voice Control: Fine-tune the output by adjusting the temperature for more creative or stable results, and provide custom style instructions.\n- Accessible Interface: All controls are fully accessible, including a collapsible panel for advanced settings to keep the interface clean and easy to navigate.\n- Seamless Workflow: The add-on provides instant audio playback upon generation and allows you to save the resulting .wav file for later use.\n\nTo get started, obtain a Gemini API key from Google AI Studio and enter it in the add-on's settings panel, found under NVDA's Tools menu.",
	"sha256": "d9ebda30d6723e9f1691628939d0d2d7c93afd8a7d619271c6404dc7977721ee",
	"addonVersionName": "1.1",
	"addonVersionNumber": {
		"major": 1,
		"minor": 1,
		"patch": 0
	},
	"minNVDAVersion": {
		"major": 2023,
		"minor": 1,
		"patch": 0
	},
	"lastTestedVersion": {
		"major": 2025,
		"minor": 2,
		"patch": 0
	},
	"channel": "stable",
	"publisher": "Muhammad",
	"sourceURL": "https://github.com/MuhammadGagah/native-speech-generation/",
	"license": "GPL v2",
	"homepage": "https://github.com/MuhammadGagah/native-speech-generation/",
	"licenseURL": "https://www.gnu.org/licenses/gpl-2.0.html",
	"submissionTime": 1757318719000,
	"translations": [
		{
			"language": "id",
			"displayName": "NativeSpeechGeneration",
			"description": "Manfaatkan kekuatan AI Gemini canggih dari Google untuk menghasilkan suara berkualitas tinggi langsung di dalam NVDA.\nAdd-on ini menyediakan dialog yang ramah pengguna untuk mengubah teks menjadi audio yang terdengar alami.\n\nFitur Utama:\n- Suara Berkualitas Tinggi: Pilih antara Gemini Pro untuk suara premium yang mirip dengan kehidupan nyata dan Gemini Flash untuk kualitas standar yang responsif.\n\n- Mode Satu dan Multi-Pembicara: Dengan mudah hasilkan audio untuk satu pembicara atau buat dialog dinamis dengan dua pembicara yang berbeda. Cukup format teks Anda dengan \"NamaPembicara:\" untuk menetapkan suara.\n\n- Kontrol Suara Lanjutan: Sesuaikan output dengan mengatur temperature untuk hasil yang lebih kreatif atau stabil, dan berikan instruksi gaya pembicara sesuai keinginan.\n\n- Antarmuka yang Dapat Diakses: Semua kontrol sepenuhnya dapat diakses, termasuk panel yang dapat diciutkan untuk pengaturan lanjutan agar antarmuka tetap bersih dan mudah dinavigasi.\n\n- Alur Kerja yang Lancar: Add-on ini menyediakan pemutaran audio instan setelah pembuatan dan memungkinkan Anda menyimpan file .wav yang dihasilkan untuk digunakan nanti.\nUntuk memulai, dapatkan kunci API Gemini dari Google AI Studio dan masukkan ke dalam panel pengaturan add-on, yang dapat ditemukan di menu Alat NVDA."
		}
	]
}