{
  "addonId": "searchWith",
  "displayName": "Search With",
  "URL": "https://github.com/ibrahim-s/searchWith/releases/download/2.5.8/searchWith-2.5.8.nvda-addon",
  "description": "This addon helps you to search text, via various search engines.\nLet no text selected, and press the gesture of the addon\nA dialog will be displayed, with an edit box to enter a search query\nTo search with Google press enter, or tab to search with other engins.\nOr\nselect some text and press once, a menu will be displayed with various search engines to choose from.\nAnd while text is selected, you can press the gesture twice to search with Google directly.\nThe Default gesture for the addon is: NVDA+ Windows+ S.",
  "sha256": "4ebebab13b9e1833ded9ba3ee679a642050902b05282ce6d9f223e4fb6b92968",
  "addonVersionName": "2.5.8",
  "addonVersionNumber": {
    "major": 2,
    "minor": 5,
    "patch": 8
  },
  "minNVDAVersion": {
    "major": 2019,
    "minor": 3,
    "patch": 0
  },
  "lastTestedVersion": {
    "major": 2024,
    "minor": 1,
    "patch": 0
  },
  "channel": "beta",
  "publisher": "Ibrahim Hamadeh",
  "sourceURL": "https://github.com/ibrahim-s/searchWith",
  "license": "GPL v2",
  "homepage": "https://github.com/ibrahim-s/searchWith/blob/master/readme.md",
  "licenseURL": "https://www.gnu.org/licenses/gpl-2.0.html",
  "translations": [
    {
      "language": "ar",
      "displayName": "البحث باستخدام Search With",
      "description": "تساعدُك هذه الإضافة في البحث عن نص عبر محرّكات بحثٍ عديدة.\u000bتأكد مِن أنهُ ليس هناك نص مُحدد, و اضغط اختصار الإضافة\u000bستظهر مُحاوَرة, مع مربع بحث لإدخال مُصطلح البحث\u000bإذا أردتَ البحث في جوجل إضغط إنتر, أو تحرك بالتاب لاختيار مُحركات بحث أُخرى.\u000bأو\u000bحدِّد نص معين و اضغط مرة واحدة, و سيتم عرض قائمة مع العديد مِن محركات البحث للإختيار مِن بينِها.\u000bو في حالةْ وجود نص مُحدد, يُمكنك الضغط مرتين للبحث في جوجل مباشرة.\u000bالإختصار الإفتراضي للإضافة هو: NVDA+Windows+S."
    },
    {
      "language": "bg",
      "displayName": "Търсене с",
      "description": "Тази добавка ви помага да търсите текст чрез различни търсачки.\nКогато няма маркиран текст и задействате жеста на добавката.\nЩе се покаже диалогов прозорец с текстово поле за въвеждане на заявка за търсене.\nЗа да търсите с Google, натиснете Enter или натиснете TAB, за да търсите с други търсачки.\nили\nМаркирайте текст и натиснете командата веднъж – ще се изведе меню с различни търсачки, от които да избирате.\nКогато има маркиран текст, можете да задействате жеста двукратно, за да търсите директно с Google.\nЖестът по подразбиране за добавката е: NVDA+Windows+S."
    },
    {
      "language": "de",
      "displayName": "Suchen Mit",
      "description": "Diese Erweiterung hilft Ihnen bei der Suche nach Text, über verschiedene Suchmaschinen.\nLassen Sie keinen Text ausgewählt und drücken Sie den Tastenbefehl der Erweiterung.\nEs wird ein Dialog mit einem Eingabefeld angezeigt, in das Sie eine Suchanfrage eingeben können.\nUm mit Google zu suchen, drücken Sie Enter, oder Tab, um mit anderen Suchmaschinen zu suchen.\nOder:\nWählen Sie einen Text aus und drücken Sie einmal, dann wird ein Menü mit verschiedenen Suchmaschinen angezeigt, aus denen Sie wählen können.\nUnd während der Text ausgewählt ist, können Sie den Tastenbefehl zweimal drücken, um direkt mit Google zu suchen.\nDer Standard-Tastenbefehl für die Erweiterung lautet: NVDA+Windows+S."
    },
    {
      "language": "en",
      "displayName": "Search With",
      "description": "This addon helps you to search text, via various search engines.\nLet no text selected, and press the gesture of the addon\nA dialog will be displayed, with an edit box to enter a search query\nTo search with Google press enter, or tab to search with other engins.\nOr\nselect some text and press once, a menu will be displayed with various search engines to choose from.\nAnd while text is selected, you can press the gesture twice to search with Google directly.\nThe Default gesture for the addon is: NVDA+ Windows+ S."
    },
    {
      "language": "es",
      "displayName": "Search With",
      "description": "Este complemento te permite buscar texto mediante diversos motores de búsqueda.\nSin texto seleccionado, al pulsar el gesto del complemento,\nse mostrará un cuadro de diálogo para introducir una consulta de búsqueda.\nPulsa intro para buscar con Google, o tabula para elegir otros motores.\nO\nSelecciona algo de texto y pulsa el gesto una vez, y se mostrará un menú con varios motores de búsqueda para elegir.\nMientras el texto esté seleccionado, puedes pulsar dos veces el gesto para buscar directamente con Google.\nEl gesto por defecto del complemento es NVDA+windows+s."
    },
    {
      "language": "fi",
      "displayName": "Hae hakukoneella",
      "description": "Tämän lisäosan avulla voit hakea tietoa eri hakukoneilla.\nJos tekstiä ei ole valittuna, paina määritettyä lisäosan näppäinkomentoa.\nHakukentän sisältävä valintaikkuna näytetään, johon voidaan kirjoittaa haluttu hakukysely\nHae Googlella painamalla Enteriä tai Sarkainta käyttääksesi muita hakukoneita.\nVaihtoehtoisesti:\nValitse tekstiä ja paina näppäinkomentoa kerran, jolloin avautuu valikko, josta voit valita haluamasi hakukoneen.\nKun tekstiä on valittuna, voit hakea suoraan Googlella painamalla näppäinkomentoa kahdesti.\nLisäosan oletusarvoinen näppäinkomento on NVDA+Win+S."
    },
    {
      "language": "fr",
      "displayName": "Search With",
      "description": "Cette extension vous aide à rechercher du texte, via divers moteurs de recherche.\nAvec aucun texte sélectionné, appuyez sur le geste de l'addon\nUne boîte de dialogue s'affiche, avec une zone d'édition pour entrer une requête de recherche\nPour effectuer une recherche avec Google, appuyez sur Entrée ou sur la touche de tabulation pour effectuer une recherche avec d'autres moteurs.\nOu\nsélectionnez du texte et appuyez une fois, un menu s'affichera avec différents moteurs de recherche parmi lesquels choisir.\nEt lorsque le texte est sélectionné, vous pouvez appuyer deux fois sur le geste pour rechercher directement avec Google.\nLe geste par défaut pour l'extension est : NVDA+ Windows+ S."
    },
    {
      "language": "gl",
      "displayName": "Search With",
      "description": "Este complemento axúdache a buscar texto, a través de varios motores de procura.\nNon selecciones texto, e preme o xestos do complemento\nAmosarase un diálogo, cunha caixa de edición para introducir unha procura\nPara procurar con Google preme intro, ou tab para buscar con outros motores.\nOu\nselecciona algún texto e preme unha vez, amosarase un menú con varios motores de procura entre os que escoller.\nE mentres estea seleccionado texto, podes premer o xesto dúas veces para procurar con Google directamente.\nO xesto por defecto para o complemento é: NVDA+ Windows+ S."
    },
    {
      "language": "hr",
      "displayName": "Traži pomoću",
      "description": "Ovaj dodatak pomaže u pretraživanju teksta putem raznih tražilica.\nNemoj odabrati nikoji tekst i pritisni gestu dodatka\nPrikazat će se dijaloški okvir s okvirom za uređivanje za unos upita za pretraživanje\nZa pretraživanje pomoću Googlea pritisni tipku enter ili tabulator za pretraživanje s drugim tražilicama.\nIli\nodaberi neki tekst i pritisni jednom. Prikazat će se izbornik s raznim tražilicama koje možeš izabrati.\nKad je tekst odabran, možeš dvaput pritisnuti gestu za izravno pretraživanje s Googleom.\nStandardna gesta za dodatak je: NVDA+ Windows+ S."
    },
    {
      "language": "it",
      "displayName": "Cerca con",
      "description": "Questo addon ti aiuta a cercare il testo, tramite vari motori di ricerca.\nNon selezionare alcun testo e premi la combinazione di tasti dell'addon, quella predefinita è NVDA+ Windows+ S\nVerrà visualizzata una finestra di dialogo, con una casella di modifica per inserire una query di ricerca\nPer cercare con Google premi invio, oppure usa tab per cercare con altri motori.\nOppure\nseleziona del testo e premi la combinazione una volta, verrà visualizzato un menu con vari motori di ricerca tra cui scegliere.\nE mentre il testo è selezionato, puoi premere la combinazione due volte per cercare direttamente con Google.\nIl gesto predefinito per l'addon è: NVDA+ Windows+ S."
    },
    {
      "language": "pl",
      "displayName": "Search With",
      "description": "Ten dodatek pomaga w wyszukiwaniu tekstu za pomocą różniych wyszukiwarek.\nUpewnij się że tekst nie jest zaznaczony i naciśnij skrót dodatku.\nZostanie wyświetlone okno dialogowe z polem do edycji służące do wpisania zapytania wyszukiwania\nAby rozpocząć wyszukiwanie używając wyszukiwarki google, naciśnij enter, lub naciśnij klawisz tab, aby wybrać inną wyszukiwarkę.\nLub\nZaznacz jakikolwiek tekst i naciśnij jeden raz skrót dodatku, potem zostanie wyświetlone menu z wyborem różnych wyszukiwarek dostępnych do wyboru.\nGdy tekst jest zaznaczony,, możesz nacisnąć skrót dwukrotnie aby wyszukiwać bezpośrednio za pomocą Googlea.\nDomyślny skrót dodatku to NVDA+ Windows+ S."
    },
    {
      "language": "pt_BR",
      "displayName": "Procurar com",
      "description": "This addon helps you to search text, via various search engines.\nLet no text selected, and press the gesture of the addon\nA dialog will be displayed, with an edit box to enter a search query\nTo search with Google press enter, or tab to search with other engins.\nOr\nselect some text and press once, a menu will be displayed with various search engines to choose from.\nAnd while text is selected, you can press the gesture twice to search with Google directly.\nThe Default gesture for the addon is: NVDA+ Windows+ S."
    },
    {
      "language": "pt_PT",
      "displayName": "Procurar com",
      "description": "Este extra ajuda-o a pesquisar texto, através de vários motores de busca.\nSem qualquer texto seleccionado, prima o atalho do addon\nSerá mostrado um diálogo, com uma caixa de edição, para introduzir os termos a pesquisar\nPara pesquisar com o Google prima \"enter\", ou \"tab\", para pesquisar com outros motores de busca.\nOu\nseleccione algum texto e pressione o atalho uma vez, será apresentado um menu com vários motores de busca à escolha.\nE, depois do texto seleccionado, pode pressionar duas vezes o atalho, para pesquisar directamente com o Google.\nO atalho padrão para o addon é: NVDA+ Windows+ S."
    },
    {
      "language": "ro",
      "displayName": "Search With",
      "description": "Acest supliment vă ajută să căutați text prin intermediul diverselor motoare de căutare.\nNu lăsați niciun text selectat și apăsați combinația de taste (gestul) suplimentului\nVa fi afișată o fereastră de dialog ce va conține o casetă de editare în care să introduceți o interogare de căutare\nApăsați tasta enter pentru a căuta cu Google sau tasta tab pentru a utiliza alte motoare de căutare.\nSau\nSelectați un text, apăsați o dată și se va deschide un meniu cu o gamă variată de motoare de căutare din care să alegeți.\nCât timp este selectat text, puteți apăsa cscurtătura de taste de două ori pentru a căuta direct cu Google.\nGestul implicit al suplimentului este: NVDA+ Windows+ S."
    },
    {
      "language": "ru",
      "displayName": "Search With",
      "description": "This addon helps you to search text, via various search engines.\nLet no text selected, and press the gesture of the addon\nA dialog will be displayed, with an edit box to enter a search query\nTo search with Google press enter, or tab to search with other engins.\nOr\nselect some text and press once, a menu will be displayed with various search engines to choose from.\nAnd while text is selected, you can press the gesture twice to search with Google directly.\nThe Default gesture for the addon is: NVDA+ Windows+ S."
    },
    {
      "language": "sr",
      "displayName": "Pretraži",
      "description": "Ovaj dodatak vam pomaže da pretražite tekst, putem različitih pretraživača.\nAko tekst nije izabran, pritisnite prečicu dodatka\nDijalog će biti prikazan, sa poljem za upisivanje termina pretrage\nDa pretražite Google pritisnite enter, ili tab da koristite druge pretraživače.\nili\nAko izaberete tekst i pritisnete prečicu jednom, biće prikazan meni sa izborom različitih pretraživača.\nDok je tekst izabran, možete dva puta da pritisnete prečicu kako biste direktno pretražili Google.\nPodrazumevana prečica dodatka je: NVDA+ Windows+ S."
    },
    {
      "language": "tr",
      "displayName": "İle Ara",
      "description": "Bu eklenti, çeşitli arama motorları aracılığıyla metin aramanıza yardımcı olur.\nHiç bir metin seçmeksizin eklenti kısayoluna basın\nArama sorgusu girmek için bir yazı alanı içeren iletişim kutusu açılacak\nGoogle ile arama yapmak için enter'a, diğer motorlarla arama yapmak için sekmeye basın.\nya da\nbir metin seçin ve ilgili tuşa bir kez basın, aralarından seçim yapabileceğiniz çeşitli arama motorları ile bir menü gösterilecek.\nMetin seçiliyken, doğrudan Google ile arama yapmak için tuşa iki kez basabilirsiniz.\nEklenti için Varsayılan Kısayol tuşu: NVDA+ Windows+ S."
    },
    {
      "language": "uk",
      "displayName": "Пошук за допомогою",
      "description": "Цей додаток використовується для пошуку тексту за допомогою різних пошукових систем.\nНавіть, якщо не буде виділено жодного тексту, після натискання жесту додатка\nВідкриється діалог з полем редагування для введення пошукового запиту\nДля пошуку за допомогою Google натисніть клавішу enter, а для пошуку за допомогою інших систем натисніть клавішу tab.\nАбо\nвиділіть будь-який текст і натисніть один раз, після чого з’явиться меню з можливістю вибрати різні пошукові системи.\nЩоб шукати виділений текст безпосередньо в Google, натисніть цю комбінацію двічі.\nПочатковий жест для додатка: NVDA+Windows+S."
    },
    {
      "language": "vi",
      "displayName": "tìm kiếm nhanh ",
      "description": "bổ trợ này giúp bạn tìm kiếm văn bản bằng nhiều công cụ khác nhau .\nnếu bạn chưa chọn văn bản, mà bạn nhấn phím tắt của bổ trợ n\nmột hộp thoại với một ô nhập liệu sẽ mở để bạn gõ nội dung muốn tìm kiếm \nđể tìm kiếm bằng google chỉ cần bấm enter. nếu bạn muốn sử dụng công cụ tìm kiếm khác, chỉ cần nhấn tab tới dùng công cụ khác  .\nHoặc\nbạn hãy chọn một vài văn bản. nếu bạn nhấn một lần, một menu sẽ hiện ra các công cụ tìm kiếm cho bạn chọn .\nnếu bạn nhấn nhanh 2 lần. sẽ tìm kiếm luôn với google .\nphím tắt mặc định của bổ trợ là. NVDA+ Windows+ S. ."
    },
    {
      "language": "zh_CN",
      "displayName": "快捷搜索",
      "description": "该插件可帮助您使用各种搜索引擎搜索文本。\n如果您在没有选择文本的情况下按下插件的搜索快捷键，\n会显示一个对话框，其中包含一个用于输入搜索关键词的编辑框\n直接按回车键使用 Google 搜索，或按 Tab 键选择其他引擎进行搜索。\n或者您可以\n选中想搜索的文本，按一次搜索快捷键，此时会显示一个菜单，其中包含各种搜索引擎可供选择。\n您也可以在选中想搜索的文本后，连按两次搜索快捷键直接使用 Google 进行搜索。\n插件的默认搜索快捷键是： NVDA + Windows + S。"
    }
  ],
  "reviewUrl": "https://github.com/nvaccess/addon-datastore/discussions/2142"
}
