{
	"addonId": "EnhancedFindDialog",
	"displayName": "Enhanced find dialog for NVDA",
	"URL": "https://github.com/marlon-sousa/EnhancedFindDialog/releases/download/1.6.0/EnhancedFindDialog-1.6.0.nvda-addon",
	"description": "This addon introduces improvements to the NVDA find dialog.\nIt is now possible to have your previous searches history available on a list during the NVDA session, which will enable you to quickly select and search for previous searched terms.",
	"sha256": "524909c89fbcc14879c94ada241a90d995037d053eaeabfaf2e146dcddfcdbc8",
	"addonVersionName": "1.6.0",
	"addonVersionNumber": {
		"major": 1,
		"minor": 6,
		"patch": 0
	},
	"minNVDAVersion": {
		"major": 2022,
		"minor": 1,
		"patch": 0
	},
	"lastTestedVersion": {
		"major": 2024,
		"minor": 1,
		"patch": 0
	},
	"channel": "stable",
	"publisher": "Marlon Sousa",
	"sourceURL": "https://github.com/marlon-sousa/enhancedFindDialog",
	"license": "Mit License",
	"homepage": "https://github.com/marlon-sousa/EnhancedFindDialog",
	"licenseURL": "https://github.com/marlon-sousa/EnhancedFindDialog/blob/master/LICENSE",
	"translations": [
		{
			"language": "es",
			"displayName": "Diálogo de búsqueda extendido para NVDA",
			"description": "Este complemento introduce mejoras en el diálogo de búsqueda de NVDA. \nAhora es posible acceder a los términos de búsqueda anteriores, lo que te permitirá realizar búsquedas basadas en términos anteriores de una manera mucho más eficiente"
		},
		{
			"language": "fi",
			"displayName": "Paranneltu Etsi-valintaikkuna",
			"description": "Tämä lisäosa tuo parannuksia NVDA:n Etsi-valintaikkunaan.\nNykyisen NVDA-istunnon aikana kertynyt hakuhistoria on nyt mahdollista saada näkyviin luettelona, mikä mahdollistaa aiempien hakujen   nopean valitsemisen ja uudelleenhakemisen."
		},
		{
			"language": "fr",
			"displayName": "Dialogue de recherche étendue pour NVDA",
			"description": "Cette extension introduit des améliorations dans la boîte de dialogue de recherche  de NVDA. \nMaintenant c'est possible d'accéder aux termes de recherche précédents, ce qui vous permettra de mener des recherches en fonction des termes précédents de manière beaucoup plus efficace"
		},
		{
			"language": "hr",
			"displayName": "Poboljšani dijalog traženja za NVDA",
			"description": "Ovaj dodatak uvodi poboljšanja u NVDA dijalog traženja .\\n\nSada je moguće imati svoju prethodnu povijest pretraživanja dostupnu na popisu tijekom NVDA sesije, što će vam omogućiti da brzo odaberete i tražite prethodno tražene pojmove."
		},
		{
			"language": "it",
			"displayName": "Enhanced find dialog for NVDA",
			"description": "Questo componente aggiuntivo introduce miglioramenti alla finestra di dialogo di ricerca di NVDA.\\n\nTramite esso è possibile avere in un elenco la cronologia di quanto cercato nell'attuale sessione di NVDA, così da poter selezionare e ricercare nuovamente i termini."
		},
		{
			"language": "pt_BR",
			"displayName": "Diálogo de busca extendido para o NVDA",
			"description": "Este complemento introduz melhorias no diálogo de busca do NVDA. \nAgora, é possível acessar os termos de busca anteriores, o que lhe permitirá realizar pesquisas baseadas em termos anteriores de maneira bem mais eficiente"
		},
		{
			"language": "pt_PT",
			"displayName": "Diálogo de busca extendido para o NVDA",
			"description": "Este extra introduz melhorias no diálogo de busca do NVDA. \nAgora, é possível acessar os termos de busca anteriores, o que lhe permitirá realizar pesquisas baseadas em termos anteriores de maneira bem mais eficiente"
		},
		{
			"language": "ru",
			"displayName": "Расширенное диалоговое окно поиска для NVDA",
			"description": "Это дополнение вносит улучшения в диалоговое окно поиска NVDA."
		},
		{
			"language": "tr",
			"displayName": "NVDA için Geliştirilmiş Ara iletişim kutusu",
			"description": "Bu eklenti, NVDA Ara iletişim kutusunda iyileştirmeler sunar.\nNVDA oturumu sırasında önceki arama geçmişinizi bir listede görmek artık mümkün, bu da daha önce aranan terimleri hızlı bir şekilde seçip aramanızı sağlayacak."
		},
		{
			"language": "uk",
			"displayName": "Розширений діалог пошуку NVDA",
			"description": "Цей додаток покращує діалог пошуку NVDA.\nПротягом активного сеансу NVDA стає можливим мати доступ до історії пошукових запитів, що дозволить вам швидко вибирати та шукати попередні запити."
		}
	]
}
