{
	"addonId": "reviewCursorCopier",
	"displayName": "Review Cursor Copier",
	"URL": "https://github.com/tuukkao/nvda-reviewCursorCopier/releases/download/1.5.2/reviewCursorCopier-1.5.2.nvda-addon",
	"description": "Provides various commands for copying the text under the review cursor to the clipboard. Please consult the documentation for more information.",
	"sha256": "55ba03e2f0ddff6ad636bd21e3d4809ab69f2160f3241a8102b7b2ac46d1b8c9",
	"homepage": "https://github.com/tuukkao/nvda-reviewCursorCopier",
	"addonVersionName": "1.5.2",
	"addonVersionNumber": {
		"major": 1,
		"minor": 5,
		"patch": 2
	},
	"minNVDAVersion": {
		"major": 0,
		"minor": 0,
		"patch": 0
	},
	"lastTestedVersion": {
		"major": 2023,
		"minor": 1,
		"patch": 0
	},
	"channel": "stable",
	"publisher": "Tuukka Ojala",
	"sourceURL": "https://github.com/tuukkao/nvda-reviewCursorCopier",
	"license": "GPL v2",
	"licenseURL": "https://www.gnu.org/licenses/gpl-2.0.html",
	"translations": [
		{
			"language": "an",
			"displayName": "Monitor de recursos",
			"description": "Un monitor de recursos a man ta informar d'a carga d'a CPU, de l'uso de memoria, d'a batería, d'o estau d'uso d'o disco y de muito mas."
		},
		{
			"language": "ar",
			"displayName": "وصف لمكونات الجهاز المادية ونظام التشغيل",
			"description": "تعمل هذه الإضافة على الإعلان عن متوسط تحميل المعالج, والذاكرة المستخدمة, كما تعلن عن حالة البطارية ومساحة الأقراص الصلبة والمتحركة والمزيد."
		},
		{
			"language": "bg",
			"displayName": "Копиране на Курсора за Преглед",
			"description": "Предоставя различни команди за копиране вклипборда на текста под курсора за преглед. За повече информация, моля, консултирайте се с помощната документация."
		},
		{
			"language": "ca",
			"displayName": "Suport remot",
			"description": "Permet el control i accés remot a un altre equip."
		},
		{
			"language": "cs",
			"displayName": "Remote Support",
			"description": "Allows remote control of and remote access to another machine."
		},
		{
			"language": "da",
			"displayName": "Review Cursor Copier",
			"description": "giver forskellige kommandoer til at kopiere teksten ved læsemarkøren til udklipsholderen. Se venligst dokumentationen for flere oplysninger."
		},
		{
			"language": "de",
			"displayName": "Kopierfunktionen für den NVDA-Cursor",
			"description": "Stellt verschiedene Befehle zum Kopieren von Text mittels NVDA-Cursor zur Verfügung. Für weitere Informationen lesen Sie bitte die Dokumentation"
		},
		{
			"language": "de_CH",
			"displayName": "Kopierfunktionen für den NVDA-Cursor",
			"description": "Stellt verschiedene Befehle zum Kopieren von Text mittels NVDA-Cursor zur Verfügung. Für weitere Informationen konsultieren Sie bitte die Dokumentation"
		},
		{
			"language": "el",
			"displayName": "Dropbox",
			"description": "Αναφορά κατάστασης Dropbox ή άνοιγμα μενού συντομεύσεων του Dropbox στη περιοχή εργασιών.\nΣυντόμευση: NVDA+Alt+D"
		},
		{
			"language": "en",
			"displayName": "NVDA recorder",
			"description": "Record in a text document all the speechs of NVDA, except in SayAll, and shows it in a dialog. Turn on/off with Alt+NumPad Plus."
		},
		{
			"language": "es",
			"displayName": "Review Cursor Copier",
			"description": "Proporciona varias órdenes para copiar el texto bajo el cursor de revisión al portapapeles. Por favor consulta la documentación para más información."
		},
		{
			"language": "es_CO",
			"displayName": "Resource Monitor",
			"description": "Un monitor de recursos a mano para informar de la carga de la CPU, del uso de memoria, de la batería, del estado de uso del disco y de mucho más."
		},
		{
			"language": "fa",
			"displayName": "دیده‌بانِ منابع",
			"description": "یک دیده‌بانِ منابعِ دمِ دستی برای اعلامِ بارِ سیپی‌یو، میزانِ استفاده‌ی حافظه، باتری، وضعیتِ استفاده از دیسک و بیشتر."
		},
		{
			"language": "fi",
			"displayName": "Tarkastelukohdistimen kopioija",
			"description": "Tarjoaa eri komentoja tarkastelukohdistimen alla olevan tekstin kopioimiseen leikepöydälle. Katso lisätietoja ohjeesta."
		},
		{
			"language": "fr",
			"displayName": "Review Cursor Copier",
			"description": "Fournit diverses commandes pour copier le texte sous le curseur de revue dans le presse-papiers. Veuillez consulter la documentation pour plus d'informations."
		},
		{
			"language": "gl",
			"displayName": "Review Cursor Copier",
			"description": "Proporciona varias ordes para copiar o texto baixo o cursor de revisión ao portapapeis. Por favor consulta a documentación para máis información."
		},
		{
			"language": "he",
			"displayName": "העתקת סקירת הסמן",
			"description": "מספק פקודות שונות להעתקת הטקסט מתחת לסמן הסקירה ללוח הגזירים. נא עיין בתיעוד לקבלת מידע נוסף."
		},
		{
			"language": "hi",
			"displayName": "सप्ताह का दिन",
			"description": "इस ऐड-ऑन की मदद से, आप एक चुनी हुई तारीख के अनुरूप सप्ताह का दिन पा सकेंगे."
		},
		{
			"language": "hr",
			"displayName": "Kopiranje preglednog kursora",
			"description": "Pruža razne prečace za kopiranje preglednog kursora u međuspremnik. Za daljnje informacije, pročitaj dokumentaciju."
		},
		{
			"language": "hu",
			"displayName": "Áttekintőkurzor másoló",
			"description": "Az áttekintőkurzor alatt található szöveg vágólapra másolására kínál különböző parancsokat. Részletes információkért olvassa el a dokumentációt."
		},
		{
			"language": "it",
			"displayName": "Review Cursor Copier",
			"description": "Fornisce vari comandi per copiare il testo su cui si trova il cursore di controllo negli appunti. Per ulteriori informazioni si prega di consultare la documentazione."
		},
		{
			"language": "ja",
			"displayName": "Resource Monitor",
			"description": "リソースモニターはCPU負荷、メモリ使用量、バッテリーの状態、ディスク使用量を通知します。"
		},
		{
			"language": "ka",
			"displayName": "Input lock",
			"description": " ამ დამატების საშუალებით, შეგიძლიათ დაბლოკოთ და განბლოკოთ თქვენი შეყვანის მოწყობილობები ერთი ჟესტითა თუ კლავიშთა კომბინაციით.\nამ ჟესტის შეცვლა შესაძლებელია შეყვანის ჟესტების დიალოგურ ფანჯარაში.."
		},
		{
			"language": "kn",
			"displayName": "ಗೋಲ್ಡ್ ವೇವ್",
			"description": "An add-on for enhancing access and usage of the GoldWave audio editor."
		},
		{
			"language": "ko",
			"displayName": "리소스 모니터",
			"description": "프로세서, 디스크, 메모리 사용률 및 베터리 상태를 알려줍니다."
		},
		{
			"language": "lt",
			"displayName": "Peržiūros žymeklio kopijuoklis",
			"description": "Suteikia įvairių komandų teksto, esančio po peržiūros žymekliu, kopijavimui į iškarpinę."
		},
		{
			"language": "ne",
			"displayName": "श्रोत अनुगामी",
			"description": "CPU भार, भण्डारको प्रयोग, ब्याट्री र ढुकुटीको अवस्था बताउने छरितो श्रोत अनुगामी ।"
		},
		{
			"language": "nl",
			"displayName": "Resource Monitor",
			"description": "Een handig overzicht van CPU load, geheugengebruik, status van de batterij, schijfgebruik en meer."
		},
		{
			"language": "pl",
			"displayName": "Review Cursor Copier",
			"description": "Udostępnia różne komendy służące do kopiowania tekstu pod kursorem przeglądu do schowka. Więcej informacji można znaleźć w dokumentacji."
		},
		{
			"language": "pt",
			"displayName": "Agenda acessível",
			"description": "Permite o acesso a uma agenda acessível"
		},
		{
			"language": "pt_BR",
			"displayName": "Copiador do cursor de exploração",
			"description": "Provê diversos comandos para copiar o texto sob o cursor de exploração para a área de transferência. Por favor consulte a documentação para mais informações."
		},
		{
			"language": "pt_PT",
			"displayName": "Review Cursor Copier",
			"description": "Fornece vários  comandos para copiar o texto sob o cursor de revisão para a área de transferência. Consulte a documentação para obter mais informações."
		},
		{
			"language": "ro",
			"displayName": "Review Cursor Copier",
			"description": "Oferă o varietate de comenzi pentru copierea textului de sub cursorul de examinare pe planșetă. Vă rugăm să consultați documentația pentru mai multe informații."
		},
		{
			"language": "ru",
			"displayName": "Resource Monitor",
			"description": "Удобный монитор ресурсов сообщающий о загрузке процессора, использовании памяти, состоянии заряда батареи, использовании диска и многого другого."
		},
		{
			"language": "sk",
			"displayName": "Review Cursor Copier",
			"description": "Provides various commands for copying the text under the review cursor to the clipboard. Please consult the documentation for more information."
		},
		{
			"language": "sl",
			"displayName": "Preslikovalnik Pregledne Utripalke",
			"description": "Oskrbuje različne ukaze za preslikavo besedila pod pregledno utripalko v odložišče. Prosimo, glejte dokumentacijo za več informacij."
		},
		{
			"language": "sr",
			"displayName": "Review Cursor Copier",
			"description": "Pruža razne komande za kopiranje teksta preglednog kursora u privremenu memoriju. Molimo pogledajte dokumentaciju za više informacija."
		},
		{
			"language": "sv",
			"displayName": "BluetoothAudio",
			"description": "Bluetooth Audio är ett tillägg till NVDA som  förbättrar ljudkvalitén när man använder bluetoothhörlurar eller bluetoothhögtalare."
		},
		{
			"language": "ta",
			"displayName": "வள கவனிப்பு",
			"description": "மையச் செயலக சுமை, நினைவக, மின்கல மற்றும் வட்டின் பயன்பாடு ஆகியவைகளை அறிவிக்கும் கையடக்க வள கவனிப்பு."
		},
		{
			"language": "tr",
			"displayName": "Kaynak İzleme",
			"description": "CPU yükü, hafıza kullanımı, pil ve disk kullanım durumunu takip etmek ve daha fazlası için pratik bir araç."
		},
		{
			"language": "uk",
			"displayName": "Монітор ресурсів",
			"description": "Зручний монітор ресурсів повідомляє про завантаженість процесора, використання оперативної пам'яті, статус акумулятора і дискового простору, та іншу інформацію."
		},
		{
			"language": "vi",
			"displayName": "Theo Dõi Tài Nguyên",
			"description": "Add-on này dùng để thông báo tình trạng sử dụng các thiết bị của máy, bao gồm: CPU, RAM, ổ đĩa và pin."
		},
		{
			"language": "zh_CN",
			"displayName": "浏览光标剪贴板",
			"description": "提供各种命令，用于将浏览光标下的文本复制到剪贴板。请参阅文档以获取更多信息。"
		},
		{
			"language": "zh_TW",
			"displayName": "Resource Monitor資源監視器",
			"description": "此資源監控元件能讀出 CPU 負載，記憶體、電池、磁碟使用情形。"
		}
	]
}