{
  "addonId": "reviewCursorCopier",
  "displayName": "Review Cursor Copier",
  "URL": "https://github.com/tuukkao/nvda-reviewCursorCopier/releases/download/1.6/reviewCursorCopier-1.6.nvda-addon",
  "description": "Provides various commands for copying the text under the review cursor to the clipboard. Please consult the documentation for more information.",
  "sha256": "9a73bfc750b328d9b272d22e3c0c4fd9e3024401798c8b8989d6a32df61223da",
  "addonVersionName": "1.6",
  "addonVersionNumber": {
    "major": 1,
    "minor": 6,
    "patch": 0
  },
  "minNVDAVersion": {
    "major": 0,
    "minor": 0,
    "patch": 0
  },
  "lastTestedVersion": {
    "major": 2024,
    "minor": 1,
    "patch": 0
  },
  "channel": "stable",
  "publisher": "Tuukka Ojala",
  "sourceURL": "https://github.com/tuukkao/nvda-reviewCursorcopier",
  "license": "GPL v2",
  "homepage": "https://github.com/tuukkao/nvda-reviewCursorCopier",
  "licenseURL": "https://www.gnu.org/licenses/gpl-2.0.html",
  "translations": [
    {
      "language": "bg",
      "displayName": "Копиране на Курсора за Преглед",
      "description": "Предоставя различни команди за копиране вклипборда на текста под курсора за преглед. За повече информация, моля, консултирайте се с помощната документация."
    },
    {
      "language": "da",
      "displayName": "Review Cursor Copier",
      "description": "giver forskellige kommandoer til at kopiere teksten ved læsemarkøren til udklipsholderen. Se venligst dokumentationen for flere oplysninger."
    },
    {
      "language": "de",
      "displayName": "Kopierfunktionen für den NVDA-Cursor",
      "description": "Stellt verschiedene Befehle zum Kopieren von Text mittels NVDA-Cursor zur Verfügung. Für weitere Informationen lesen Sie bitte die Dokumentation"
    },
    {
      "language": "de_CH",
      "displayName": "Kopierfunktionen für den NVDA-Cursor",
      "description": "Stellt verschiedene Befehle zum Kopieren von Text mittels NVDA-Cursor zur Verfügung. Für weitere Informationen konsultieren Sie bitte die Dokumentation"
    },
    {
      "language": "es",
      "displayName": "Review Cursor Copier",
      "description": "Proporciona varias órdenes para copiar el texto bajo el cursor de revisión al portapapeles. Por favor consulta la documentación para más información."
    },
    {
      "language": "fi",
      "displayName": "Tarkastelukohdistimen kopioija",
      "description": "Tarjoaa eri komentoja tarkastelukohdistimen alla olevan tekstin kopioimiseen leikepöydälle. Katso lisätietoja ohjeesta."
    },
    {
      "language": "fr",
      "displayName": "Review Cursor Copier",
      "description": "Fournit diverses commandes pour copier le texte sous le curseur de revue dans le presse-papiers. Veuillez consulter la documentation pour plus d'informations."
    },
    {
      "language": "gl",
      "displayName": "Review Cursor Copier",
      "description": "Proporciona varias ordes para copiar o texto baixo o cursor de revisión ao portapapeis. Por favor consulta a documentación para máis información."
    },
    {
      "language": "he",
      "displayName": "העתקת סקירת הסמן",
      "description": "מספק פקודות שונות להעתקת הטקסט מתחת לסמן הסקירה ללוח הגזירים. נא עיין בתיעוד לקבלת מידע נוסף."
    },
    {
      "language": "hr",
      "displayName": "Kopiranje preglednog kursora",
      "description": "Pruža razne prečace za kopiranje preglednog kursora u međuspremnik. Za daljnje informacije, pročitaj dokumentaciju."
    },
    {
      "language": "hu",
      "displayName": "Áttekintőkurzor másoló",
      "description": "Az áttekintőkurzor alatt található szöveg vágólapra másolására kínál különböző parancsokat. Részletes információkért olvassa el a dokumentációt."
    },
    {
      "language": "it",
      "displayName": "Review Cursor Copier",
      "description": "Fornisce vari comandi per copiare il testo su cui si trova il cursore di controllo negli appunti. Per ulteriori informazioni si prega di consultare la documentazione."
    },
    {
      "language": "lt",
      "displayName": "Peržiūros žymeklio kopijuoklis",
      "description": "Suteikia įvairių komandų teksto, esančio po peržiūros žymekliu, kopijavimui į iškarpinę."
    },
    {
      "language": "pl",
      "displayName": "Review Cursor Copier",
      "description": "Udostępnia różne komendy służące do kopiowania tekstu pod kursorem przeglądu do schowka. Więcej informacji można znaleźć w dokumentacji."
    },
    {
      "language": "pt_BR",
      "displayName": "Copiador do cursor de exploração",
      "description": "Provê diversos comandos para copiar o texto sob o cursor de exploração para a área de transferência. Por favor consulte a documentação para mais informações."
    },
    {
      "language": "pt_PT",
      "displayName": "Review Cursor Copier",
      "description": "Fornece vários  comandos para copiar o texto sob o cursor de revisão para a área de transferência. Consulte a documentação para obter mais informações."
    },
    {
      "language": "ro",
      "displayName": "Review Cursor Copier",
      "description": "Oferă o varietate de comenzi pentru copierea textului de sub cursorul de examinare pe planșetă. Vă rugăm să consultați documentația pentru mai multe informații."
    },
    {
      "language": "sk",
      "displayName": "Review Cursor Copier",
      "description": "Provides various commands for copying the text under the review cursor to the clipboard. Please consult the documentation for more information."
    },
    {
      "language": "sl",
      "displayName": "Preslikovalnik Pregledne Utripalke",
      "description": "Oskrbuje različne ukaze za preslikavo besedila pod pregledno utripalko v odložišče. Prosimo, glejte dokumentacijo za več informacij."
    },
    {
      "language": "sr",
      "displayName": "Review Cursor Copier",
      "description": "Pruža razne komande za kopiranje teksta preglednog kursora u privremenu memoriju. Molimo pogledajte dokumentaciju za više informacija."
    },
    {
      "language": "zh_CN",
      "displayName": "浏览光标剪贴板",
      "description": "提供各种命令，用于将浏览光标下的文本复制到剪贴板。请参阅文档以获取更多信息。"
    }
  ],
  "reviewUrl": "https://github.com/nvaccess/addon-datastore/discussions/2724"
}
