{
	"addonId": "TranslateAdvanced",
	"displayName": "Traductor Avanzado",
	"URL": "https://github.com/hxebolax/TranslateAdvanced/releases/download/2024.09.19/TranslateAdvanced-2024.09.19.nvda-addon",
	"description": "Traductor Avanzado para NVDA es un complemento que facilita la traducción de textos en varios \nidiomas utilizando servicios como Google Translate, DeepL, LibreTranslate y Microsoft Translator.\nOfrece traducción simultánea, historial y gestión de claves API. Es fácil de configurar y usar con\nteclas rápidas y opciones personalizables en el menú de NVDA.",
	"sha256": "bfe23e200e18f14593f1f1ca544bf7634f7956934cf2df7e9c015c3e4d8fe177",
	"addonVersionName": "2024.09.19",
	"addonVersionNumber": {
		"major": 2024,
		"minor": 9,
		"patch": 19
	},
	"minNVDAVersion": {
		"major": 2024,
		"minor": 1,
		"patch": 0
	},
	"lastTestedVersion": {
		"major": 2024,
		"minor": 3,
		"patch": 0
	},
	"channel": "stable",
	"publisher": "hxebolax",
	"sourceURL": "https://github.com/hxebolax/TranslateAdvanced",
	"license": "GPL v2",
	"homepage": "https://github.com/hxebolax/TranslateAdvanced",
	"licenseURL": "https://www.gnu.org/licenses/gpl-2.0.html",
	"submissionTime": 1726769315000,
	"translations": [
		{
			"language": "en",
			"displayName": "Advanced Translator",
			"description": "Advanced Translator for NVDA is an addon that facilitates the translation of texts in various languages using services such as Google Translate, DeepL, LibreTranslate and Microsoft Translator.\nIt offers real time translation, history and API key management. It's easy to set up and use with hotkeys and customizable options in the NVDA menu."
		},
		{
			"language": "fr",
			"displayName": "Traducteur Avancé",
			"description": "Traducteur Avancé pour NVDA est une extension qui facilite la traduction de textes dans divers \nlangues à l'aide de services tels que Google Translate, DeepL, LibreTranslate et Microsoft Translator.\nOffre une traduction simultanée, un historique et une gestion des clés API. Il est facile à configurer et à utiliser avec des\nraccourcis clavier et options personnalisables dans le menu NVDA."
		},
		{
			"language": "it",
			"displayName": "Traduttore Avanzato",
			"description": "Traduttore Avanzato per NVDA è un add-on che facilita la traduzione di testi in vari \nlingue utilizzando servizi come Google Traduttore, DeepL, LibreTranslate e Microsoft Translator.\nOffre traduzione simultanea, cronologia e gestione delle chiavi API. È facile da configurare e utilizzare con\ntasti di scelta rapida e opzioni personalizzabili nel menu NVDA."
		},
		{
			"language": "pt",
			"displayName": "Tradutor avançado",
			"description": "Traductor Avanzado para NVDA es un complemento que facilita la traducción de textos en varios \nidiomas utilizando servicios como Google Translate, DeepL, LibreTranslate y Microsoft Translator.\nOfrece traducción simultánea, historial y gestión de claves API. Es fácil de configurar y usar con\nteclas rápidas y opciones personalizables en el menú de NVDA."
		},
		{
			"language": "ru",
			"displayName": "TranslateAdvanced (Продвинутый Переводчик)",
			"description": "TranslateAdvanced – это дополнение, которое позволяет переводить тексты с помощью различных онлайн-сервисов перевода, таких как Google Translate, DeepL, LibreTranslate, Microsoft Translator и OpenAI GPT4o-mini.\nДополнение предлагает расширенные возможности, такие как: синхронный перевод, перевод выделенного текста, перевод текста с объекта, перевод последнего произнесенного текста, историю и управление ключами API. Его легко настроить и использовать с помощью горячих клавиш или виртуальной клавиатуры и настраиваемых параметров в меню NVDA.\nВесь функционал и особенности дополнения описаны в подробном руководстве.\nДля работы дополнения необходимо подключение к интернету."
		},
		{
			"language": "tr",
			"displayName": "Gelişmiş Çeviri",
			"description": "NVDA için Gelişmiş Çeviri, çeşitli dillerdeki metinlerin çevirisini kolaylaştıran bir eklentidir. \nGoogle Translate, DeepL, LibreTranslate ve Microsoft Translator gibi hizmetleri kullanarak diller çevrilir.\nEş zamanlı çeviri, geçmiş ve API anahtar yönetimi sunar. Kurulumu ve kullanımı kolaydırn\nkısayol tuşları ve NVDA menüsündeki özelleştirilebilir seçenekler."
		},
		{
			"language": "uk",
			"displayName": "Розширений перекладач",
			"description": "Traductor Avanzado para NVDA es un complemento que facilita la traducción de textos en varios \nidiomas utilizando servicios como Google Translate, DeepL, LibreTranslate y Microsoft Translator.\nOfrece traducción simultánea, historial y gestión de claves API. Es fácil de configurar y usar con\nteclas rápidas y opciones personalizables en el menú de NVDA."
		}
	],
	"reviewUrl": "https://github.com/nvaccess/addon-datastore/discussions/3830"
}
