{"addonId": "AIContentDescriber", "displayName": "Popis obsahu pomocou AI", "URL": "https://github.com/cartertemm/AI-content-describer/releases/download/v2025.02.05/AIContentDescriber-2025.02.05.nvda-addon", "description": "Tento doplnok umožňuje popísať aktuálny fokus, prezeraný objekt alebo celú obrazovku pomocou populárnych jazykových modelov umelej inteligencie so strojovým videním, ako je Claude, Gemini alebo GPT4.\nUmožňuje tiež zistiť, kde sa nachádza vaša tvár v zábere pripojenej kamery.\nNapriek tomu, že sú popisy obsahu pomerne detailné, nemusia vždy byť úplne presné alebo zodpovedať reálnym skutočnostiam.\nAk chcete začať s GPT, navštívte stránku https://platform.openai.com/account/api-keys, vytvorte si tu účet a potom si vytvorte API kľúč pre interakciu s rozhraním tejto služby. Pre viac informácií si prečítajte nápovedu k doplnku.\nPotom v dialógu Nastavenia NVDA vyberte kategóriu \"Popis obsahu pomocou AI\" -> Spravovať modely a tu zadajte svoj API kľúč.\nStlačte klávesovú skratku NVDA+shift+i a z otvorenej ponuky vyberte, čo presne si prajete popísať, alebo stlačte klávesovú skratku NVDA+shift+u pre popis aktuálne prezeraného objektu, prípadne NVDA+shift+y pre popis obrázku, ktorý ste skopírovali do schránky napríklad v Prieskumníkovi Windows. Ďalšie klávesové skratky si môžete priradiť v dialógu Klávesové skratky.", "sha256": "16a3c671a65203898d66111f1e8b4508e96c163ecb77233e2ff4f77d85c4dac9", "addonVersionName": "2025.02.05", "addonVersionNumber": {"major": 2025, "minor": 2, "patch": 5}, "minNVDAVersion": {"major": 2023, "minor": 1, "patch": 0}, "lastTestedVersion": {"major": 2024, "minor": 1, "patch": 0}, "channel": "stable", "publisher": "Carter Temm and contributors", "sourceURL": "https://github.com/cartertemm/AI-content-describer/", "license": "GPL v2", "licenseURL": "https://www.gnu.org/licenses/gpl-2.0.html", "submissionTime": 1738831875000, "reviewUrl": "https://github.com/nvaccess/addon-datastore/discussions/2048"}