{
	"addonId": "urlShortener",
	"displayName": "URL Shortener",
	"URL": "https://github.com/nvdaes/urlShortener/releases/download/0.1.0/urlShortener-0.1.0.nvda-addon",
	"description": "Shorten URLs through NVDA.",
	"sha256": "e5f3c1b5f494cb9e5ad17cfc53abcc33cf35eaacbca9c0626b2f17da50824874",
	"homepage": "https://github.com/nvdaes/urlShortener",
	"addonVersionName": "0.1.0",
	"addonVersionNumber": {
		"major": 0,
		"minor": 1,
		"patch": 0
	},
	"minNVDAVersion": {
		"major": 2023,
		"minor": 1,
		"patch": 0
	},
	"lastTestedVersion": {
		"major": 2023,
		"minor": 1,
		"patch": 0
	},
	"channel": "beta",
	"publisher": "nvdaes",
	"sourceURL": "https://github.com/nvdaes/urlShortener/",
	"license": "GPL v2",
	"licenseURL": "https://www.gnu.org/licenses/gpl-2.0.html",
	"translations": [
		{
			"language": "an",
			"displayName": "Dentrada braille Unicode",
			"description": "Amuestra un campo de texto ta tecliar braille numerico (eix.: 1345-1236-145-1) y lo convierte en caracters de braille unicode."
		},
		{
			"language": "ar",
			"displayName": "UnigramPlus",
			"description": "This add-on adds a lot of hotkeys for quick navigation through the main elements of the Unigram application, convenient interaction with Chat messages, and also adds many small improvements that make working in Unigram much easier"
		},
		{
			"language": "bg",
			"displayName": "Избор на канал за обновяване",
			"description": "Тази добавка ви позволява бързо да превключвате между тестовите и стабилните версии на NVDA. Отидете до категорията \"Канал за обновяване\" в диалоговия прозорец с настройките на NVDA, изберете вашия канал за обновяване и проверете за обновления от менюто \"Помощ\" на NVDA. Изберете опцията \"Стабилна\" и обновете отново, за да се върнете към стабилната версия."
		},
		{
			"language": "ca",
			"displayName": "Tele NVDA remote assistance",
			"description": "Allows remote control of and remote access to another machine. This add-on is based on NVDA Remote."
		},
		{
			"language": "cs",
			"displayName": "UnigramPlus",
			"description": "This add-on adds a lot of hotkeys for quick navigation through the main elements of the Unigram application, convenient interaction with Chat messages, and also adds many small improvements that make working in Unigram much easier"
		},
		{
			"language": "da",
			"displayName": "Indtastning af Unicode Braille",
			"description": "Viser et tekstfelt, hvor du kan indtaste numerisk Braille, f.eks. 1345-1236-145-1, og konvertere det til Unicode punkttegn."
		},
		{
			"language": "de",
			"displayName": "Update-Kanal-Auswahl",
			"description": "Mit dieser Erweiterung können Sie schnell zwischen Entwicklungs-Schnappschüssen, Beta-, RC- und stabilen Versionen wechseln. Wechseln Sie zur Kategorie Update-Kanal im Dialogfeld NVDA-Einstellungen. Wählen Sie dort den gewünschten Update-Kanal aus und suchen Sie im NVDA-Hilfemenü nach Updates. Wählen Sie die Option stabil und aktualisieren Sie erneut, um zu einer offiziellen Version zurückzukehren."
		},
		{
			"language": "de_CH",
			"displayName": "Unicode-Braille-Eingabe",
			"description": "Zeigt ein Textfeld zur numerischen Eingabe von Unicode-Braille-Zeichen an (Z.B. 1345-1236-145-1) und konvertiert diese Eingabe in Unicode-Zeichen."
		},
		{
			"language": "el",
			"displayName": "Λίστα Χώρου Ειδοποιήσεων",
			"description": "Εμφανίζει σε Λίστα Κουμπιών τα Αντικείμενα που υπάρχουν στον Χώρο Ειδοποιήσεων πατώντας τα πλήκτρα NVDA+F11 μία φορά. Πατώντας δύο φορές εμφανίζει τις τρέχουσες διεργασίες."
		},
		{
			"language": "en",
			"displayName": "unigram",
			"description": "Módulo que agrega enfoques automáticos y atajos de teclado a funciones importantes de la aplicación"
		},
		{
			"language": "es",
			"displayName": "Selector del canal de actualización",
			"description": "Este complemento te permite cambiar rápidamente entre tipos de versiones de desarrollo de NVDA y liberaciones. Ve a la categoría Canal de actualización en el diálogo de opciones de NVDA, elige tu canal de actualización y busca actualizaciones desde el menú Ayuda de NVDA. Elige la opción estable y actualiza de nuevo para volver a una liberación oficial."
		},
		{
			"language": "es_CO",
			"displayName": "Entrada Braille Unicode",
			"description": "Muestra un campo de texto para teclear braille numérico (ej.: 1345-1236-145-1) y lo convierte a carácteres de braille unicode."
		},
		{
			"language": "fa",
			"displayName": "UnigramPlus ",
			"description": "This add-on adds a lot of hotkeys for quick navigation through the main elements of the Unigram application, convenient interaction with Chat messages, and also adds many small improvements that make working in Unigram much easier"
		},
		{
			"language": "fi",
			"displayName": "Päivityskanavan valitsin",
			"description": "Tämän lisäosan avulla voit nopeasti vaihtaa NVDA:n kehitysversioiden ja julkaisutyyppien välillä. Siirry NVDA:n asetusvalintaikkunassa Päivityskanava-kategoriaan, valitse haluamasi päivityskanava ja tarkista päivitykset NVDA:n Ohje-valikosta. Valitse Vakaa-vaihtoehto ja päivitä uudelleen palataksesi viralliseen versioon."
		},
		{
			"language": "fr",
			"displayName": "Sélecteur du canal de mise à jour",
			"description": "Cette extension vous permet de changer rapidement entre les types de versions de développement de NVDA et releases. Accédez à  la catégorie Canal de mise à jour du dialogue Paramètres de NVDA, choisissez votre   canal de mise à jour  et recherchez des mises à jour à partir du menu Aide de NVDA. Choisissez l'option stable et mettez à jour à nouveau pour revenir à une version officielle."
		},
		{
			"language": "gl",
			"displayName": "Selector de canle de actualización",
			"description": "Este complemento permíteche cambiar rapidamente entre versións experimentais de NVDA e tipos de versións. Vai á categoría canle de actualización no diálogo de opcións de NVDA; escolle a túa canle de actualización e e comproba actualizacións dende o menú de axuda de NVDA. Escolle a opción estable e actualiza de novo para volver a unha versión oficial."
		},
		{
			"language": "he",
			"displayName": "קלט תווי יוניקוד בברייל",
			"description": "מציג תיבת עריכה המאפשרת לקלוט נקודות ברייל, כגון :\n1345-1236-145-1\nולהפוך אותן לתווי יוניקוד."
		},
		{
			"language": "hi",
			"displayName": "sayCurrentKeyboardLanguage",
			"description": "This addon provides a command to know the language of the keyboard in use, as well as the default language of the system"
		},
		{
			"language": "hr",
			"displayName": "Selektor kanala za aktualiziranje",
			"description": "Ovaj dodatak omogućuje brzo prebacivanje između NVDA snimaka i vrsta izdanja. Idi u kategoriju kanala za aktualiziranje u dijaloškom okviru NVDA postavki, odaberi kanal za aktualiziranje i provjeri postoje li nove verzije u izborniku NVDA pomoći. Odaberi opciju stabilne verzije i ponovo aktualiziraj za vraćanje na službeno izdanje."
		},
		{
			"language": "hu",
			"displayName": "Unikód braille bevitel",
			"description": "Megjelenít egy ablakot, ahova beírhatja numerikus formában a braille karaktereket (pl. 1345-1236-145-1) minusz jelekkel elválasztva, amit a szkript unicode karakterekké konvertál."
		},
		{
			"language": "it",
			"displayName": "Selettore del canale per gli aggiornamenti",
			"description": "Questo componente aggiuntivo consente di passare rapidamente tra snapshot di NVDA ed altri tipi di rilascio. Vai alla categoria del canale di aggiornamento nella finestra di dialogo delle impostazioni di NVDA, scegli il canale di aggiornamento e controlla gli aggiornamenti dal menu dell'aiuto di NVDA. Scegli l'opzione stabile e aggiorna di nuovo per tornare a una versione ufficiale."
		},
		{
			"language": "ja",
			"displayName": "Unicode Braille Input",
			"description": "表示されるテキストフィールドに数字で点字パターンを 1345-1236-145-1 のように入力するとユニコード点字文字に変換します。"
		},
		{
			"language": "ka",
			"displayName": "Input lock",
			"description": " ამ დამატების საშუალებით, შეგიძლიათ დაბლოკოთ და განბლოკოთ თქვენი შეყვანის მოწყობილობები ერთი ჟესტითა თუ კლავიშთა კომბინაციით.\nამ ჟესტის შეცვლა შესაძლებელია შეყვანის ჟესტების დიალოგურ ფანჯარაში.."
		},
		{
			"language": "kn",
			"displayName": "ಯೂನಿಕೋಡ್ ಬ್ರೈಲ್ ಆದಾನ",
			"description": "ಸಂಖ್ಯಾ ಬ್ರೈಲ್ ಕ್ಷೇತ್ರದಲ್ಲಿ  ಪಠ್ಯ  ನಮೋದಿಸಲು ಪ್ರದರ್ಶಿಸುತ್ತದೆ (e.g. 1345-1236-145-1) ಮತ್ತು ಯುನಿಕೋಡ್ ಬ್ರೈಲ್ ಪಾತ್ರಗಳಿಗೆ  ಮಾರ್ಪಡಿಸುತ್ತದೆ."
		},
		{
			"language": "ko",
			"displayName": "시스템 트레이 목록",
			"description": "NVDA+F11을 사용하여 시스템 트레이 목록을 알려줍니다. 두번 누르면 작업 표시줄 목록을 보여줍니다."
		},
		{
			"language": "lt",
			"displayName": "sayCurrentKeyboardLanguage",
			"description": "This addon provides a command to know the language of the keyboard in use, as well as the default language of the system"
		},
		{
			"language": "nb_NO",
			"displayName": "Systemkurvliste",
			"description": "Viser listen over knapper i systemkurven med NVDA+F11 en gang, to ganger viser kjørende oppgaveliste."
		},
		{
			"language": "ne",
			"displayName": "UnigramPlus",
			"description": "This add-on adds a lot of hotkeys for quick navigation through the main elements of the Unigram application, convenient interaction with Chat messages, and also adds many small improvements that make working in Unigram much easier"
		},
		{
			"language": "nl",
			"displayName": "Unicode braille-invoer",
			"description": "Toont een tekstvak om numeriek braille in te voeren (bijvoorbeeld 1345-1236-145-1) en converteert het in unicode braillekarakters."
		},
		{
			"language": "pl",
			"displayName": "Update channel selector",
			"description": "Ten dodatek umożliwia szybkie przełączanie między migawkami NVDA i typami wydań. Przejdź do kategorii kanału aktualizacji w oknie dialogowym ustawień NVDA, wybierz kanał aktualizacji i sprawdź dostępność aktualizacji z menu pomocy NVDA. Wybierz opcję stabilną i zaktualizuj ponownie, aby powrócić do oficjalnego wydania."
		},
		{
			"language": "pt",
			"displayName": "Agenda acessível",
			"description": "Permite o acesso a uma agenda acessível"
		},
		{
			"language": "pt_BR",
			"displayName": "UnigramPlus",
			"description": "This add-on adds a lot of hotkeys for quick navigation through the main elements of the Unigram application, convenient interaction with Chat messages, and also adds many small improvements that make working in Unigram much easier"
		},
		{
			"language": "pt_PT",
			"displayName": "Selector de canais de actualização",
			"description": "Este extra permite alternar rapidamente entre os instantâneos do NVDA e as versões estáveis. Vá para a categoria de atualização de canal na caixa de diálogo de configurações do NVDA, escolha o seu canal de actualização e verifique se há actualizações no menu de ajuda do NVDA. Escolha a opção estável e actualize novamente para voltar a uma versão oficial estável."
		},
		{
			"language": "ro",
			"displayName": "Update channel selector",
			"description": "Acest supliment vă permite să treceți rapid de la instantaneele NVDA la tipurile de versiuni. Mergeți la categoria actualizare canal din panoul setărilor NVDA, alegeți-vă canalul de actualizare și căutați update-uri din meniul de ajutor al NVDA. Alegeți opțiunea stabilă și actualizați din nou pentru a vă întoarce la o versiune oficială."
		},
		{
			"language": "ru",
			"displayName": "Селектор канала обновления",
			"description": "Это дополнение позволяет быстро переключаться между снапшотами NVDA и типами релизов. Перейдите в категорию канала обновления в диалоговом окне настроек NVDA, выберите свой канал обновления и проверьте наличие обновлений в меню справки NVDA. Выберите стабильный вариант и снова обновитесь, чтобы вернуться к официальному выпуску."
		},
		{
			"language": "sk",
			"displayName": "Unicode vstup pre Braillovo písmo",
			"description": "Zobrazí editačné pole na  zadanie textu v numerickom  tvare(napríklad 1345-1236-145-1). Zadaný text prevedie na unicode znaky."
		},
		{
			"language": "sl",
			"displayName": "Vnos Unicode Brajice:",
			"description": "Pokaže besedilno polje za vnos številske brajice(na primer 1345-1236-145-1), potem to pretvori v unicode brajeve znake."
		},
		{
			"language": "sr",
			"displayName": "Birač kanala ažuriranja",
			"description": "Ovaj dodatak vam dozvoljava da se brzo prebacujete između NVDA stabilnih i verzija za testiranje. Posetite kategoriju kanal ažuriranja NVDA dijaloga sa podešavanjima, izaberite vaš kanal ažuriranja a zatim proverite dostupna ažuriranja iz NVDA menija pomoći. Izaberite opciju stabilne verzije kako biste se ažuriranjem vratili na poslednju stabilnu verziju."
		},
		{
			"language": "sv",
			"displayName": "BluetoothAudio",
			"description": "Bluetooth Audio är ett tillägg till NVDA som  förbättrar ljudkvalitén när man använder bluetoothhörlurar eller bluetoothhögtalare."
		},
		{
			"language": "ta",
			"displayName": "கணினித் தட்டுப் பட்டியல்",
			"description": "என்விடிஏ+f11 விசையை ஒரு முறை அழுத்தினால், கணினித் தட்டில் இருக்கும் பொத்தான்களின் பட்டியலை காண்பிக்கும். இரு முறை அழுத்தினால், பணிப்பட்டையில் ஓடிக் கொண்டிருக்கும் பயன்பாடுகளின் உருவங்களின் பட்டியலைக் காண்பிக்கும்."
		},
		{
			"language": "tr",
			"displayName": "Güncelleme Kanalı Seçici",
			"description": "Bu eklenti, NVDA anlık görüntüleri ve çıkış türleri arasında hızlıca geçiş yapmanızı sağlar. NVDA ayarları iletişim kutusundaki güncelleme kanalı kategorisine gidin, istediğiniz güncelleme kanalını seçin ve NVDA yardım menüsünden güncellemeleri kontrol edin. Resmi sürüme geri dönmek için kararlı seçeneğini seçin ve NVDA'yı yeniden güncelleyin."
		},
		{
			"language": "uk",
			"displayName": "Вибір каналу оновлення",
			"description": "Цей додаток дозволяє швидко перемикатися між снепшотами і типами релізів NVDA. Увійдіть у категорію «Вибір каналу оновлень NVDA» у налаштуваннях NVDA, оберіть бажаний канал оновлення і перевірте наявність оновлень у меню довідки NVDA. Оберіть стабільний канал і оновіть щераз, щоб повернутися до стабільного релізу."
		},
		{
			"language": "vi",
			"displayName": "Bật âm thanh của Windows",
			"description": "Khi khởi động NVDA, add-on này sẽ kiểm tra trạng thái hệ thống âm thanh của Windows. Nếu nó bị tắt thì bật lên."
		},
		{
			"language": "zh",
			"displayName": "Unigram Plus",
			"description": "This add-on adds a lot of hotkeys for quick navigation through the main elements of the Unigram application, convenient interaction with Chat messages, and also adds many small improvements that make working in Unigram much easier"
		},
		{
			"language": "zh_CN",
			"displayName": "更新通道选择器",
			"description": "这个插件可以让您在 NVDA 的各个版本之间进行快速切换。进入 NVDA 设置面板 / 更新通道类别下，选择一个所需的更新通道，然后在 NVDA 帮助菜单内“检查更新”。选择“稳定版”选项后，执行“检查更新”则可以回到稳定版。"
		},
		{
			"language": "zh_HK",
			"displayName": "系統匣圖示",
			"description": "列出系統匣的圖示, 連按兩次則列出工作列的圖示"
		},
		{
			"language": "zh_TW",
			"displayName": "Tele NVDA 遠端協助",
			"description": "允許控制與存取遠端電腦。此附加元件基於 NVDA Remote 。"
		}
	]
}