{
  "addonId": "IndentNav",
  "displayName": "IndentNav",
  "URL": "https://github.com/mltony/nvda-indent-nav/releases/download/v2.0/IndentNav-2.0.nvda-addon",
  "description": "Indentation Navigation addon.\nIt allows NVDA users to navigate by indentation level or offset of lines or paragraphs.\nIn browsers it allows to quickly find paragraphs with the same offset from the left edge of the screen, such as first level comments in a hierarchical tree of comments.\nAlso while editing source code in many programming languages, it allows to jump between the lines of the same indentation level, as well as quickly find lines with greater or lesser indentation level.",
  "sha256": "cf704481a811e8c4d022fc5974c3a8e552255881e826595f5ca48d703085c3b5",
  "addonVersionName": "2.0",
  "addonVersionNumber": {
    "major": 2,
    "minor": 0,
    "patch": 0
  },
  "minNVDAVersion": {
    "major": 2019,
    "minor": 2,
    "patch": 0
  },
  "lastTestedVersion": {
    "major": 2024,
    "minor": 1,
    "patch": 0
  },
  "channel": "stable",
  "publisher": "Tony Malykh",
  "sourceURL": "https://github.com/mltony/nvda-indent-nav/",
  "license": "GPL v2",
  "homepage": "https://github.com/mltony/nvda-indent-nav",
  "licenseURL": "https://www.gnu.org/licenses/gpl-2.0.html",
  "translations": [
    {
      "language": "bg",
      "displayName": "Навигация по отстъпи",
      "description": "Добавка за навигация по отстъпи.\nТази добавка позволява на потребителите на NVDA да се придвижват по нивото на отстъпа или по определен брой редове или абзаци.\nВ браузърите позволява бързо да се намерят абзаци със същото отместване от левия край на екрана, като коментари от първо ниво в йерархичното дърво на коментарите.\nСъщо така, докато редактирате изходен код на много езици за програмиране, той позволява да прескачате между редовете със същото ниво на отстъп, както и да намирате бързо редове с по-голямо или по-малко ниво на отстъп."
    },
    {
      "language": "da",
      "displayName": "Indrykningsnavigation",
      "description": "Tilføjelsespakke til indrykningssnavigation. Denne tilføjelse  giver NVDA-brugere mulighed for at navigere efter indrykningsniveau eller forskydning af linjer eller afsnit. I browsere gør denne pakke det muligt at finde afsnit med samme forskydning fra skærmens venstre kant som f.eks. kommentarer på første niveau i et hierarkisk træ med kommentarer. Dette er også nyttigt, når du redigerer kildekoden i forhold til mange programmeringssprog, hvor pakken kan sætte dig i stand til at springe mellem linjerne på samme indrykningsniveau og hurtigt finde linjer med større eller mindre indrykningsniveauer."
    },
    {
      "language": "de",
      "displayName": "IndentNav",
      "description": "Navigation nach Einrückungsebene\nDiese Erweiterung ermöglicht die Navigation im Text nach der Einrückungsebene oder dem Abstand von Zeilen und Absätzen.  In Browsern ermöglicht diese Erweiterung das schnelle Auffinden von Absätzen mit gleichem Abstand zum linken Bildschirmrand, wie z.B. Kommentare der ersten Ebene in einem hierarchischen Kommentarbaum.  Auch beim Editieren von Quellcode in vielen Programmiersprachen erlaubt Indentnav zwischen den Zeilen der gleichen Einrückungsebene zu springen, sowie schnell Zeilen mit niedrigerer oder höherer Einrückungsebene zu finden."
    },
    {
      "language": "es",
      "displayName": "IndentNav",
      "description": "Complemento de navegación por sangría.\nPermite a los usuarios de NVDA navegar por nivel de sangría o desplazamiento de líneas y párrafos.\nEn los navegadores, permite encontrar párrafos rápidamente con el mismo desplazamiento desde el borde izquierdo de la pantalla, como los comentarios de primer nivel en una vista jerárquica de comentarios.\nAdemás, al editar el código fuente de muchos lenguajes de programación, permite saltar entre líneas con el mismo nivel de sangría, así como encontrar líneas con más o menos nivel de sangría."
    },
    {
      "language": "fi",
      "displayName": "IndentNav",
      "description": "Sisennysnavigoinnin lisäosa.\nSen avulla NVDA:n käyttäjät voivat siirtyä sisennystason, rivipoikkeamien tai kappaleiden mukaan.\nSelaimissa on mahdollista etsiä nopeasti kappaleita, jotka alkavat ruudun vasemmasta reunasta katsottuna samasta kohdasta, kuten esim. ensimmäisen tason kommentit hierarkkisessa kommenttipuussa.\nLisäksi se mahdollistaa useiden ohjelmointikielien lähdekoodia muokattaessa siirtymisen samalla sisennystasolla olevien rivien välillä sekä sellaisten rivien nopean etsimisen, joilla on suurempi tai pienempi sisennystaso."
    },
    {
      "language": "fr",
      "displayName": "IndentNav",
      "description": "Module complémentaire de navigation par indentation.\nCe module complémentaire permet aux utilisateurs de NVDA de naviguer par niveau d'indentation ou par décalage de lignes ou de paragraphes.\n Dans les navigateurs, il permet de trouver rapidement des paragraphes ayant le même décalage par rapport au bord gauche de l'écran, tels que des commentaires de premier niveau dans un arbre hiérarchique de commentaires.\nAussi lors de l'édition du code source dans de nombreux langages de programmation, il permet de sauter entre les lignes du même niveau d'indentation, ainsi que de trouver rapidement des lignes avec un niveau d'indentation plus ou moins élevé."
    },
    {
      "language": "gl",
      "displayName": "IndentNav",
      "description": "Complemento para a navegación por indentación.\nPermite aos usuarios moverse por nivel de indentación ou sangrado de liñas ou parágrafos.\nEn navegadores permite atopar parágrafos co mesmo desprazamento dende o bordo esquerdo da pantalla, como comentarios de primeiro nivel nunha árbore xerárquica de comentarios.\nTamén ao editar código en varias linguaxes de programación, permite saltar entre as liñas co mesmo nivel de indentación, así como atopar liñas con maior ou menor nivel de indentación."
    },
    {
      "language": "he",
      "displayName": "IndentNav",
      "description": "תוסף זה מאפשר לנווט בקלות בין רמות כניסה שונות של פיסקאות ושורות.כך למשל במסמכים או בגלישה באינטרנט תוכלו לנווט לפיסקה שרמת הכניסה שלה זהה לזו שאתם מצויים בה. הדבר שימושי מאוד כשמדובר למשל בניווט בין תשובות לשאלות או מידע אחר בו יש הקפדה על כניסה ברמות משתנות והכניסה היא בעלת משמעות.כך גם בעורכי קוד תוכלו לנווט לשורות באותה רמת כניסה או לשורות ברמות גדולות או נמוכות מזו שאתם מצויים בה."
    },
    {
      "language": "hr",
      "displayName": "Kretanje po uvlakama",
      "description": "Dodatak za kretanje po uvlakama.\nOmogućuje NVDA korisnicima kretanje po razinama uvlačenja redaka ili po odmacima redaka ili po odlomcima.\nU preglednicima omogućuje brzo pronalaženje odlomaka s istim odmakom od lijevog ruba ekrana, poput komentara prve razine u hijerarhijskom stablu komentara.\nTakođer, tijekom uređivanja izvornog koda programskih jezika, omogućuje kretanje između redaka iste razine uvlačenja, kao i brzo pronalaženje redaka s većom ili manjom uvlakom."
    },
    {
      "language": "it",
      "displayName": "IndentNav",
      "description": "Componente aggiuntivo Indentation Navigation.\nConsente agli utenti di NVDA di navigare per livelli di rientri, oppure per gruppi di righe o anche per paragrafi.\nNei browser permette di trovare rapidamente i paragrafi basandosi sulla medesima distanza dal bordo sinistro dello schermo, per esempio in una visualizzazione ad albero di commenti, ci si potrà spostare solo tra i commenti del primo livello della gerarchia.\nAnche quando si modifica il codice sorgente di molti linguaggi di programmazione, consente di passare velocemente tra le righe dello stesso livello di rientro, oppure individuare le righe con un livello di rientro più grande o più piccolo."
    },
    {
      "language": "pt_BR",
      "displayName": "IndentNav — Navegação por Recuo",
      "description": "Complemento de Navegação por Recuo (indentação).\nPermite aos usuários do NVDA navegar por nível de recuo — endentação — ou deslocamento de linhas ou parágrafos.\nEm navegadores, permite localizar rapidamente os parágrafos com o mesmo deslocamento da borda esquerda da tela, como comentários de primeiro nível em uma árvore hierárquica de comentários.\nAlém disso, ao editar o código fonte em muitas linguagens de programação, permite saltar entre as linhas do mesmo nível de recuo, bem como encontrar rapidamente linhas com maior ou menor nível de recuo."
    },
    {
      "language": "pt_PT",
      "displayName": "IndentNav",
      "description": "Addon de navegação por indentação.\nPermite aos utilizadores do NVDA navegar por nível de indentação ou compensação de linhas ou parágrafos.\nNos navegadores, permite encontrar rapidamente parágrafos com o mesmo deslocamento a partir da borda esquerda do ecrã, como comentários de primeiro nível numa árvore hierárquica de comentários.\nAlém disso, ao editar o código-fonte, em muitas linguagens de programação, permite saltar entre as linhas do mesmo nível de indentação, bem como localizar rapidamente as linhas com maior ou menor nível de indentação."
    },
    {
      "language": "ro",
      "displayName": "IndentNav",
      "description": "Supliment pentru indentarea navigării.\nAcesta permite utilizatorilor NVDA să navigheze după nivel de indentare sau offset de linii sau paragrafe"
    },
    {
      "language": "sk",
      "displayName": "Navigácia po odsadeniach",
      "description": "Doplnok na lepšiu navigáciu po odsadeniach.\nUmožňuje rýchly skok na odsadené riadky a odseky alebo na časti s rovnakým odsadeným.\nV režime prehliadania môžete napríklad rýchlo skákať po odsekoch s rovnakým odsadením, zväčša komentároch prvej úrovne.\nPri programovaní môžete skákať na riadky s rovnakým odsadením, prípadne skákať len po riadkoch s väčším alebo menším odsadením."
    },
    {
      "language": "sr",
      "displayName": "Navigacija kroz podvučen tekst",
      "description": "Dodatak za navigaciju kroz podvučen tekst.\nDozvoljava NVDA korisnicima navigaciju po nivoima podvlačenja ili po udvajanjima redova.\nU pretraživačima dozvoljava pronalaženje pasusa sa istim nivoom podvlačenja od ekrana, kao što su prvi komentari u nivou hierarhije.\nTakođe u toku uređivanja izvornog koda u puno programskih jezika, dozvoljava pomeranje na redove sa istim nivoom uvlačenja, kao i brzo pronalaženje redova sa manjim ili većim uvlačenjem."
    },
    {
      "language": "uk",
      "displayName": "Навігація за відступами",
      "description": "Додаток Навігація за відступами.\nДозволяє користувачам NVDA здійснювати навігацію за рівнем відступу або зміщенням рядків чи абзаців.\nУ браузерах дає можливість швидко знаходити абзаци з однаковим зміщенням від лівого краю екрана, наприклад коментарі першого рівня в ієрархічному дереві коментарів.\nТакож під час редагування вихідного коду на багатьох мовах програмування цей додаток дозволяє переходити між рядками одного рівня відступу, а також швидко знаходити рядки з більшим чи меншим рівнем відступу."
    },
    {
      "language": "zh_CN",
      "displayName": "缩进导航",
      "description": "缩进导航插件。\n此插件允许 nvda 用户按缩进级别或行或段落的偏移量进行浏览。\n在浏览器中, 可以从屏幕的左边缘快速查找具有相同偏移量的段落, 例如分层注释树中的第一级注释。\n此外, 在许多编程语言中编辑源代码时, 还允许在相同缩进级别的行之间跳转, 并快速查找具有较大或较小缩进级别的行。"
    }
  ],
  "reviewUrl": "https://github.com/nvaccess/addon-datastore/discussions/3288"
}
