{
	"addonId": "linkLibrary",
	"displayName": "Link Library",
	"URL": "https://github.com/ibrahim-s/linkLibrary/releases/download/2.2.2/linkLibrary-2.2.2.nvda-addon",
	"description": "This addon helps the user to arrange his links or bookmarks in library like way.\nFrom the main dialog of libraries, you can choose the library or category you like and press enter on it.\nOn the opened dialog, you will have all links in that category in a list and have access to source url an the about info of each llink if present.\nThis addon does not come with a default or assigned gesture or shortcut to it\nYou can as always add a gesture or change the existed one going to :\nNVDA menu>preferences>inputGestures>Link Library.",
	"sha256": "b38525219945e7333054fb6e0c60c43be32e31aa31ea790452c6ae721ee12045",
	"addonVersionName": "2.2.2",
	"addonVersionNumber": {
		"major": 2,
		"minor": 2,
		"patch": 2
	},
	"minNVDAVersion": {
		"major": 2021,
		"minor": 1,
		"patch": 0
	},
	"lastTestedVersion": {
		"major": 2025,
		"minor": 1,
		"patch": 0
	},
	"channel": "stable",
	"publisher": "Ibrahim Hamadeh",
	"sourceURL": "https://github.com/ibrahim-s/linkLibrary",
	"license": "GPL v2",
	"homepage": "https://github.com/ibrahim-s/linkLibrary",
	"changelog": "Now, it is possible to export a library with it's sublibraries as html file, and then if you wish, integrate it into firefox bookmarks.\n",
	"licenseURL": "https://www.gnu.org/licenses/gpl-2.0.html",
	"submissionTime": 1763092949000,
	"translations": [
		{
			"language": "ar",
			"displayName": "مكتبةْ الروابط",
			"description": "هذه الإضافةُ تتيحُ للمستخدمِ عمل مكتبة لِتنظيم و ترتيب الروابط الخاصة به.\nمِن المُحاوَرة الرئيسية للمكتبات, يُمكنك اختيار المكتبة التي تشاء و فَتحها بالضغط إنتر عليها.\nو في المحاورة التي ستظهر, يُمكنك الإطِّلاع علىجميع الروابط في هذه المكتبة في قائمة و معلومات حول أي رابط و قيمته إذا كان ذلك موجودا.\nهذه الإضافةُ لا يُوجد اختصار افتراضي خاص بها\nو كما هو معروف فيُمكنكَ تغيير أو إضافةْ اختصار لها بالذهاب إلى:\nقائمةْ NVDA(NVDA+N)>تفضيلات>تخصيص اختصارات NVDA>مكتبةُ الروابط.",
			"changelog": "الآن، من الممكن تصدير مكتبة مع مكتباتها الفرعية كملف html، ثم إذا كنت ترغب، يمكنك بعدها دمجها في علامات فايرفوكس المرجعية.\n"
		},
		{
			"language": "en",
			"displayName": "Link Library",
			"description": "This addon helps the user to arrange his links or bookmarks in library like way.\nFrom the main dialog of libraries, you can choose the library or category you like and press enter on it.\nOn the opened dialog, you will have all links in that category in a list and have access to source url an the about info of each llink if present.\nThis addon does not come with a default or assigned gesture or shortcut to it\nYou can as always add a gesture or change the existed one going to :\nNVDA menu>preferences>inputGestures>Link Library.",
			"changelog": "Now, it is possible to export a library with it's sublibraries as html file, and then if you wish, integrate it into firefox bookmarks.\n"
		},
		{
			"language": "pt",
			"displayName": "Biblioteca de links",
			"description": "Este extra ajuda o utilizador a organizar os seus links ou marcadores de página em bibliotecas.\nA partir do diálogo principal das bibliotecas, pode escolher a biblioteca ou categoria que gosta e pressionar enter nela.\nNo diálogo aberto, terá todos os links dessa categoria, numa lista e terá acesso à url de origem e à informação sobre cada link, se presente.\nEste extra não vem com uma tecla de atalho atribuído\nPode, como sempre, adicionar um atalho ou mudar o já existente :\nMenu do NVDA>preferências>definir comandos>biblioteca de links.",
			"changelog": "Now, it is possible to export a library with it's sublibraries as html file, and then if you wish, integrate it into firefox bookmarks.\n"
		},
		{
			"language": "ru",
			"displayName": "Link Library (Библиотека ссылок)",
			"description": "Это дополнение помогает пользователю упорядочивать свои ссылки или закладки по принципу библиотеки.\nВ главном диалоговом окне библиотек вы можете выбрать понравившуюся библиотеку или категорию и нажать на ней enter.\nВ открывшемся диалоговом окне вы увидите список всех ссылок в этой категории и получите доступ к URL-адресу источника и информации о каждой ссылке, если она присутствует.\nЭто дополнение  не имеет сочетаний клавиш, назначенных по умолчанию. Вы можете, как всегда, добавить  новое сочитание клавиш или изменить существующее, перейдя по пути:\nNVDA меню, Параметры, Жесты ввода , Библиотека ссылок.",
			"changelog": "Now, it is possible to export a library with it's sublibraries as html file, and then if you wish, integrate it into firefox bookmarks.\n"
		},
		{
			"language": "tr",
			"displayName": "Bağlantı Kitaplığı",
			"description": "Bu eklenti, kullanıcının bağlantılarını veya yer imlerini kitaplıktaki gibi düzenlemesine yardımcı olur..\nKitaplıkların ana iletişim kutusundan, beğendiğiniz kitaplığı veya kategoriyi seçip enter tuşuna basabilirsiniz.\nAçılan iletişim kutusunda, o kategorideki tüm bağlantılara bir listede sahip olacaksınız ve kaynak url'ye ve varsa her bağlantının hakkında bilgisine erişebileceksiniz.\nBu eklenti, varsayılan veya atanmış bir hareket veya kısayol ile gelmiyor\nHer zaman olduğu gibi bir hareket ekleyebilir veya mevcut olanı şu şekilde değiştirebilirsiniz:\nNVDA menüsü>tercihler>Girdi hareketleri>Bağlantı Kitaplığı.",
			"changelog": "Now, it is possible to export a library with it's sublibraries as html file, and then if you wish, integrate it into firefox bookmarks.\n"
		},
		{
			"language": "uk",
			"displayName": "Бібліотека посилань",
			"description": "Цей додаток допомагає користувачеві розташувати посилання або закладки у вигляді бібліотеки.\nВ головному діалозі бібліотек ви можете вибрати бібліотеку або категорію, що вам сподобалася, і натиснути на ній клавішу Enter.\nВ діалозі, що відкрився, у вас буде список всіх посилань в цій категорії і доступ до вихідного url та інформація про кожне посилання, якщо воно присутнє.\nЦей додаток початково не має призначених гарячих клавіш\nВи можете додати гарячі клавіші або змінити існуючі, перейшовши в:\nNVDA меню>Параметри>Жести вводу>Бібліотека посилань.",
			"changelog": "Now, it is possible to export a library with it's sublibraries as html file, and then if you wish, integrate it into firefox bookmarks.\n"
		},
		{
			"language": "zh_CN",
			"displayName": "链接库",
			"description": "这个插件可以帮助用户以图书馆的方式排列他的链接或书签。从链接库的主对话框中，您可以选择您喜欢的库或类别，然后按回车键。在打开的对话框中，您将获得该类别中的所有链接列表，并可以访问源URL和每个链接的关于信息（如果存在）。此插件不带有默认或分配的手势或快捷方式。您可以像往常一样添加手势或更改现有的手势，转到：NVDA菜单>首选项>输入手势>链接库。",
			"changelog": "Now, it is possible to export a library with it's sublibraries as html file, and then if you wish, integrate it into firefox bookmarks.\n"
		}
	]
}