{"addonId": "NativeSpeechGeneration", "displayName": "NativeSpeechGeneration", "URL": "https://github.com/MuhammadGagah/native-speech-generation/releases/download/v1.0/NativeSpeechGeneration-1.0.nvda-addon", "description": "Harness the power of Google's state-of-the-art Gemini AI for high-quality speech generation directly within NVDA. This add-on provides a user-friendly dialog to convert text into natural-sounding audio.\n\nKey Features:\n- High-Quality Voices: Choose between Gemini Pro for premium, life-like speech and Gemini Flash for standard quality, responsive generation.\n- Single and Multi-Speaker Modes: Easily generate audio for a single speaker or create dynamic dialogues with two distinct speakers. Simply format your text with \"SpeakerName:\" to assign voices.\n- Advanced Voice Control: Fine-tune the output by adjusting the temperature for more creative or stable results, and provide custom style instructions.\n- Accessible Interface: All controls are fully accessible, including a collapsible panel for advanced settings to keep the interface clean and easy to navigate.\n- Seamless Workflow: The add-on provides instant audio playback upon generation and allows you to save the resulting .wav file for later use.\n\nTo get started, obtain a Gemini API key from Google AI Studio and enter it in the add-on's settings panel, found under NVDA's Tools menu.", "sha256": "aced2e528749cd7f261173d09d32f1f0c0058c8813eb7a5d55a73f6c8b1b579c", "addonVersionName": "1.0", "addonVersionNumber": {"major": 1, "minor": 0, "patch": 0}, "minNVDAVersion": {"major": 2023, "minor": 1, "patch": 0}, "lastTestedVersion": {"major": 2025, "minor": 1, "patch": 0}, "channel": "stable", "publisher": "Muhammad", "sourceURL": "https://github.com/MuhammadGagah/native-speech-generation/", "license": "GPL v2", "homepage": "https://github.com/MuhammadGagah/native-speech-generation/", "licenseURL": "https://www.gnu.org/licenses/gpl-2.0.html", "submissionTime": 1756171420000, "vtScanUrl": "https://www.virustotal.com/gui/file/aced2e528749cd7f261173d09d32f1f0c0058c8813eb7a5d55a73f6c8b1b579c"}