{
	"addonId": "YoutubePlus",
	"displayName": "YouTubePlus",
	"URL": "https://github.com/NVDATH/Youtube-Plus-for-NVDA/releases/download/v2026.2.28/YoutubePlus-2026.2.28.nvda-addon",
	"description": "YoutubePlus is an add-on for those who enjoy YouTube but find many web features difficult to access, such as reading video comments.\nWe bring these features to you through the NVDA user interface in an accessible, shortcut-driven, and customizable format.\nUsers do not need to deal with API keys or link any personal data to the add-on.\n\nfeatures:       \n• You can follow your favorite channels and be certain that you will see every video they post without being filtered out by YouTube's algorithm.\n• we offer a Favorites system for videos, channels, playlists, and a Watch List for saving videos you're interested in but don't have time to watch yet.\n• built-in search system that displays results within the same accessible UI as other features, rather than just providing a search box that opens the web results.\n• included download feature for saving videos or audio files.",
	"sha256": "529d91e45b026b27915235fafdde54a8c595be3ebc0c755cb0648ac0a2921c0f",
	"addonVersionName": "2026.2.28",
	"addonVersionNumber": {
		"major": 2026,
		"minor": 2,
		"patch": 28
	},
	"minNVDAVersion": {
		"major": 2025,
		"minor": 1,
		"patch": 0
	},
	"lastTestedVersion": {
		"major": 2025,
		"minor": 3,
		"patch": 3
	},
	"channel": "stable",
	"publisher": "NVDA_TH",
	"sourceURL": "https://github.com/NVDATH/Youtube-Plus-for-NVDA/",
	"license": "GPL v2",
	"homepage": "https://nvda.in.th/youtube-plus",
	"licenseURL": "https://www.gnu.org/licenses/gpl-2.0.html",
	"submissionTime": 1772312015000,
	"translations": [
		{
			"language": "th",
			"displayName": "YoutubePlus",
			"description": "YoutubePlus เป็นส่วนเสริมสำหรับผู้ที่ชื่นชอบ YouTube แต่พบว่าคุณลักษณะทางเว็บมากมายเข้าถึงได้ยาก เช่น การอ่านความคิดเห็นของวิดีโอ\nเรานำคุณสมบัติเหล่านี้มาสู่คุณผ่านอินเทอร์เฟซผู้ใช้ NVDA ในรูปแบบที่เข้าถึงได้ ใช้ทางลัด และรูปแบบที่ปรับแต่งได้\nผู้ใช้ไม่จำเป็นต้องจัดการกับคีย์ API หรือเชื่อมโยงข้อมูลส่วนบุคคลใดๆ กับส่วนเสริม\n\nคุณสมบัติ: \n• คุณสามารถติดตามช่องโปรดของคุณและมั่นใจได้ว่าคุณจะเห็นทุกวิดีโอที่พวกเขาโพสต์โดยไม่ถูกกรองออกโดยอัลกอริทึมของ YouTube\n• เรานำเสนอระบบรายการโปรดสำหรับวิดีโอ ช่อง เพลย์ลิสต์ และรายการเฝ้าดูสำหรับบันทึกวิดีโอที่คุณสนใจแต่ยังไม่มีเวลาดู\n• ระบบค้นหาในตัวที่แสดงผลลัพธ์ภายใน UI ที่สามารถเข้าถึงได้เช่นเดียวกับคุณลักษณะอื่นๆ แทนที่จะจัดให้มีช่องค้นหาที่เปิดผลลัพธ์บนเว็บ\n• รวมคุณสมบัติการดาวน์โหลดสำหรับการบันทึกวิดีโอหรือไฟล์เสียง"
		}
	]
}