{"addonId": "nvdaDevTestToolbox", "displayName": "Caixa de ferramentas de desenvolvimento e teste NVDA", "URL": "https://github.com/CyrilleB79/NVDA-Dev-Test-Toolbox/releases/download/V8.0/nvdaDevTestToolbox-8.0.nvda-addon", "description": "Um conjunto de ferramentas para desenvolvedores e testadores de NVDA.", "sha256": "e6a36110baaf682fe51277cc5b5e134a0c9720d9c94edf23868e3091ac34f7a6", "addonVersionName": "8.0", "addonVersionNumber": {"major": 8, "minor": 0, "patch": 0}, "minNVDAVersion": {"major": 2019, "minor": 2, "patch": 0}, "lastTestedVersion": {"major": 2025, "minor": 3, "patch": 1}, "channel": "stable", "publisher": "Cyrille Bougot", "sourceURL": "https://github.com/CyrilleB79/NVDA-Dev-Test-Toolbox", "license": "GPL v2", "homepage": "https://github.com/CyrilleB79/NVDA-Dev-Test-Toolbox", "changelog": "* Python console history can now be preserved accross restarts.\n* Reverse translation: Added a second command to reverse translate a string using both NVDA and its add-ons translations.\n* New log reader commans to jump to previous or next braille output message\n* New log reader commans to jump to previous or next block in a message, e.g. previous or next thread stack in a watchdog freeze report, previous or next block of properties in the developer info for navigator object, etc.\n* New log reader commands to jump to the first or last interesting line of a block, e.g. first or last frame of a traceback\n* A new log reader \"Go to error\" command to jump to the error in a traceback frame.\n* A new log reader command to display an help message listing all the available commands while reading a log.\n* The log reading mode is now enabled by default in the Python console output pane.\n* A new command to anonymize a log\n* The console startup script now supports unicode strings (for Python 3 only); full unicode file may not be supported though.\n* The Python console startup script will now only be executed once and only once when the console opens.\nA bug where this script could be executed many times when reloading the add-ons has been fixed.\n* Improved error handling in the console startup script.\n* Bugfix: An empty log files created when log is disabled do not fail anymore to be saved as old log.\n* Speech on demand is now supported in layered commands\n* Improved error handling of the script opener command (in case of wrong or missing configuration, or when a braille display is in use).\n", "licenseURL": "https://www.gnu.org/licenses/gpl-2.0.html", "submissionTime": 1762812898000}